Repository: OpenDroneMap/odm-docs
Catalog: source/locale/*/LC_MESSAGES/arguments.po
Languages: te

source: Options and Flags
te: ఎంపికలు మరియు ఫ్లాగ్స్

source: Arguments
te: ఆర్గుమెంట్స్

source: Show help message and exit.
te: సహాయ సందేశాన్ని చూపించి నిష్క్రమించండి.

source: Path to input images.
te: చిత్రాలను ఇన్పుట్ చేయడానికి మార్గం.

source: Path to the project folder.
te: ప్రాజెక్ట్ ఫోల్డర్‌కు మార్గం.

source: Resizes images by the largest side for opensfm. Set to ``-1`` to disable.
te: Openfm కోసం అతిపెద్ద వైపు చిత్రాలను పున izes పరిమాణం చేస్తుంది. నిలిపివేయడానికి `` -1`` కు సెట్ చేయండి.

source: Default: ``2048``
te: డిఫాల్ట్: ``2048``

source: Options: ``dataset`` | ``split`` | ``merge`` | ``opensfm`` | ``mve`` | ``odm_filterpoints`` | ``odm_meshing`` | ``mvs_texturing`` | ``odm_georeferencing`` | ``odm_dem`` | ``odm_orthophoto``
te: ఎంపికలు: `` డేటాసెట్`` | `` స్ప్లిట్`` | `` విలీనం`` | `` ఓపెన్‌ఎఫ్‌ఎమ్`` | `` mve`` | `` odm_filterpoints`` | `` odm_meshing`` | `` mvs_texturing`` | `` odm_georeferencing`` | `` odm_dem`` | `` odm_orthophoto``

source: Generates Entwine Point Cloud. Useful on its own, this flag is automatically added when running in WebODM and useful for creating the correct directory structure when running on NodeODM or command line for import into WebODM.
te: ఎంట్వైన్ పాయింట్ క్లౌడ్‌ను ఉత్పత్తి చేస్తుంది. వెబ్‌ఓడిఎమ్‌లో నడుస్తున్నప్పుడు ఈ జెండా స్వయంచాలకంగా జతచేయబడుతుంది మరియు వెబ్‌ఓడిఎమ్‌లోకి దిగుమతి కోసం నోడ్ఓడిఎమ్ లేదా కమాండ్ లైన్‌లో నడుస్తున్నప్పుడు సరైన డైరెక్టరీ నిర్మాణాన్ని సృష్టించడానికి ఉపయోగపడుతుంది.

source: Force rerun of all tasks.
te: అన్ని పనులను తిరిగి ప్రారంభించండి.

source: Projection used to transform the model into geographic coordinates.
te: మోడల్‌ను భౌగోళిక కోఆర్డినేట్‌లుగా మార్చడానికి ఉపయోగించే ప్రొజెక్షన్.

source: Minimum number of features to extract per image. More features leads to better results but slower execution.
te: ప్రతి చిత్రానికి సంగ్రహించడానికి కనీస సంఖ్య లక్షణాలు. మరిన్ని లక్షణాలు మంచి ఫలితాలకు దారితీస్తాయి కాని నెమ్మదిగా అమలు చేస్తాయి.

source: Default: ``8000``
te: డిఫాల్ట్: ``8000``

source: Set feature extraction quality. Higher quality generates better features, but requires more memory and takes longer.
te: ఫీచర్ వెలికితీత నాణ్యతను సెట్ చేయండి. అధిక నాణ్యత మంచి లక్షణాలను ఉత్పత్తి చేస్తుంది, కానీ ఎక్కువ మెమరీ అవసరం మరియు ఎక్కువ సమయం పడుతుంది.

source: Options: ``ultra`` | ``high`` | ``medium`` | ``low`` | ``lowest``
te: ఎంపికలు: `` అల్ట్రా`` | `` అధిక`` | `` మీడియం`` | `` తక్కువ`` | `` అత్యల్ప``

source: Default: ``high``
te: డిఫాల్ట్: `` అధిక``

source: Number of nearest images to pre-match based on GPS exif data. Set to ``0`` to skip pre-matching. Neighbors works together with Distance parameter, set both to 0 to not use pre-matching. OpenSFM uses both parameters at the same time, Bundler uses only one which has value, prefering the Neighbors parameter.
te: GPS ఎగ్జిఫ్ డేటా ఆధారంగా ప్రీ-మ్యాచ్ చేయడానికి సమీప చిత్రాల సంఖ్య. ముందస్తు సరిపోలికను దాటవేయడానికి `` 0`` కు సెట్ చేయండి. పొరుగువారు దూర పరామితితో కలిసి పనిచేస్తారు, ముందస్తు సరిపోలికను ఉపయోగించకుండా రెండింటినీ 0 గా సెట్ చేయండి. OpenSFM రెండు పారామితులను ఒకేసారి ఉపయోగిస్తుంది, బండ్లర్ విలువను కలిగి ఉన్న ఒకదాన్ని మాత్రమే ఉపయోగిస్తుంది, నైబర్స్ పరామితికి ప్రాధాన్యత ఇస్తుంది.

source: Default: ``8``
te: డిఫాల్ట్: `` 8``

source: Distance threshold in meters to find pre-matching images based on GPS exif data. Set both ``matcher-neighbors`` and this to ``0`` to skip pre-matching.
te: GPS ఎగ్జిఫ్ డేటా ఆధారంగా ప్రీ-మ్యాచింగ్ చిత్రాలను కనుగొనడానికి మీటర్లలో దూర ప్రవేశం. ముందస్తు సరిపోలికను దాటవేయడానికి `` సరిపోలిక-పొరుగువారి`` మరియు ఇది `` 0`` కు సెట్ చేయండి.

source: Default: ``0``
te: డిఫాల్ట్: `` 0``

source: Turn off camera parameter optimization during bundler. Off by default unless ``--camera`` parameter used.
te: బండ్లర్ సమయంలో కెమెరా పారామితి ఆప్టిమైజేషన్‌ను ఆపివేయండి. `` - కెమెరా`` పరామితి ఉపయోగించకపోతే డిఫాల్ట్‌గా ఆఫ్.

source: Set a camera projection type. Manually setting a value can help improve geometric undistortion. By default the application tries to determine a lens type from the images metadata.
te: కెమెరా ప్రొజెక్షన్ రకాన్ని సెట్ చేయండి. విలువను మాన్యువల్‌గా సెట్ చేయడం రేఖాగణిత తొలగింపును మెరుగుపరచడంలో సహాయపడుతుంది. డిఫాల్ట్‌గా అనువర్తనం చిత్రాల మెటాడేటా నుండి లెన్స్ రకాన్ని నిర్ణయించడానికి ప్రయత్నిస్తుంది.

source: Options: ``auto`` | ``perspective`` | ``brown`` | ``fisheye`` | ``spherical``
te: ఎంపికలు: `` ఆటో`` | `` దృక్పథం`` | `` బ్రౌన్`` | `` ఫిషీ`` | `` గోళాకార``

source: Default: ``auto``
te: డిఫాల్ట్: `` ఆటో``

source: Set the radiometric calibration to perform on images. When processing multispectral images you should set this option to obtain reflectance values (otherwise you will get digital number (DN) values).
te: చిత్రాలపై ప్రదర్శించడానికి రేడియోమెట్రిక్ క్రమాంకనాన్ని సెట్ చేయండి. మల్టీస్పెక్ట్రల్ చిత్రాలను ప్రాసెస్ చేస్తున్నప్పుడు మీరు ప్రతిబింబ విలువలను పొందటానికి ఈ ఎంపికను సెట్ చేయాలి (లేకపోతే మీరు డిజిటల్ సంఖ్య (DN) విలువలను పొందుతారు).

source: [``camera``] applies black level, vignetting, row gradient gain/exposure compensation (if appropriate EXIF tags are found).
te: [`` కెమెరా``] బ్లాక్ లెవల్, విగ్నేటింగ్, రో గ్రేడియంట్ లాభం / ఎక్స్‌పోజర్ పరిహారం (తగిన ఎక్సిఫ్ ట్యాగ్‌లు కనుగొనబడితే) వర్తిస్తుంది.

source: [``camera+sun``] is experimental, applies all the corrections of [``camera``] and additionally compensates for spectral radiance registered via a downwelling light sensor (DLS) taking in consideration the angle of the sun.
te: [```కెమెరా + సూర్యుడు``] ప్రయోగాత్మకమైనది, [```కెమెరా``] యొక్క అన్ని దిద్దుబాట్లను వర్తిస్తుంది మరియు అదనంగా సూర్యుని కోణాన్ని పరిగణనలోకి తీసుకొని డౌన్‌వెల్లింగ్ లైట్ సెన్సార్ (DLS) ద్వారా నమోదు చేయబడిన స్పెక్ట్రల్ రేడియన్స్‌కు పరిహారం ఇస్తుంది.

source: Options: ``none`` | ``camera`` | ``camera+sun``
te: ఎంపికలు: `` ఏదీ`` | `` కెమెరా`` | `` కెమెరా + సూర్యుడు``

source: Default: ``none``
te: డిఫాల్ట్: `` ఏదీ``

source: The maximum number of processes to use in various processes. Peak memory requirement is ~1GB per thread and 2 megapixel image resolution.
te: వివిధ ప్రక్రియలలో ఉపయోగించాల్సిన గరిష్ట సంఖ్యల ప్రక్రియలు. పీక్ మెమరీ అవసరం థ్రెడ్‌కు GB 1GB మరియు 2 మెగాపిక్సెల్ ఇమేజ్ రిజల్యూషన్.

source: Default: *number of cores*
te: డిఫాల్ట్: * కోర్ల సంఖ్య *

source: Controls the density of the point cloud by setting the resolution of the depthmap images. Higher values take longer to compute and more memory but produce denser point clouds.
te: లోతు మ్యాప్ చిత్రాల రిజల్యూషన్‌ను సెట్ చేయడం ద్వారా పాయింట్ క్లౌడ్ యొక్క సాంద్రతను నియంత్రిస్తుంది. అధిక విలువలు గణించడానికి ఎక్కువ సమయం పడుతుంది మరియు ఎక్కువ మెమరీ కానీ దట్టమైన పాయింట్ మేఘాలను ఉత్పత్తి చేస్తాయి.

source: Default: ``640``
te: డిఫాల్ట్: `` 640``

source: Minimum number of views that should reconstruct a point for it to be valid. Use lower values if your images have less overlap. Lower values result in denser point clouds but with more noise. Only applies if using OpenSfM for dense matching.
te: ఒక పాయింట్ చెల్లుబాటు అయ్యేలా పునర్నిర్మించాల్సిన కనీస వీక్షణలు. మీ చిత్రాలు తక్కువ అతివ్యాప్తి కలిగి ఉంటే తక్కువ విలువలను ఉపయోగించండి. తక్కువ విలువలు దట్టమైన పాయింట్ మేఘాలకు కారణమవుతాయి కాని ఎక్కువ శబ్దంతో ఉంటాయి. దట్టమైన సరిపోలిక కోసం OpenSfM ఉపయోగిస్తే మాత్రమే వర్తిస్తుంది.

source: Default: ``3``
te: డిఫాల్ట్: `` 3``

source: Raw depthmap computation algorithm. ``PATCH_MATCH`` and ``PATCH_MATCH_SAMPLE`` are faster, but might miss some valid points. ``BRUTE_FORCE`` takes longer but produces denser reconstructions.
te: ముడి లోతు మ్యాప్ గణన అల్గోరిథం. `` PATCH_MATCH`` మరియు `` PATCH_MATCH_SAMPLE`` వేగంగా ఉంటాయి, కానీ కొన్ని చెల్లుబాటు అయ్యే పాయింట్లను కోల్పోవచ్చు. `` BRUTE_FORCE`` ఎక్కువ సమయం తీసుకుంటుంది కాని దట్టమైన పునర్నిర్మాణాలను ఉత్పత్తి చేస్తుంది.

source: Options: ``PATCH_MATCH`` | ``PATCH_MATCH_SAMPLE`` | ``BRUTE_FORCE``
te: ఎంపికలు: `` PATCH_MATCH`` | `` PATCH_MATCH_SAMPLE`` | `` BRUTE_FORCE``

source: Default: ``PATCH_MATCH``
te: డిఫాల్ట్: `` PATCH_MATCH```

source: When using ``PATCH_MATCH`` or ``PATCH_MATCH_SAMPLE``, controls the standard deviation threshold to include patches. Patches with lower standard deviation are ignored.
te: `` PATCH_MATCH`` లేదా `` PATCH_MATCH_SAMPLE`` ఉపయోగిస్తున్నప్పుడు, పాచెస్‌ను చేర్చడానికి ప్రామాణిక విచలనం ప్రవేశాన్ని నియంత్రిస్తుంది. తక్కువ ప్రామాణిక విచలనం కలిగిన పాచెస్ విస్మరించబడతాయి.

source: Default: ``1``
te: డిఫాల్ట్: `` 1``

source: Run local bundle adjustment for every image added to the reconstruction and a global adjustment every 100 images. Speeds up reconstruction for very large datasets.
te: పునర్నిర్మాణానికి జోడించిన ప్రతి చిత్రం కోసం స్థానిక బండిల్ సర్దుబాటు మరియు ప్రతి 100 చిత్రాలకు ప్రపంచ సర్దుబాటును అమలు చేయండి. చాలా పెద్ద డేటాసెట్ల కోసం పునర్నిర్మాణాన్ని వేగవంతం చేస్తుంది.

source: Discard points that have less than a certain confidence threshold. This only affects dense reconstructions performed with MVE. Higher values discard more points.
te: నిర్దిష్ట విశ్వాస పరిమితి కంటే తక్కువ ఉన్న పాయింట్లను విస్మరించండి. ఇది MVE తో చేసిన దట్టమైన పునర్నిర్మాణాలను మాత్రమే ప్రభావితం చేస్తుంది. అధిక విలువలు ఎక్కువ పాయింట్లను విస్మరిస్తాయి.

source: Default: ``0.6``
te: డిఫాల్ట్: `` 0.6``

source: Use a full 3D mesh to compute the orthophoto instead of a 2.5D mesh. This option is a bit faster and provides similar results in planar areas.
te: 2.5 డి మెష్‌కు బదులుగా ఆర్థోఫోటోను లెక్కించడానికి పూర్తి 3D మెష్‌ను ఉపయోగించండి. ఈ ఐచ్చికము కొంచెం వేగంగా ఉంటుంది మరియు ప్లానార్ ప్రాంతాలలో ఇలాంటి ఫలితాలను అందిస్తుంది.

source: Skip generation of a full 3D model. This can save time if you only need 2D results such as orthophotos and DEMs.
te: పూర్తి 3D మోడల్ యొక్క తరం దాటవేయి. మీకు ఆర్థోఫోటోస్ మరియు DEM లు వంటి 2D ఫలితాలు మాత్రమే అవసరమైతే ఇది సమయాన్ని ఆదా చేస్తుంది.

source: Use opensfm to compute dense point cloud alternatively.
te: ప్రత్యామ్నాయంగా దట్టమైన పాయింట్ క్లౌడ్‌ను లెక్కించడానికి opensfm ని ఉపయోగించండి.

source: Ignore Ground Sampling Distance (GSD). GSD caps the maximum resolution of image outputs and resizes images when necessary, resulting in faster processing and lower memory usage. Since GSD is an estimate, sometimes ignoring it can result in slightly better image output quality.
te: గ్రౌండ్ సాంప్లింగ్ దూరాన్ని (జిఎస్‌డి) విస్మరించండి. GSD ఇమేజ్ అవుట్‌పుట్‌ల యొక్క గరిష్ట రిజల్యూషన్‌ను క్యాప్ చేస్తుంది మరియు అవసరమైనప్పుడు చిత్రాల పరిమాణాన్ని మారుస్తుంది, దీని ఫలితంగా వేగంగా ప్రాసెసింగ్ మరియు తక్కువ మెమరీ వినియోగం జరుగుతుంది. GSD ఒక అంచనా కాబట్టి, కొన్నిసార్లు దీనిని విస్మరించడం వలన ఇమేజ్ అవుట్పుట్ నాణ్యత కొంచెం మెరుగ్గా ఉంటుంది.

source: The maximum vertex count of the output mesh.
te: అవుట్పుట్ మెష్ యొక్క గరిష్ట శీర్ష గణన.

source: Default: ``100000``
te: డిఫాల్ట్: ``100000``

source: Oct-tree depth used in the mesh reconstruction, increase to get more vertices, recommended values are 8-12.
te: మెష్ పునర్నిర్మాణంలో ఉపయోగించే అక్టోబర్-చెట్టు లోతు, ఎక్కువ శీర్షాలను పొందడానికి పెంచండి, సిఫార్సు చేసిన విలువలు 8-12.

source: Default: ``9``
te: డిఫాల్ట్: `` 9``

source: Default: ``1.0``
te: డిఫాల్ట్: `` 1.0``

source: This floating point value specifies the importance that interpolation of the point samples is given in the formulation of the screened Poisson equation. The results of the original (unscreened) Poisson Reconstruction can be obtained by setting this value to ``0``.
te: ఈ ఫ్లోటింగ్ పాయింట్ విలువ స్క్రీన్డ్ పాయిసన్ సమీకరణం యొక్క సూత్రీకరణలో పాయింట్ నమూనాల ఇంటర్‌పోలేషన్ ఇవ్వబడిన ప్రాముఖ్యతను తెలుపుతుంది. ఈ విలువను `` 0`` కు సెట్ చేయడం ద్వారా అసలు (స్క్రీన్‌ చేయని) పాయిజన్ పునర్నిర్మాణం యొక్క ఫలితాలను పొందవచ్చు.

source: Default: ``4``
te: డిఫాల్ట్: `` 4``

source: **Experimental.** Skips dense reconstruction and 3D model generation. It generates an orthophoto directly from the sparse reconstruction. If you just need an orthophoto and do not need a full 3D model, turn on this option.
te: ** ప్రయోగాత్మక. ** దట్టమైన పునర్నిర్మాణం మరియు 3D మోడల్ ఉత్పత్తిని దాటవేస్తుంది. ఇది చిన్న పునర్నిర్మాణం నుండి నేరుగా ఆర్థోఫోటోను ఉత్పత్తి చేస్తుంది. మీకు ఆర్థోఫోటో అవసరమైతే మరియు పూర్తి 3D మోడల్ అవసరం లేకపోతే, ఈ ఎంపికను ప్రారంభించండి.

source: Automatically crop image outputs by creating a smooth buffer around the dataset boundaries, shrinked by N meters. Use ``0`` to disable cropping.
te: డేటాసెట్ సరిహద్దుల చుట్టూ మృదువైన బఫర్‌ను సృష్టించడం ద్వారా ఇమేజ్ అవుట్‌పుట్‌లను స్వయంచాలకంగా కత్తిరించండి, ఇది N మీటర్లతో కుదించబడుతుంది. పంటను నిలిపివేయడానికి `` 0`` ఉపయోగించండి.

source: Classify the point cloud outputs using a Simple Morphological Filter. You can control the behavior of this option by tweaking the ``--dem-*`` parameters.
te: సింపుల్ మోర్ఫోలాజికల్ ఫిల్టర్ ఉపయోగించి పాయింట్ క్లౌడ్ అవుట్‌పుట్‌లను వర్గీకరించండి. `` --Dem- * `` పారామితులను సర్దుబాటు చేయడం ద్వారా మీరు ఈ ఎంపిక యొక్క ప్రవర్తనను నియంత్రించవచ్చు.

source: Default: ``False``
te: డిఫాల్ట్: `` తప్పు``

source: Export the georeferenced point cloud in CSV format.
te: CSV ఆకృతిలో జియోరెఫరెన్స్ పాయింట్ క్లౌడ్‌ను ఎగుమతి చేయండి.

source: Export the georeferenced point cloud in LAS format.
te: జియోరెఫరెన్స్ పాయింట్ క్లౌడ్‌ను లాస్ ఆకృతిలో ఎగుమతి చేయండి.

source: Filters the point cloud by removing points that deviate more than N standard deviations from the local mean. Set to ``0`` to disable filtering.
te: స్థానిక సగటు నుండి N ప్రామాణిక విచలనాల కంటే ఎక్కువ వ్యత్యాసమయ్యే పాయింట్లను తొలగించడం ద్వారా పాయింట్ క్లౌడ్‌ను ఫిల్టర్ చేస్తుంది. వడపోతను నిలిపివేయడానికి `` 0`` కు సెట్ చేయండి.

source: Default: ``2.5``
te: డిఫాల్ట్: `` 2.5``

source: Simple Morphological Filter elevation scalar parameter.
te: సింపుల్ మోర్ఫోలాజికల్ ఫిల్టర్ ఎలివేషన్ స్కేలార్ పరామితి.

source: Default: ``1.25``
te: డిఫాల్ట్: `` 1.25``

source: Simple Morphological Filter slope parameter (rise over run).
te: సింపుల్ మోర్ఫోలాజికల్ ఫిల్టర్ వాలు పరామితి (రన్ ఓవర్ రైజ్).

source: Default: ``0.15``
te: డిఫాల్ట్: `` 0.15``

source: Simple Morphological Filter elevation threshold parameter (meters).
te: సింపుల్ మోర్ఫోలాజికల్ ఫిల్టర్ ఎలివేషన్ థ్రెషోల్డ్ పరామితి (మీటర్లు).

source: Default: ``0.5``
te: డిఫాల్ట్: `` 0.5``

source: Simple Morphological Filter window radius parameter (meters).
te: సింపుల్ మోర్ఫోలాజికల్ ఫిల్టర్ విండో వ్యాసార్థ పరామితి (మీటర్లు).

source: Default: ``18.0``
te: డిఫాల్ట్: `` 18.0``

source: Options: ``area`` | ``gmi``
te: ఎంపికలు: `` ప్రాంతం`` | `` జిమి``

source: Default: ``gmi``
te: డిఫాల్ట్: `` gmi``

source: Affects orthophotos only. Higher values result in sharper corners, but can affect color distribution and blurriness. Use lower values for planar areas and higher values for urban areas. The default value works well for most scenarios.
te: ఆర్థోఫోటోస్‌ను మాత్రమే ప్రభావితం చేస్తుంది. అధిక విలువలు పదునైన మూలలకు కారణమవుతాయి, కానీ రంగు పంపిణీ మరియు అస్పష్టతను ప్రభావితం చేస్తాయి. ప్లానార్ ప్రాంతాలకు తక్కువ విలువలు మరియు పట్టణ ప్రాంతాలకు అధిక విలువలను ఉపయోగించండి. డిఫాల్ట్ విలువ చాలా సందర్భాలలో బాగా పనిచేస్తుంది.

source: Default: ``16``
te: డిఫాల్ట్: `` 16``

source: Type of photometric outlier removal method.
te: ఫోటోమెట్రిక్ అవుట్‌లియర్ తొలగింపు పద్ధతి రకం.
