Repository: OpenDroneMap/odm-docs
Catalog: source/locale/*/LC_MESSAGES/contributing.po
Languages: fil

source: How To Contribute
fil: Paano makadaragdag

source: OpenDroneMap relies on community contributions. You can contribute in many ways, even if you are not a programmer.
fil: Ang OpenDroneMap ay produkto ng kontribusyon ng isang grupo na binubuo ng mga tao. Maari kang makaragdag ng kontribusiyon kahit na ikaw ay hindi isang ekspertong programmer.

source: Community Forum
fil: Pagtitipon ng Komunidad

source: If you are looking to get involved, are stuck on a problem, or want to reach out, `the forum <https://community.opendronemap.org/>`_ is a great place to start. You may find your questions already answered or else you can find other useful tips and resources. You can also contribute your open access datasets for others to explore. It is a good place go before submitting bug reports or getting in touch with developers before writing a new feature.
fil: Kung ikaw ay isang indibidwal na gustong makatulong, nagkaroon ng problema at nangangailangan ng tulong, 'ang tugunan na ito <https://community.opendronemap.org/>`_ ay mabisang sanggunian. Maaaring mahanap ang sagot sa tanong at anumang karagdagan na impormasyon gamit ang tugunan na ito. Kung ikaw naman ay may nais ibahagi na datos, hinihikayat namin na gamitin ang platapormang ito sa pagbahagi ng mga karagdagang kaalaman upang makatulong sa iba. Nawa ay masulit ang tugunan na ito bago magsumite ng problema sa ating mga ekspertong.

source: Reporting Bugs
fil: Pagsumite ng mga Sira

source: Bugs are tracked as Github issues. Please create an issue in the repository and tag it with the Bug tag.
fil: Ang mga sira ang itinuturing na isyu ng Github. Maaari lamang na magbigay-ulat sa ating imbakan at markahan ito ng Bug.

source: Explain the problem and include additional details to help maintainers reproduce the problem:
fil: Ilahad ang kompleto na detalye ng problema upang masolusyonan ng eksperto ang problema:

source: **Use a clear and descriptive title** for the issue to identify the problem.
fil: **Gumamit ng klaro at detalyadong deskripsyon sa pamagat** upang mapadali ang pagresolba sa problema.

source: **Describe the exact steps which reproduce the problem** in as many details as possible. For example, start by explaining how you run ODM (Docker, Vagrant, etc), e.g. which command exactly you used in the terminal. When listing steps, **don't just say what you did, but explain how you did it.**
fil: **Isalaysay ang buong pangyayari kung paano nagsimula ang problema** siguraduhin na detalyado ang pagsalaysay. Halimbawa, simulan ang kwento kung paano sinisimulan ang paggamit ng ODM (Docker, Vagrant, etc), kung anong command ang ginamit sa terminal. Kapag nagsalaysay ng mga hakbang, **bigyang eksplanasyon kung paano ginawa ang bawat hakbang.**

source: **Provide specific examples to demonstrate the steps.** Include links to files or GitHub projects, or copy/pasteable snippets, which you use in those examples. If you're providing snippets in the issue, use `Markdown code blocks <https://help.github.com/articles/markdown-basics/#multiple-lines>`_.
fil: **Magbigay ng masinsin na halimbawa kung pano ginawa ang mga hakbang.** Isama ang mga kawing papunta sa mga dokumento o sa mga proyektong GitHub, i-copy/paste ang mga snippet na ginamit sa mga nailathalang halimbawa. Kung ikaw ay magpapasa ng snippet patungkol sa isyu, gamitin ang `Markdown code blocks <https://help.github.com/articles/markdown-basics/#multiple-lines>`_.

source: **Describe the behavior you observed after following the steps** and point out what exactly is the problem with that behavior.
fil: **Isalaysay ang pangyayari na naobserbahan matapos makumpleto ang mga hakbang** at ituro kung ano mismo ang naging sanhi ng problema.

source: **Explain which behavior you expected to see instead and why.**
fil: **Ilahad and kagawian na inaasahan na makita at bakit.**

source: **Include screenshots and animated GIFs** which show you following the described steps and clearly demonstrate the problem. You can use `this tool to record GIFs on macOS and Windows <http://www.cockos.com/licecap/>`_, and `this tool <https://github.com/colinkeenan/silentcast>`_ or `this one <https://github.com/GNOME/byzanz>`_ on Linux.
fil: **Magpasa ng litrato at ng animated GIFs** na pinapakitang sinusundan mo ang mga hakbang na ito upang maresolba ang problema. maaari mong gamitin ang mga 'kawing na ito para ma-itala ang GIFs sa macOS at Windows <http://www.cockos.com/licecap/>`_, `at ito <https://github.com/colinkeenan/silentcast>`_ `pati na rin ito para sa Linux <https://github.com/GNOME/byzanz>`_.

source: **If the problem is related to performance,** please post your machine's specs (host and guest machine).
fil: **Kung ang problema at patungkol sa pagsasagawa,** maaaring paki-paskil lamang ang kumpletong detalye ng inyong makina (pangalan ng may-ari at makina).

source: **If the problem wasn't triggered by a specific action,** describe what you were doing before the problem happened and share more information using the guidelines below.
fil: **Kung ang problema ay kusang lumabas at tila hindi sanhi ng anumang aksyon,** maaari lamang na ikwento ang kuong detalye ng inyong ginagawa bago masira ang makina. Ibahagi ang buong kwento gamit ang mga panuto sa baba.

source: Include details about your configuration and environment:
fil: Isalaysay ang detalye ng iyong pagsasaayos at kapaligiran.

source: **Which version of ODM are you using?** A stable release? a clone of master?
fil: **Anong bersiyon ng ODM ang iyong ginagamit?** Iyo ba ay ang stable release? o ang tinatawag na clone of a master?

source: **What's the name and version of the OS you're using?**
fil: **Ano ang pangalan at bersiyon ng OS ang iyong ginagamit?**

source: **Are you running ODM in a virtual machine or Docker?** If so, which VM software are you using and which operating systems and versions are used for the host and the guest?
fil: **ikaw ba ang gumagamit ng ODM sa pamamagitan ng isang virtual machine o ng isang Docker?** Kung ang sagot ay oo, ano ang VM software at bersiyon ng OS ang iyong ginagamit bilang may-ari o bisita?

source: Template For Submitting Bug Reports
fil: Template para sa pagpapasa ng Bug Reports

source: Pull Requests
fil: Ipakita ang mga Request

source: Include screenshots and animated GIFs in your pull request whenever possible.
fil: Magpasa ng larawan ng animated GIF sa iyong pull request hanggat maaari.

source: Follow the PEP8 Python Style Guide.
fil: Sundan ang PEP8 Python Style Guide.

source: End files with a newline.
fil: Tapusin ang bawat dokumento sa bagong linya.

source: Avoid platform-dependent code:
fil: Iwasan ang platform-dependent code:

source: Use require('fs-plus').getHomeDirectory() to get the home directory.
fil: Gamitin ang ('fs-plus').getHomeDirectory() upang makapunta sa home directory.

source: Use path.join() to concatenate filenames.
fil: Gamitin ang path.join() upang pagsamasamahin anh mga dokumento.

source: Use os.tmpdir() rather than /tmp when you need to reference the temporary directory.
fil: Gamitin ang os.tmpdir() imbis ang /tmp tuwing kailangan ng reperensiya sa pansamantalang direktoryo.

source: Using a plain return when returning explicitly at the end of a function.
fil: Gamitin ang return option pagkatapos ng bawat punsyon.

source: Not return null, return undefined, null, or undefined
fil: Hindi return null, return undefined, null, o undefined

source: `Help edit these docs! <https://github.com/OpenDroneMap/docs/blob/publish/source/contributing.rst>`_
fil: `Tumulong sa pagayos ng mga dokumentong ito! <https://github.com/OpenDroneMap/docs/blob/publish/source/contributing.rst>`_
