Repository: OpenDroneMap/odm-docs
Catalog: source/locale/*/LC_MESSAGES/gcp.po
Languages: ar, fil, sw, te

source: Ground Control Points
ar: نقاط التحكم الأرضية
sw: Pointi za Udhibiti wa chini
te: గ్రౌండ్ కంట్రోల్ పాయింట్లు

source: Ground control points are useful for correcting distortions in the data and referencing the data to know coordinate systems.
ar: نقاط التحكم الأرضية مفيدة لتصحيح التشوهات في البيانات والإشارة إلى البيانات لمعرفة أنظمة الإحداثيات.
fil: Ang mga GCP ay kapaki-pakinabang para sa pagwawasto ng mga pagbaluktot sa datos at pagtukoy sa datos upang malaman ang mga coordinate system.
sw: Ground control points ni muhimu kurekebisha mzunguko wa taarifa na kumbukumbu data ili kujua mfumo wa muunganiko.
te: డేటాలోని వక్రీకరణలను సరిదిద్దడానికి మరియు సమన్వయ వ్యవస్థలను తెలుసుకోవడానికి డేటాను సూచించడానికి గ్రౌండ్ కంట్రోల్ పాయింట్లు ఉపయోగపడతాయి.

source: A Ground Control Point (GCP) is a position measurement made on the ground, typically using a high precision GPS. (Toffanin 2019)
fil: Ang Ground Control Point (GCP) ay isang pagsukat sa posisyon na ginawa sa lupa, karaniwang ginagamitan ng isang mataas na katumpakan na GPS. (Toffanin 2019)
te: గ్రౌండ్ కంట్రోల్ పాయింట్ (జిసిపి) అనేది భూమిపై చేసిన స్థానం కొలత, సాధారణంగా అధిక ఖచ్చితత్వంతో కూడిన జిపిఎస్‌ను ఉపయోగిస్తుంది. (టోఫానిన్ 2019)

source: Ground control points can be set existing structures like pavement corners, lines on a parking lot or contrasting color floor tiles, otherwise can be set using targets placed on the ground.
fil: Ang mga GCP ay maaaring itakda sa mga istraktura tulad ng mga sulok ng simento, mga linya sa isang paradahan o mga tile sa sahig na nagsasalitan ang kulay, kung hindi man ay maitatakda gamit ang mga target na nakalagay sa lupa.
te: గ్రౌండ్ కంట్రోల్ పాయింట్లను పేవ్మెంట్ కార్నర్స్, పార్కింగ్ స్థలంలో లైన్లు లేదా కలర్ ఫ్లోర్ టైల్స్ వంటి ప్రస్తుత నిర్మాణాలను సెట్ చేయవచ్చు, లేకపోతే భూమిపై ఉంచిన లక్ష్యాలను ఉపయోగించి సెట్ చేయవచ్చు.

source: The format of the GCP file is simple.
ar: تنسيق ملف GCP بسيط
fil: Ang format ng GCP file ay simple lamang.
sw: Muundo wa GCP file ni mwepesi.
te: GCP ఫైల్ యొక్క ఆకృతి సులభం.

source: The first line should contain the name of the projection used for the geo coordinates. This can be specified either as a PROJ string (e.g. ``+proj=utm +zone=10 +ellps=WGS84 +datum=WGS84 +units=m +no_defs``), EPSG code (e.g. ``EPSG:4326``) or as a ``WGS84 UTM <zone>[N|S]`` value (eg. ``WGS84 UTM 16N``)
ar: يجب أن يحتوي السطر الأول على اسم الإسقاط المستخدم للإحداثيات الجغرافية. مكن تحديد ذلك إما كسلسلة PROJ (e.g. ``+proj=utm +zone=10 +ellps=WGS84 +datum=WGS84 +units=m +no_defs``), EPSG code (e.g. ``EPSG:4326``) or as a ``WGS84 UTM 1[N|S]`` value (eg. ``WGS84 UTM 16N``)
fil: Ang projection para sa geo coordinates ay dapat na mapunta sa unang linya. Eto ay maaaring matukoy bilang PROJ string (e.g. ``+proj=utm +zone=10 +ellps=WGS84 +datum=WGS84 +units=m +no_defs``), EPSG code (e.g. ``EPSG:4326``) o bilang ``WGS84 UTM 1[N|S]`` value (eg. ``WGS84 UTM 16N``)
sw: Mstari wa mwanzo lazima ubebe jina la muelekeo uliotumika kwa muunganiko wa eneo. Hii inaweza kurahisisha vile vile kama ni PROJ string (e.g ``+proj=utm +zone=10 +ellps=WGS84 +datum=WGS84 +units=m +no_defs``), EPSG code (e.g. ``EPSG:4326``) au kama ``WGS84 UTM <zone>[N|S]`` thamani (mfano. ``WGS84 UTM 16N``)
te: మొదటి పంక్తిలో జియో కోఆర్డినేట్‌లకు ఉపయోగించే ప్రొజెక్షన్ పేరు ఉండాలి. దీనిని PROJ స్ట్రింగ్‌గా పేర్కొనవచ్చు (ఉదా.``+proj=utm +zone=10 +ellps=WGS84 +datum=WGS84 +units=m +no_defs``), ఇపిఎస్‌జి కోడ్ (ఉదా. ``EPSG: 4326``) లేదా ``WGS84 UTM 1 [N | S]`` విలువ (ఉదా. ``WGS84 UTM 16N``)

source: Subsequent lines are the X, Y & Z coordinates, your associated pixels, the image filename and optional extra fields, separated by tabs or spaces:
ar: الخطوط اللاحقة هي إحداثيات X و Y و Z ، وحدات البكسل المرتبطة ، اسم ملف الصورة والحقول الإضافية الاختيارية ، مفصولة بعلامات تبويب أو مسافات:
fil: Ang mga subsequent lines na X, Y & Z coordinates, ang associated pixels, ang image filename at optional extra fields, hiwalay by tabs o space.
sw: Mstari wa mbele ni muungano wa X, Y & Z, muungano elementi picha wa jina la file na njia za taarifa za ziada, zilizotenganishwa na kichupo au nafasi:
te: తదుపరి పంక్తులు X, Y. మీ అనుబంధ పిక్సెల్‌లు, ఇమేజ్ ఫైల్ పేరు మరియు ఐచ్ఛిక అదనపు ఫీల్డ్‌లు, ట్యాబ్‌లు లేదా ఖాళీలతో వేరు చేయబడతాయి:

source: Elevation values can be set to "NaN" to indicate no value
ar: مكن ضبط قيم الارتفاع على "NaN" للإشارة إلى عدم وجود قيمة
fil: Ang elevation values ay mase-set sa "NaN" para ma-indicate na ito ay walang value.
sw: Thamani ya muinuko inaweza kuwekwa "NaN" kuonesha hapana kitu
te: విలువ లేదని సూచించడానికి ఎలివేషన్ విలువలను "NaN" కు సెట్ చేయవచ్చు

source: The 7th column (optional) typically contains the label of the GCP.
ar: يحتوي العمود السابع (اختياري) يحتوي عادة GCP تسمية.
fil: Ang ika-7 na column (optional) ay madalas naglalaman ng label ng GCP.
sw: safu ya 7 (chaguo) kawaida inachukua lebo ya GCP.
te: 7 వ కాలమ్ (ఐచ్ఛికం) సాధారణంగా GCP యొక్క లేబుల్‌ను కలిగి ఉంటుంది.

source: GCP file format::
ar: تنسيق ملف GCP
sw: Muundo wa GCP faili::
te: GCP ఫైల్ ఫార్మాట్ ::

source: Example::
ar: مثال::
fil: Halimbawa::
sw: Mfano::
te: ఉదాహరణ::

source: If you supply a GCP file called ``gcp_list.txt`` then ODM will automatically detect it. If it has another name you can specify using ``--gcp <path>``. If you have a gcp file and want to do georeferencing with exif instead, then you can specify ``--use-exif``. If you have high precision GPS measurements in your images (RTK) and want to use that information along with a gcp file, you can specify ``--force-gps``.
ar: إذا قمت بتوفير ملف GCP يسمى ``gcp_list.txt`` ثم سيكتشف ODM ذلك تلقائيًا. إذا كان له اسم آخر يمكنك تحديده باستخدام ``--gcp <path>``. إذا كان لديك ملف gcp وتريد إجراء مرجع جغرافي باستخدام exif بدلاً من ذلك ، فيمكنك تحديد "--use-exif". إذا كانت لديك قياسات GPS عالية الدقة في صورك (RTK) وتريد استخدام هذه المعلومات مع ملف gcp ، يمكنك تحديد "--force-gps".
fil: Kung ikaw ay nagsupply ng GCP file na tinatawag na ang ODM ay automatic na madedetect ito. Kung ito naman ay may ibang pangalan, maaari mong maspecify ito gamit ang ``--gcp 1``. Kung ikaw ay may gcp file at nais gumawa ng georeferencing sa exif, pwede mong i-specify ang ``--use-exif``. Kung ikaw naman ay may high precision GPS na sukat sa iyong imahe (RTK) at gustong gamiting ang impormasyon na ito kasama ng gcp file, pwede mo itong i-specify bilang ``--force-gps``.
sw: Ikiwa utagawa GCP faili liitwalo ``gcp_list.txt`` kisha ODM wenyewe itafuta hilo. Ikiwa lina jina jengine unaweza kuonesha kutumia ``--gcp <path>``. Ikiwa una gcp faili na unataka kufanya georeferensing pamoja na exif file baada yake, unaweza kukadiria ``--use-exif``. Ikiwa una usahihi mkubwa wa vipimo vya GPS katika (RTK) picha zako na unataka kutumia maelezo hayo pamoja na gcp faili, unaweza kutumia ``--force-gps``.
te: మీరు `` gcp_list.txt`` అనే GCP ఫైల్‌ను సరఫరా చేస్తే, ODM స్వయంచాలకంగా దాన్ని కనుగొంటుంది. దీనికి మరొక పేరు ఉంటే మీరు `` --gcp 1`` ని ఉపయోగించి పేర్కొనవచ్చు. మీకు జిసిపి ఫైల్ ఉంటే మరియు బదులుగా ఎక్సిఫ్ తో జియోరెఫరెన్సింగ్ చేయాలనుకుంటే, మీరు `` --use-exif`` ని పేర్కొనవచ్చు. మీరు మీ చిత్రాలలో (RTK) అధిక ఖచ్చితత్వంతో GPS కొలతలు కలిగి ఉంటే మరియు ఆ సమాచారాన్ని gcp ఫైల్‌తో పాటు ఉపయోగించాలనుకుంటే, మీరు `` --force-gps`` ని పేర్కొనవచ్చు.

source: `This post has some information about placing Ground Control Targets before a flight <http://diydrones.com/profiles/blogs/ground-control-points-gcps-for-aerial-photography>`_, but if you already have images, you can find your own points in the images post facto. It's important that you find high-contrast objects that are found in **at least** 3 photos, and that you find a minimum of 5 objects.
ar: `تحتوي هذه المشاركة على بعض المعلومات حول وضع أهداف التحكم الأرضي قبل الرحلة <http://diydrones.com/profiles/blogs/ground-control-points-gcps-for-aerial-photography>`_, ولكن إذا كان لديك صور بالفعل ، يمكنك العثور على نقاطك الخاصة في الصور بعد الواقع. من المهم أن تجد كائنات عالية التباين موجودة في ** 3 صور على الأقل ** ، وأن تعثر على 5 كائنات على الأقل.
fil: `Ang post na ito ay may impormasyon tungkol sa paglagay ng Ground Control Targets bago ang paglipad <http://diydrones.com/profiles/blogs/ground-control-points-gcps-for-aerial-photography>`_, ngutin kung ikaw ay meroon ng mga imahe, makikita ang mga points sa imahe post facto. Importante na humanap ng high-contrast objects na makikita sa **at least** 3 litrato, at makakakita ng minimum na 5 objoects.
sw: `Posti hii ina baadhi ya maelezo kuhusu kuweka Ground Control Target kabla ya flight <http://diydrones.com/profiles/blogs/ground-control-points-gcps-for-aerial-photography>`_, lakini tayari una picha, unaweza kiutafuta alama yako mwenyewe katika picha ulizonazo, unaweza kutafautisha eneo ambalo linapatikana ndani ya picha 3 **angalau** , na hapo utapata kiasi maeneo matano.
te: `ఈ పోస్ట్‌లో విమానానికి ముందు గ్రౌండ్ కంట్రోల్ టార్గెట్‌లను ఉంచడం గురించి కొంత సమాచారం ఉంది <http://diydrones.com/profiles/blogs/ground-control-points-gcps-for-aerial-photography>` _, కానీ మీకు ఇప్పటికే చిత్రాలు ఉంటే , మీరు మీ స్వంత పాయింట్లను చిత్రాల పోస్ట్ ఫాక్టోలో కనుగొనవచ్చు. ** కనీసం ** 3 ఫోటోలలో కనిపించే అధిక-విరుద్ధ వస్తువులను మీరు కనుగొనడం చాలా ముఖ్యం మరియు మీరు కనీసం 5 వస్తువులను కనుగొంటారు.

source: Sharp corners are good picks for GCPs. You should also place/find the GCPs evenly around your survey area.
ar: تعد الزوايا الحادة اختيارات جيدة لـ GCP. يجب عليك أيضًا وضع / العثور على نقاط المراقبة الحرجة بشكل متساوٍ حول منطقة المسح.
fil: Ang sharp corners ay magandang option para sa GCPs. DApat ilagay/hanapin ang GCPs ng pantay pantay sa paligid ng isu-survey na area.
sw: Pembe zenye ncha kali ni nzuri kuchagua kwa GCP. Pia unaweza kuweka/kutafuta GCP hata katika eneo lako la utafiti.
te: పదునైన మూలలు జిసిపిలకు మంచి ఎంపికలు. మీరు మీ సర్వే ప్రాంతం చుట్టూ సమానంగా GCP లను కూడా ఉంచాలి / కనుగొనాలి.

source: The ``gcp_list.txt`` file must be created in the base of your project folder.
ar: يجب إنشاء ملف `` gcp_list.txt '' في قاعدة مجلد المشروع.
fil: Ang ``gcp_list.txt`` file ay dapat gawin sa base ng project folder.
sw: Faili la ``gcp_list.txt`` lazima litengenezwe wakati ukitengeza folder la project yako.
te: మీ ప్రాజెక్ట్ ఫోల్డర్ యొక్క బేస్ లో `` gcp_list.txt`` ఫైల్ తప్పక సృష్టించబడాలి.

source: For good results your file should have a minimum of 15 lines after the header (5 points with 3 images to each point).
ar: للحصول على نتائج جيدة ، يجب أن يحتوي ملفك على 15 سطرًا على الأقل بعد الرأس (5 نقاط مع 3 صور لكل نقطة).
fil: Para sa mas magandang resulta, ang iyong file ay dapat na magkaroon ng minimum na 15 na linya pagkatapos ng header (5 points na may 3 imahe kada point).
sw: Kwa matokeo mazuri, faili lako liwe na mistari iziozidi 15 baada ya ufunguzi (point 5 pamoja na picha 3 kwa kila point).
te: మంచి ఫలితాల కోసం మీ ఫైల్‌లో హెడర్ తర్వాత కనీసం 15 పంక్తులు ఉండాలి (ప్రతి పాయింట్‌కు 3 చిత్రాలతో 5 పాయింట్లు).

source: User Interfaces
ar: واجهات المستخدم
sw: interface ya mtumiaji
te: వినియోగదారు ఇంటర్‌ఫేస్‌లు

source: You can use one of two user interfaces for creating GCP files:
ar: يمكنك استخدام واحدة من واجهات المستخدم لإنشاء ملفات GCP:
fil: Maaaring gumamit ng isa or dalawang user interfaces para sa paggawa ng GCP files:
sw: Unaweza kutumia moja kati ya interface mbili kutengeneza GCP faili:
te: GCP ఫైళ్ళను సృష్టించడానికి మీరు రెండు యూజర్ ఇంటర్ఫేస్లలో ఒకదాన్ని ఉపయోగించవచ్చు:

source: `GCP Editor Pro <https://github.com/uav4geo/GCPEditorPro>`_
te: `జిసిపి ఎడిటర్ ప్రో <https://github.com/uav4geo/GCPEditorPro>`_

source: The POSM GCPi is loaded by default on WebODM. An example is available at `the WebODM Demo <http://demo.webodm.org/plugins/posm-gcpi/>`_. To use this with known ground control XYZ values, one would do the following:
ar: يتم تحميل POSM GCPi بشكل افتراضي على WebODM. يتوفر مثال في `WebODM Demo <http://demo.webodm.org/plugins/posm-gcpi/>`_. استخدام هذا مع قيم XYZ المعروفة للتحكم الأرضي ، يمكن للمرء القيام بما يلي:
fil: Ang POSM GCPi ay loaded by default sa WebODM. Isang halimbawa dito ay mahahanap sa `the WebODM Demo <http://demo.webodm.org/plugins/posm-gcpi/>`_. Para gamitin ito sa ground control XYZ values, dapat gawin ang mga sumusunod:
sw: POSM GCPi linabebwa na chaguo msingi la WebODM. Mfano unapatikana katika onesho `la WebODM <http://demo.webodm.org/plugins/posm-gcpi/>`_. Kutumia thamani hii ijulikanayo na udhibiti wa ardhi XYZ, Moja itafanya ifuatavyo:
te: POSM GCPi అప్రమేయంగా WebODM లో లోడ్ అవుతుంది. `WebODM డెమో <http://demo.webodm.org/plugins/posm-gcpi/>` _ వద్ద ఒక ఉదాహరణ అందుబాటులో ఉంది. తెలిసిన గ్రౌండ్ కంట్రోల్ XYZ విలువలతో దీన్ని ఉపయోగించడానికి, ఈ క్రింది వాటిని చేస్తారు:

source: Create a GCP list that only includes gcp name (this is the label that will be seen in the GCP interface), x, y, and z, with a header with a proj4 string of your GCPs (make sure they are in a planar coordinate system, such as UTM. It should look something like this:
ar: إنشاء قائمة GCP تتضمن فقط اسم gcp (هذا هو الملصق الذي سيظهر في واجهة GCP) و x و y و z ، مع رأس بسلسلة proj4 من GCP (تأكد من وجودها في إحداثيات مستوية النظام ، مثل UTM. يجب أن يبدو شيء مثل هذا:
fil: Gumawa ng GCP na listahan na may kasamang gcp names (ito ang label na makikita sa GCP interface), x, y, and z, na may header na proj4 string sa GCPs (siguraduhin na may planar coordinate system tulad ng UTM. Ganito ang magiging itsura dapat:
sw: Tengeneza idadi ya GCP ambazo zitakuwa na majina gcp (hii itaandikwa amabyo itaonekana katika kiwasilishi cha GCP),x,y,na z, pamoja na utangulizicha proj4 string ya GCP yako (hakikisha zipo katika mfumo wa ramani, kama UTM. Lazima ionekane ka hivi:
te: మీ జిసిపిల యొక్క ప్రొజె 4 స్ట్రింగ్‌తో హెడర్‌తో జిసిపి పేరు (జిసిపి ఇంటర్‌ఫేస్‌లో కనిపించే లేబుల్ ఇది), x, y మరియు z మాత్రమే ఉండే జిసిపి జాబితాను సృష్టించండి (అవి ప్లానార్ కోఆర్డినేట్‌లో ఉన్నాయని నిర్ధారించుకోండి UTM వంటి వ్యవస్థ. ఇది ఇలా ఉండాలి:

source: Then one can load this GCP list into the interface, load the images, and place each of the GCPs in the image.
ar: ثم يمكن للمرء تحميل قائمة GCP هذه في الواجهة ، وتحميل الصور ، ووضع كل من GCP في الصورة.
fil: Pwedeng i-load ang GCP list sa interface, i-load ang imahe, at ilagay ang mga GPCs sa imahe.
sw: Kisha inaweza pakia idadi ya GCP hii katika kiwasilishwa, pakia picha, na weka kila GCP katika picha.
te: అప్పుడు ఈ జిసిపి జాబితాను ఇంటర్‌ఫేస్‌లోకి లోడ్ చేయవచ్చు, చిత్రాలను లోడ్ చేయవచ్చు మరియు ప్రతి జిసిపిలను చిత్రంలో ఉంచవచ్చు.

source: GCP Editor Pro
te: జిసిపి ఎడిటర్ ప్రో

source: This app needs to be installed separately or can be loaded as a WebODM plugin from `https://github.com/uav4geo/GCPEditorPro <https://github.com/uav4geo/GCPEditorPro>`_
ar: يجب تثبيت هذا التطبيق بشكل منفصل أو يمكن تحميله كبرنامج مساعد WebODM من `https://github.com/uav4geo/GCPEditorPro <https://github.com/uav4geo/GCPEditorPro>`_
fil: Ang aplikasyon na ito ay dapat i-install ng hiwalay o di kaya naman ay pwedeng i-load bilang WebODM plugin mula sa `https://github.com/uav4geo/GCPEditorPro <https://github.com/uav4geo/GCPEditorPro>`_
sw: Aplication nii inahitaji kuingizwa tofauti au inaweza kuingizwa kama WebODM plugin kutoka `https://github.com/uav4geo/GCPEditorPro <https://github.com/uav4geo/GCPEditorPro>`_
te: ఈ అనువర్తనాన్ని విడిగా ఇన్‌స్టాల్ చేయాలి లేదా `https://github.com/uav4geo/GCPEditorPro <https://github.com/uav4geo/GCPEditorPro>`_` నుండి వెబ్‌ఓడిఎం ప్లగిన్‌గా లోడ్ చేయవచ్చు.

source: Create a CSV file that includes the gcp name, northing, easting and elevation.
ar: أنشئ ملف CSV يتضمن اسم gcp والشمال والشرق والارتفاع.
fil: Gumawa ng CSV file na kasama ang GCP name, northing, easting and elevation.
sw: Tengeneza CSV faili litalochukua jina la gcp, kaskazini, kusini na muinuko.
te: Gcp పేరు, నార్తింగ్, ఈస్టింగ్ మరియు ఎలివేషన్ ఉన్న CSV ఫైల్‌ను సృష్టించండి.

source: Then import the CSV from the main screen and type ``+proj=utm +zone=37 +south +ellps=WGS84 +datum=WGS84 +units=m +no_defs`` in the ``EPSG/PROJ`` box.
ar: م قم باستيراد ملف CSV من الشاشة الرئيسية واكتب `+proj=utm +zone=37 +south +ellps=WGS84 +datum=WGS84 +units=m +no_defs`` in the ``EPSG/PROJ`` صندوق.
fil: I-import ang CSV mula sa main screen at i-type ang ``+proj=utm +zone=37 +south +ellps=WGS84 +datum=WGS84 +units=m +no_defs`` mula sa ``EPSG/PROJ`` box.
sw: Kisha ingiza CSV kutoka screen kuu na andika ``+proj=utm +zone=37 +south +ellps=WGS84 +datum=WGS84 +units=m +no_defs`` ndani ya sanduku la ``EPSG/PROJ``.
te: అప్పుడు ప్రధాన స్క్రీన్ నుండి CSV ని దిగుమతి చేసి, ``ʻEPSG / PROJ`` పెట్టెలో` ``+proj=utm +zone=37 +south +ellps=WGS84 +datum=WGS84 +units=m +no_defs`` అని టైప్ చేయండి.

source: The following screen will display a map from where to select the GCPs to tag and import the respective images.
ar: سيتم عرض الشاشة التالية خريطة من أين تختار GCP وضع علامة على الصور ذات الصلة واستيرادها.
fil: Ang susunod na screen ay magdi-display ng map kung saan pipiliin ang GCPs para ma-tag at ma-import ang mga imahe.
sw: Screen zifuatazo zitaonesha ramani kutoka sehemu na kuiita GCP kwa jina na kuita picha nyengine zilipo.
te: కింది స్క్రీన్ సంబంధిత చిత్రాలను ట్యాగ్ చేయడానికి మరియు దిగుమతి చేయడానికి GCP లను ఎన్నుకోవాల్సిన మ్యాప్‌ను ప్రదర్శిస్తుంది.

source: References
te: ప్రస్తావనలు

source: Toffanin, Piero. `Open Drone Map: The Missing Guide. <https://odmbook.com/>`_ MasseranoLabs LLC, 2019.
te: టోఫానిన్, పియరో. `ఓపెన్ డ్రోన్ మ్యాప్: ది మిస్సింగ్ గైడ్. <https://odmbook.com/>`_ మాస్సెరానో లాబ్స్ LLC, 2019.

source: `Help edit these docs! <https://github.com/OpenDroneMap/docs/blob/publish/source/tutorials.rst>`_
ar: `ساعد في تحرير هذه المستندات! <https://github.com/OpenDroneMap/docs/blob/publish/source/tutorials.rst>`_
sw: `kwa msaada kurekebisha kitabu! <https://github.com/OpenDroneMap/docs/blob/publish/source/tutorials.rst>`_
te: `ఈ పత్రాలను సవరించడానికి సహాయం చేయండి <https://github.com/OpenDroneMap/docs/blob/publish/source/tutorials.rst>`_

source: Targets can be purchased or build with an ample variety of materials ranging from bucket lids to floor tiles.
fil: Maaaring mabili o gumawa ang mga target gamit ang samut-saring mga materyales tuland ng mga takip ng timba at ng mga tile sa sahig.

source: Recommended practices for GCP setting
fil: Mga nirerekumendang gawi para sa paglagay ng GCP

source: Keep ground control points visible for all camera locations. Consider the expected ground sampling distance, illumination, vegetation, buildings and all the existing obstacles.
fil: Panatilihing nakikita ang mga GCP para sa lahat ng mga lokasyon ng camera. Isaalang-alang ang inaasahang ng lupa, pag-iilaw, halaman,ground sampling distance, mga gusali at lahat ng mga hadlang.

source: Procure an evenly horizontal distribution of the GCPs within the project, covering high and low elevations. A minimum of 5 GCP works for most of the jobs, and for larger projects 8 – 10 are sufficient. Locate some points near the corners and others in the center, considering that GCP spacing should be larger than the image footprint so that you can’t see more than one GCP in a single image.
fil: Kumuha ng pantay-pantay na distribusyon ng GCPs sa loob ng proyekto, na sinasakupan ang mataas at mababa na elevation. Ang pinakamaliit na value na pwede ay 5 GCP para sa mga karaniwan na trabaho. Para naman sa malalaking proyekto, ang 8-10 ay sapat na. I-locate ang mga points na malapit sa mga kanto at ang iba naman ay sa gitna habang isinasangalang-alang ang GCP na dapat ay mas malalaki kesa sa image footprint para mas makakita ng mahigit sa isang GCP sa isang imahe.

source: In order to ensure each GCP are found in at least 5 images, separate the points 10 to 30 meters from the perimeter of the project. This distance is dependent of the overlapping, so increasing overlapping should reduce the required distance from the perimeter.
fil: Para masiguro na lahat ng GCP ay makikita sa 5 na imahe, ihiwalay ang points 10 to 30 meters mula sa perimeter ng proyekto. Ang distansiya na ito ay dependent sa overlapping, kung kaya ang pagdagdag ng overlapping ay makakabawas sa required na distansiya mula sa perimeter.
