Repository: OpenDroneMap/odm-docs
Catalog: source/locale/*/LC_MESSAGES/geo.po
Languages: fil

source: By default ODM will use the GPS information embedded in the images, if it is available. Sometimes images do not contain GPS information, or a user wishes to override the information with more accurate data (such as RTK).
fil: By default, ginagamit ng ODM ang impormasyon na kasasam sa mga mahe kung ito ay available. Minsan ang mga imahe ay walang kasama na GPS na impormasyon o di kaya naman ay mas pinipili ng gagamit na palitan ang impormasyon ng mas sigurado na data (tulad ng RTK)

source: Starting from ODM ``2.0`` people can supply an image geolocation file (geo) for this purpose.
fil: Simula sa ODM ``2.0`` pwedeng magsupply ng image geolocation file (geo) para sa purpose.

source: The format of the image geolocation file is simple.
fil: Ang format ng image geolocation file ay simple lamang.

source: The first line should contain the name of the projection used for the geo coordinates. This can be specified either as a PROJ string (e.g. ``+proj=utm +zone=10 +ellps=WGS84 +datum=WGS84 +units=m +no_defs``), EPSG code (e.g. ``EPSG:4326``) or as a ``WGS84 UTM <zone>[N|S]`` value (eg. ``WGS84 UTM 16N``)
fil: Ang unang linya ay dapat maglaman ng projection na ginagamit para sa geo coordinates. Ito ay ma-specify bilang PROJ string (e.g. ``+proj=utm +zone=10 +ellps=WGS84 +datum=WGS84 +units=m +no_defs``), EPSG code (e.g. ``EPSG:4326``) o bilang ``WGS84 UTM 1[N|S]`` value (eg. ``WGS84 UTM 16N``)

source: Subsequent lines are the image filename, X, Y & Z (optional) coordinates, the camera angles (optional, currently used only for radiometric calibration) and the horizontal/vertical accuracy (optional):
fil: Ang magkakasunod na linya ay ang imahe na may filename na X, Y & Z (optional) coordinates, anggulo ng camera (optional, kasalukuyan na ginagamit lamang para sa rediometric calibration) at ang patayo or pahalang na accuracy (optional):

source: Camera angles can be set to ``0`` if they are not available.
fil: Ang naggulo ng camera ay pwedeng i-set sa ``0`` kung hindi ito available.

source: The 10th column (optional) can contain extra fields, such as a label.
fil: Ang pang-10 na column (optional) ay maaaring magkaroon ng extra fileds katulad ng label.

source: Example::
fil: Halimbawa::

source: If you supply a file called ``geo.txt`` then ODM will automatically detect it. If it has another name you can specify using ``--geo <path>``.
fil: Kung ikaw ay nagsupply ng imahe na tinatawag na ``geo.txt`` awtomatikong madedetect ito ng ODM. KUng ito ay may ibang pangalan, maaaring specify ito gamit ang ``--geo 1``.

source: The ``geo.txt`` file must be created in the base of your project folder.
fil: Sa base ng project folder dapat gawin ang ``geo.txt``.
