Repository: OpenDroneMap/odm-docs
Catalog: source/locale/*/LC_MESSAGES/installation.po
Languages: ar, es, fr

source: In addition to the three programs above, the dockercompose script is also needed. Sometimes it’s already installed with docker, but sometimes it isn’t. To verify if it’s installed try to type:
ar: بالإضافة إلى البرامج الثلاثة أعلاه ، هناك حاجة أيضًا إلى البرنامج النصي المكون من docker. في بعض الأحيان يتم تثبيته بالفعل مع عامل الميناء ، ولكن في بعض الأحيان لم يتم تثبيته. للتحقق مما إذا كان مثبتًا ، حاول الكتابة:
es: Además de los tres programas anteriores, también se necesita el script de Dockercompose. A veces, ya está instalado con Docker, pero a veces no. Para verificar si está instalado, intente escribir:
fr: En plus des trois programmes ci-dessus, le script dockercompose est également nécessaire. Parfois, il est déjà installé avec le docker, mais parfois il ne l'est pas. Pour vérifier s'il est installé, essayez de taper :

source: You should see somethings similar to the following:
ar: يجب أن تشاهد أشياء مشابهة لما يلي:
es: Debería ver algo similar a lo siguiente:
fr: Vous devriez voir quelque chose de similaire à ce qui suit :

source: If instead you get something similar to the following:
ar: إذا حصلت بدلاً من ذلك على شيء مشابه لما يلي
es: Si, en cambio, obtiene algo similar a lo siguiente:
fr: Si, au contraire, vous obtenez quelque chose de similaire à ce qui suit :

source: you can install it by using pip:
ar: يمكنك تثبيته باستخدام pip:
es: puedes instalarlo usando pip:
fr: vous pouvez l'installer en utilisant pip :

source: Step 3. Download and Launch WebODM
ar: الخطوة 3. قم بتحميل وتشغيل WebODM
es: Paso 3. Descargue y ejecute WebODM
fr: Étape 3. Télécharger et lancer WebODM

source: From a terminal type:
ar: من نوع المحطة الطرفية:
es: Desde la Terminal escriba:
fr: A partir du terminal, taper:

source: Basic Commands and Troubleshooting
ar: الأوامر الأساسية واستكشاف الأخطاء وإصلاحها
es: Comandos básicos y resolución de problemas
fr: Commandes de base et dépannage

source: The cool thing about using docker is that 99% of the tasks you’ll ever need to perform while using WebODM can be done via the ./webodm.sh script. You have already encountered one of them:
ar: الشيء الرائع في استخدام عامل الإرساء هو أن 99٪ من المهام التي ستحتاج إلى تنفيذها أثناء استخدام WebODM يمكن إجراؤها عبر النص البرمجي .webodm.sh/. لقد واجهت بالفعل أحدهم:
es: Lo bueno de usar Docker es que el 99% de las tareas que necesitará realizar mientras usa WebODM se pueden realizar a través del script ./webodm.sh. Ya te has encontrado con uno de ellos:
fr: L'avantage de l'utilisation de docker est que 99% des tâches que vous devrez effectuer en utilisant WebODM peuvent être réalisées via le script ./webodm.sh. Vous avez déjà rencontré l'un d'entre eux :

source: which takes care of starting WebODM and setting up a default processing node (node-odm-1). If you want to stop WebODM, you can already guess what the command is:
ar: الذي يعتني ببدء WebODM وإعداد عقدة معالجة افتراضية (node-odm-1). إذا كنت تريد إيقاف WebODM ، يمكنك بالفعل تخمين ما هو الأمر:
es: que se encarga de iniciar WebODM y configurar un nodo de procesamiento predeterminado (node-odm-1). Si desea detener WebODM, ya puede adivinar cuál es el comando:
fr: qui s'occupe de lancer WebODM et de mettre en place un nœud de traitement par défaut (node-odm-1). Si vous voulez arrêter WebODM, vous pouvez déjà deviner quelle est la commande :

source: There are several other commands you can use, along with different flags. Flags are parameters passed to the ./webodm.sh command and are typically prefixed with “–”. The **port** flag for example instructs WebODM to use a different network port:
ar: هناك العديد من الأوامر الأخرى التي يمكنك استخدامها ، بالإضافة إلى إشارات مختلفة. العلامات هي معلمات يتم تمريرها إلى الأمر. / webodm.sh وعادة ما تكون مسبوقة بـ "-". ترشد علامة **port** على سبيل المثال WebODM إلى استخدام منفذ شبكة مختلف:
es: Hay otros varios comandos que puede usar, junto con diferentes banderas. Los indicadores son parámetros que se pasan al comando ./webodm.sh y suelen tener el prefijo "-". El indicador **port**, por ejemplo, indica a WebODM que utilice un puerto de red diferente:
fr: Il existe plusieurs autres commandes que vous pouvez utiliser, ainsi que différents indicateurs. Les indicateurs sont des paramètres passés à la commande ./webodm.sh et sont généralement préfixés par un "-". L'indicateur **port**, par exemple, indique à WebODM d'utiliser un port réseau différent :

source: Other useful commands are listed below:
ar: يتم سرد أوامر مفيدة أخرى أدناه:
es: A continuación se enumeran otros comandos útiles:
fr: D'autres commandes utiles sont énumérées ci-dessous :

source: `The community forum <https://community.opendronemap.org>`_ is a great place to ask for help if you get stuck during any of the installation steps and for general questions on using the ./webodm.sh script.
ar: <https://community.opendronemap.org>`_ مكان رائع لطلب المساعدة إذا واجهتك مشكلة أثناء أي من خطوات التثبيت وللأسئلة` العامة حول استخدام البرنامج النصي .webodm.sh/.
es: El foro de la comunidad `The community forum <https://community.opendronemap.org>` _ es un gran lugar para pedir ayuda si tiene dificultades durante cualquiera de los pasos de instalación y si tiene preguntas generales sobre el uso del script ./webodm.sh.
fr: `Le forum communautaire <https://community.opendronemap.org>`_ est l'endroit idéal pour demander de l'aide si vous êtes bloqué pendant l'une des étapes de l'installation et pour des questions générales sur l'utilisation du script ./webodm.sh.

source: Hello, WebODM!
ar: مرحبًا WebODM!
es: ¡Hola WebODM!
fr: Salut, WebODM!

source: After running ./webodm.sh start and opening WebODM in the browser, you will be greeted with a welcome message and will be asked to create the first user. Take some time to familiarize yourself with the web interface and explore its various menus.
ar: بعد تشغيل .webodm.sh/ بدء وفتح WebODM في المتصفح ، سيتم الترحيب بك برسالة ترحيب وسيطلب منك إنشاء المستخدم الأول. خصص بعض الوقت للتعرف على واجهة الويب واستكشاف قوائمها المختلفة.
es: Después de ejecutar ./webodm.sh start y abrir WebODM en el navegador, se le dará la bienvenida con un mensaje de bienvenida y se le pedirá que cree el primer usuario. Tómese un tiempo para familiarizarse con la interfaz web y explorar sus diversos menús.
fr: Après avoir lancé ./webodm.sh et ouvert WebODM dans le navigateur, vous serez accueilli par un message de bienvenue et serez invité à créer le premier utilisateur. Prenez un peu de temps pour vous familiariser avec l'interface web et explorer ses différents menus.

source: Notice that under the **Processing Nodes** menu there’s a "node-odm-1" node already configured for you to use. This is a NodeODM node and has been created automatically by WebODM. This node is running on the same machine as WebODM.
ar: لاحظ أنه تحت قائمة **Processing Nodes** ، تم بالفعل تكوين عقدة "node-odm-1" لتتمكن من استخدامها. هذه عقدة NodeODM وتم إنشاؤها تلقائيًا بواسطة WebODM. تعمل هذه العقدة على نفس جهاز WebODM.
es: Tenga en cuenta que en el menú **Processing Nodes** hay un nodo "node-odm-1" ya configurado para su uso. Este es un nodo NodeODM y ha sido creado automáticamente por WebODM. Este nodo se ejecuta en la misma máquina que WebODM.
fr: Notez que dans le menu **Nœuds de traitement**, il y a un nœud "node-odm-1" déjà configuré pour que vous l'utilisiez. Il s'agit d'un nœud NodeODM et il a été créé automatiquement par WebODM. Ce nœud fonctionne sur la même machine que WebODM.

source: If you’ve made it this far, congratulations! Now it’s time to start processing some data.
ar: إذا وصلت إلى هذا الحد ، تهانينا! حان الوقت الآن لبدء معالجة بعض البيانات.
es: Si has llegado hasta aquí, ¡felicitaciones! Ahora es el momento de comenzar a procesar algunos datos.
fr: Si vous êtes arrivé jusqu'ici, félicitations ! Il est maintenant temps de commencer à traiter certaines données.

source: Running on more than one machine
ar: يعمل على أكثر من جهاز
es: Ejecutando en más de una máquina
fr: En cours d'exécution sur plus d'une machine

source: **Optionally:** If you have another computer, you can repeat the installation process (install docker, git, python, etc.) and launch a new NodeODM node by typing from a Terminal/Git Bash window:
ar: **اختياريًا:** إذا كان لديك جهاز كمبيوتر آخر ، يمكنك تكرار عملية التثبيت (تثبيت docker و git و python وما إلى ذلك) وتشغيل عقدة NodeODM جديدة من خلال الكتابة من نافذة Terminal / Git Bash:
es: **Opcionalmente:** Si tiene otra computadora, puede repetir el proceso de instalación (instalar docker, git, python, etc.) y lanzar un nuevo nodo NodeODM escribiendo desde una ventana Terminal / Git Bash:
fr: **Optionnellement:** Si vous avez un autre ordinateur, vous pouvez répéter le processus d'installation (installer docker, git, python, etc.) et lancer un nouveau noeud NodeODM en tapant depuis une fenêtre Terminal/Git Bash:

source: The above command asks docker to launch a new container using the opendronemap/nodeodm image from Docker Hub (the latest version of NodeODM), using port 3000, setting a maximum number of concurrent tasks to 1 and to protect the node from unauthorized access using the password "secret".
ar: يطلب الأمر أعلاه من docker تشغيل حاوية جديدة باستخدام صورة opendronemap / nodeodm من Docker Hub (أحدث إصدار من NodeODM) ، باستخدام المنفذ 3000 ، وتعيين الحد الأقصى لعدد المهام المتزامنة إلى 1 وحماية العقدة من الوصول غير المصرح به باستخدام كلمة السر "سرية".
es: El comando anterior le pide a Docker que lance un nuevo contenedor usando la imagen opendronemap/nodeodm de Docker Hub (la última versión de NodeODM), usando el puerto 3000, estableciendo un número máximo de tareas concurrentes en 1 y para proteger el nodo del acceso no autorizado usando el contraseña "secret".
fr: La commande ci-dessus invite le docker à lancer un nouveau conteneur en utilisant l'image opendronemap/nodeodm du Docker Hub (la dernière version de NodeODM), en utilisant le port 3000, en fixant un nombre maximum de tâches simultanées à 1 et en protégeant le nœud contre tout accès non autorisé à l'aide du mot de passe "secret".

source: From WebODM you can then press the **Add New** button under **Processing Nodes**. For the **hostname/IP** field type the IP of the second computer. For the **port** field type “3000”. For the **token** field type “secret”. You can also add an optional **label** for your node, such as “second computer”. Then press **Save**.
ar: من WebODM يمكنك بعد ذلك الضغط على زر **Add New** تحت **Nodes العقد**. بالنسبة للحقل **hostname / IP** ، اكتب عنوان IP للكمبيوتر الثاني. بالنسبة للحقل **المنفذ** ، اكتب "3000". بالنسبة إلى الحقل **الرمز المميز** ، اكتب "سري". يمكنك أيضًا إضافة **تسمية** اختيارية للعقدة ، مثل "الكمبيوتر الثاني". ثم اضغط **حفظ**.
es: Desde WebODM, puede presionar el botón **Add new** debajo de **Processing Nodes**. En el campo **hostname/IP **, escriba la IP de la segunda computadora. Para el campo **port**, escriba "3000". Para el campo **token**, escriba "secret". También puede agregar una etiqueta **label** opcional para su nodo, como "segunda computadora". Luego presione **Save** para guardar.
fr: À partir de WebODM, vous pouvez ensuite appuyer sur le bouton **Ajouter nouveau** sous **Nœuds de traitement**. Pour le champ **hostname/IP**, tapez l'IP du deuxième ordinateur. Pour le champ **port**, tapez "3000". Pour le champ **token**, tapez "secret". Vous pouvez également ajouter une **étiquette** facultative pour votre nœud, par exemple "second ordinateur". Appuyez ensuite sur **Enregistrer**.

source: If everything went well, you should now have two processing nodes! You will be able to process multiple tasks in parallel using two different machines.
ar: إذا سار كل شيء على ما يرام ، يجب أن يكون لديك الآن عقدتان للمعالجة! ستتمكن من معالجة مهام متعددة بالتوازي باستخدام جهازين مختلفين.
es: Si todo salió bien, ¡ahora debería tener dos nodos de procesamiento! Podrá procesar múltiples tareas en paralelo utilizando dos máquinas diferentes.
fr: Si tout s'est bien passé, vous devriez maintenant avoir deux nœuds de traitement ! Vous pourrez désormais traiter plusieurs tâches en parallèle en utilisant deux machines différentes

source: `Learn to edit <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ and help improve `this page <https://github.com/OpenDroneMap/docs/blob/publish/source/installation.rst>`_!
es: `Aprende a editar <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ y ayuda a mejorar `esta página <https://github.com/OpenDroneMap/docs/blob/publish/source/installation.rst>`_!

source: Move the **Base Memory** slider from the **System** paneland allocate 60-70% of all available memory, optionally adding 50% of the available processors from the **Processor** tab also
ar: انقل المنزلق **الذاكرة الأساسية** من **النظام** paneland تخصص 60-70٪ من الذاكرة المتاحة ، وإضافة اختياريًا 50٪ من المعالجات المتوفرة من علامة التبويب **المعالج** أيضًا
fr: Déplacez le curseur **Mémoire de base** du panneau **Système** et allouez 60-70% de toute la mémoire disponible, en ajoutant éventuellement 50% des processeurs disponibles à partir de l'onglet **Processeur** également

source: *WebODM Dashboard*
ar: *لوحة تحكم WebODM*
fr: *Tableau de bord WebODM*

source: `Help edit these docs! <https://github.com/OpenDroneMap/docs/blob/publish/source/installation.rst>`_
ar: `ساعد في تحرير هذه المستندات! <https://github.com/OpenDroneMap/docs/blob/publish/source/installation.rst>`_
fr: Aidez-nous à éditer ces documents ! <https://github.com/OpenDroneMap/docs/blob/publish/source/installation.rst>`_
