Repository: OpenDroneMap/odm-docs
Catalog: source/locale/*/LC_MESSAGES/installation.po
Languages: ar, es, fr

source: Installation and Getting Started
ar: التثبيت والبدء
es: Instalación y Guía de Introducción
fr: Installation et Préambule

source: This section is excerpted and modified with permission from `OpenDroneMap: The Missing Guide <https://odmbook.com>`_, by Piero Toffanin.
ar: تم اقتباس هذا القسم وتعديله بإذن من `OpenDroneMap: الدليل المفقود <https://odmbook.com>`_, by Piero Toffanin.
es: Esta sección es extraída y modificada con el permiso de `OpenDroneMap: The Missing Guide <https://odmbook.com>`_, realizada por Piero Toffanin.
fr: Cette section est extraite et modifiée avec la permission de `OpenDroneMap: The Missing Guide <https://odmbook.com>`_, par Piero Toffanin.

source: Until recently OpenDroneMap was the term used to refer to a single command line application (what is now known as the ODM project). With the recent development of a web interface, an API and other tools, OpenDroneMap has become an ecosystem of various applications to process, analyze and display aerial data. This ecosystem is made of several components:
ar: حتى وقت قريب كان OpenDroneMap هو المصطلح المستخدم للإشارة إلى تطبيق سطر أوامر واحد (ما يعرف الآن بمشروع ODM). مع التطور الأخير لواجهة الويب وواجهة برمجة التطبيقات والأدوات الأخرى ، أصبحت OpenDroneMap نظامًا إيكولوجيًا من التطبيقات المختلفة لمعالجة البيانات الجوية وتحليلها وعرضها. يتكون هذا النظام البيئي من عدة مكونات:
es: Hasta hace poco OpenDroneMap era el término usado para referirse a una aplicación de comando único (que ahora es conocido como el proyecto ODM). Con el reciente desarrollo de una interfaz web, una API y otras herramientas, OpenDroneMap se ha convertido en un ecosistema de varias aplicaciones para procesar, analizar y mostrar datos aéreos. Este ecosistema es hecho de varios componentes:
fr: Jusqu'à récemment, OpenDroneMap était le terme utilisé pour désigner une application à unique ligne de commande (ce qui est maintenant connu sous le nom de projet ODM). Avec le développement récent d'une interface web, d'une API et d'autres outils, OpenDroneMap est devenu un écosystème de diverses applications pour traiter, analyser et afficher des données aériennes. Cet écosystème est composé de plusieurs éléments :

source: **ODM** is the processing engine, which can be used from the command line. It takes images as input and produces a variety of outputs, including point clouds, 3D models and orthophotos
ar: ** ODM ** هو محرك المعالجة ، والذي يمكن استخدامه من سطر الأوامر. يأخذ الصور كمدخلات وينتج مجموعة متنوعة من المخرجات ، بما في ذلك الغيوم النقطية ، والنماذج ثلاثية الأبعاد والصور التقويمية
es: **ODM** es un motor de procesamiento, que puede ser usado desde la línea de comando. Este toma imágenes como datos de entrada y produce una variedad de datos de salida, incluyendo nubes de puntos, modelos 3D y ortofotografías
fr: **ODM** est le moteur de traitement, qui peut être utilisé à partir de la ligne de commande. Il prend des images en entrée et produit une variété de résultats, y compris des nuages de points, des modèles 3D et des orthophotos

source: **NodeODM** is a light-weight API built on top of ODM. It allows users and applications to access the functions of ODM over a computer network
ar: ** NodeODM ** عبارة عن واجهة برمجة تطبيقات خفيفة الوزن مبنية على أعلى ODM. يسمح للمستخدمين والتطبيقات للوصول إلى وظائف ODM عبر شبكة الكمبيوتر
es: **NodeODM** es una aplicación ligera construida sobre ODM. Esta permite a usuarios y aplicaciones tener acceso a las funciones de ODM en una red de computadores
fr: **NodeODM** est une API légère construite sur l'ODM. Elle permet aux utilisateurs et aux applications d'accéder aux fonctions de l'ODM via un réseau informatique

source: **WebODM** is a friendly user interface that includes a map viewer, a 3D viewer, user logins, a plugin system and many other features that are expected of modern drone mapping platforms
ar: ** WebODM ** عبارة عن واجهة مستخدم سهلة الاستخدام تتضمن عارض خرائط وعارض ثلاثي الأبعاد وتسجيلات دخول المستخدمين ونظامًا إضافيًا والعديد من الميزات الأخرى المتوقعة من منصات رسم الخرائط الحديثة بطائرات بدون طيار
es: **WebODM** es una interfaz fácil de usar que incluye un visualizador de mapas, un visualizador 3D, registros de los usuarios, un sistema de complementos y muchos más elementos que son esperados de las plataformas de cartografía con dron modernas
fr: **WebODM** est une interface utilisateur ergonomique qui comprend un visualiseur de carte, un visualiseur 3D, des identifiants utilisateur, un système de plugins et de nombreuses autres fonctionnalités qui sont attendues des plateformes modernes de cartographie par drones

source: **CloudODM** is a small command line client to communicate with ODM via the NodeODM API
ar: ** CloudODM ** هو عميل سطر أوامر صغير للتواصل مع ODM عبر واجهة برمجة تطبيقات NodeODM
es: **CloudODM** es un pequeño cliente de la línea de comandos para comunicarse con ODM vía la API NodeODM
fr: **CloudODM** est un petit client sur ligne commande pour communiquer avec ODM via l'API NodeODM

source: **PyODM** is a Python SDK for creating tasks via the NodeODM API. We cover it in more detail in the “Automated Processing With Python” chapter
ar: ** PyODM ** هي Python SDK لإنشاء المهام عبر واجهة برمجة تطبيقات NodeODM. نغطيها بمزيد من التفصيل في فصل "المعالجة الآلية باستخدام Python"
es: **PyODM** es un Python SDK para crear tareas vía la API NodeODM. Cubrimos este aspecto en mayor detalle en el capítulo “Procesamiento Automático con Python”
fr: **PyODM** est un SDK Python permettant de créer des tâches via l'API NodeODM. Nous l'abordons plus en détail dans le chapitre "Traitement automatisé avec Python"

source: **ClusterODM** is a load balancer for connecting together multiple NodeODM instances
ar: ** ClusterODM ** هو موازن تحميل لربط أمثلة NodeODM المتعددة معًا
es: **ClusterODM** es un equilibrador de carga para conectar varias instancias de NodeODM
fr: **ClusterODM** est un équilibreur de charge permettant de connecter ensemble plusieurs instances de NodeODM

source: ODM, NodeODM and WebODM are available on all major platforms (Windows, macOS and Linux) via a program called docker, which is required to run the software. Docker offers a way to run “containers”. Containers are packaged copies of an entire system, its software and its dependencies. These containers run within a virtual environment. On Linux this virtual environment is available from the operating system and is very efficient. On macOS and Windows the containers run within a VM, so there’s a bit of a overhead. but it’s still very suitable for running the software. Once installed users do not have to worry much about docker, as it operates (almost) transparently.
ar: تتوفر ODM و NodeODM و WebODM على جميع المنصات الرئيسية (Windows و macOS و Linux) عبر برنامج يسمى docker ، وهو مطلوب لتشغيل البرنامج. تقدم شركة Docker طريقة لتشغيل "الحاويات". الحاويات عبارة عن نُسخ مُعبّأة من نظام برمته وبرامجه وتبعياته. تعمل هذه الحاويات في بيئة افتراضية. تتوفر بيئة افتراضية على Linux من نظام التشغيل وهي فعالة للغاية. في نظامي التشغيل macOS و Windows ، يتم تشغيل الحاويات داخل جهاز ظاهري ، لذلك هناك القليل من النفقات العامة. لكنها لا تزال مناسبة جدًا لتشغيل البرنامج. بمجرد تثبيت المستخدمين ، لا داعي للقلق كثيرًا بشأن عامل الميناء ، لأنه يعمل (تقريبًا) بشفافية.
es: ODM, NodeODM y WebODM están disponibles en todas las plataformas más importantes (Windows, macOS y Linux) vía un programa llamado docker, el cuál es requerido para hacer funcionar el software. Docker ofrece una manera de correr "contenedores". Los contenedores son copias empaquetadas de un sistema completo, su software y sus dependencias. Estos contenedores funcionan dentro de un ambiente virtual. En Linux este ambiente virtual está disponible desde el sistema operativo y es muy eficiente. En macOS y Windows, estos contenedores funcionan dentro de una máquina virtual, así que hay un poco de sobrecarga, sin embargo, es todavía muy adecuado para ejecutar el software. Una vez instalado los usuarios no deben preocuparse mucho acerca del docker, ya que este opera (casi) transparentemente.
fr: ODM, NodeODM et WebODM sont disponibles sur toutes les grandes plateformes (Windows, macOS et Linux) via un programme appelé docker, qui est nécessaire pour faire fonctionner le logiciel. Docker offre un moyen de faire fonctionner des "conteneurs". Les conteneurs sont des copies empaqueté d'un système entier, de ses logiciels et de ses dépendances. Ces conteneurs fonctionnent dans un environnement virtuel. Sous Linux, cet environnement virtuel est disponible à partir du système d'exploitation et est très efficace. Sous MacOS et Windows, les conteneurs s'exécutent dans une VM, ce qui entraîne une certaine surcharge, mais cela reste très adapté à l'exécution du logiciel. Une fois installé, les utilisateurs n'ont plus à se soucier du docker, car il fonctionne (presque) en toute transparence.

source: Without docker it would not be possible to run ODM on Windows or macOS. On these platforms ODM cannot run natively. Future development efforts are being focused on leveraging the new Windows Subsystem for Linux (WSL) and the possibility to make a native port of all dependencies to macOS, which is going to make the installation much easier.
ar: بدون عامل إرساء ، لن يكون من الممكن تشغيل ODM على Windows أو macOS. لا يمكن تشغيل ODM على هذه الأنظمة الأساسية بشكل أصلي. يتم تركيز جهود التطوير المستقبلية على الاستفادة من نظام Windows الفرعي الجديد لنظام Linux (WSL) وإمكانية جعل المنفذ الأصلي لجميع التبعيات إلى macOS ، الأمر الذي سيجعل التثبيت أسهل بكثير.
es: Sin Docker, no sería posible ejecutar ODM en Windows o macOS. En estas plataformas, ODM no se puede ejecutar de forma nativa. Los esfuerzos de desarrollo futuros se están centrando en aprovechar el nuevo Sub sistema de Windows para Linux (WSL) y la posibilidad de hacer un puerto nativo de todas las dependencias para macOS, lo que facilitará mucho la instalación.
fr: Sans Docker, il ne serait pas possible de faire fonctionner ODM sous Windows ou MacOS. Sur ces plates-formes, ODM ne peut pas fonctionner en natif. Les futurs efforts de développement se concentrent sur l'exploitation du nouveau sous-système Windows pour Linux (WSL) et sur la possibilité de faire un portage natif de toutes les dépendances sur macOS, ce qui va rendre l'installation beaucoup plus facile.

source: On Ubuntu Linux 18.04 it’s feasible to run all OpenDroneMap software natively. However, because there’s very little performance penalty for running docker on Linux and docker is straightforward to setup on this platform, we don’t recommend it. On Linux the advantages of containerization far outweigh a tiny performance penalty. With docker users also get easy one-step updates of the software, so that’s nice.
ar: في Ubuntu Linux 18.04 ، من الممكن تشغيل جميع برامج OpenDroneMap أصلاً. ومع ذلك ، نظرًا لوجود القليل جدًا من عقوبة الأداء لتشغيل عامل الميناء على Linux ووصلة عامل الميناء مباشرة على الإعداد على هذا النظام الأساسي ، فإننا لا نوصي بذلك. في لينكس ، تفوق مزايا الحاويات بشكل كبير عقوبة الأداء الصغيرة. مع مستخدمي docker ، يحصلون أيضًا على تحديثات سهلة لخطوة واحدة للبرنامج ، وهذا أمر جيد.
es: En Ubuntu Linux 18.04 es posible ejecutar todo el software OpenDroneMap de forma nativa. Sin embargo, como hay muy poca penalización de rendimiento por ejecutar Docker en Linux y Docker es fácil de configurar en esta plataforma, no lo recomendamos. En Linux, las ventajas de usar contenedores superan con creces la pequeña penalización de rendimiento. Con Docker los usuarios también obtienen fáciles actualizaciones del software, lo que está muy bien.

source: Hardware Recommendations
ar: توصيات الأجهزة
es: Recomendaciones de Hardware
fr: Recommendations en matériel

source: The bare minimum requirements for running the software are:
ar: الحد الأدنى من المتطلبات لتشغيل البرنامج هي:
es: Los requisitos mínimos para ejecutar el software son:
fr: La configuration minimale requise pour exécuter le logiciel est la suivante:

source: 64bit CPU manufactured on or after 2010
ar: تم تصنيع وحدة المعالجة المركزية 64 بت في أو بعد عام 2010
es: CPU de 64bit manufacturada durante o después del 2010
fr: Processeurs 64 bits fabriqués à partir de 2010

source: 20 GB of disk space
ar: 20 غيغابايت من مساحة القرص
es: 20GB de espacio en el disco
fr: espace de 20 Go sur le disque

source: 4 GB RAM
ar: 4 جيجا بايت رام
es: 4GB de RAM
fr: 4 GB de RAM

source: No more than 100-200 images can be processed with the above specifications (the software will run out of memory). Recommended requirements are:
ar: لا يمكن معالجة أكثر من 100-200 صورة بالمواصفات المذكورة أعلاه (ستنفد ذاكرة البرنامج). المتطلبات الموصى بها هي:
es: No más de 100-200 imágenes pueden ser procesadas con las especificaciones descritas arribas (el software se quedaría sin memoria). Los requisitos recomendados son:
fr: Les spécifications ci-dessus ne permettent pas de traiter plus de 100-200 images (le logiciel manquera de mémoire). Les exigences recommandées sont les suivantes :

source: Latest Generation CPU
ar: أحدث جيل من وحدة المعالجة المركزية
es: CPU de última generación
fr: Processeurs de dernière Génération

source: 100 GB of disk space
ar: 100 غيغابايت من مساحة القرص
es: 100GB de espacio en disco
fr: espace de 100 Go sur le disque

source: 16 GB RAM
ar: ذاكرة رام 16 جيجا
es: 16GB de RAM
fr: 16 Go de RAM

source: The above will allow for a few hundred images to be processed without too many issues. A CPU with more cores will allow for faster processing, while a graphics card (GPU) currently has no impact on performance. For processing more images, add more disk space and RAM linearly to the number of images you need to process.
ar: سيسمح ما سبق بمعالجة بضع مئات من الصور دون مشاكل كثيرة. ستسمح وحدة المعالجة المركزية (CPU) المزودة بمزيد من النوى بمعالجة أسرع ، بينما لا تؤثر بطاقة الرسومات (GPU) حاليًا على الأداء. لمعالجة المزيد من الصور ، أضف المزيد من مساحة القرص وذاكرة الوصول العشوائي خطيًا إلى عدد الصور التي تحتاج إلى معالجتها.
es: Las especificaciones de arriba permitirán que unos cuantos cientos de imágenes sean procesados sin muchos problemas. Una CPU con más cores permitirán un procesamiento más rápido, mientras que una tarjeta gráfica (GPU) en el momento no tiene impacto alguno en el desempeño. Para procesar más imágenes, agregue más espacio en el disco y agregue más RAM de manera lineal con respecto al número de imágenes que necesita procesar
fr: Ce qui précède permettra de traiter quelques centaines d'images sans trop de problèmes. Un CPU avec plus de cœurs permettra un traitement plus rapide, tandis qu'une carte graphique (GPU) n'a actuellement aucun impact sur la performance. Pour traiter davantage d'images, ajoutez de l'espace disque et de la RAM de manière linéaire au nombre d'images à traiter.

source: Installation
ar: التركيب
es: Instalación

source: We recommend people use `docker <https://www.docker.com>`_ for running ODM, whether you are on Windows, macOS or Linux.
ar: نوصي باستخدام الناس `docker <https://www.docker.com>`_ أو تشغيل ODM ، سواء كنت تستخدم نظام التشغيل Windows أو macOS أو Linux.
es: Recomendamos utilizar `docker <https://www.docker.com>`_ para ejecutar ODM, ya sea si está utilizando Windows, macOS o Linux.
fr: Nous recommandons aux gens d'utiliser `docker <https://www.docker.com>`_ pour exécuter ODM, que vous soyez sous Windows, macOS ou Linux.

source: To run OpenDroneMap you need at least Windows 7. Previous versions of Windows are not supported.
ar: لتشغيل OpenDroneMap ، تحتاج إلى Windows 7. على الأقل. الإصدارات السابقة من Windows غير مدعومة.
es: Para ejecutar OpenDroneMap necesita al menos Windows 7. Versiones anteriores de Windows no están soportadas.
fr: Pour exécuter OpenDroneMap, vous devez disposer au minimum de Windows 7. Les versions précédentes de Windows ne sont pas supportées.

source: Step 1. Check Virtualization Support
ar: الخطوة 1. تحقق من دعم المحاكاة الافتراضية
es: Paso 1. Verificar el Soporte de Virtualización
fr: Étape 1. Vérifiez si la virtualisation est supportée

source: Docker requires a feature from your CPU called virtualization, which allows it to run virtual machines (VMs). Make sure you have it enabled! Sometimes this is disabled. To check, on Windows 8 or higher you can open the **Task Manager** (press CTRL+SHIFT+ESC) and switch to the **Performance** tab.
ar: يتطلب Docker ميزة من وحدة المعالجة المركزية الخاصة بك تسمى المحاكاة الافتراضية ، والتي تسمح لها بتشغيل الأجهزة الافتراضية (VMs). تأكد من تمكينه! في بعض الأحيان يتم تعطيل هذا. للتحقق ، في Windows 8 أو أعلى ، يمكنك فتح **Task Manager** (اضغط CTRL + SHIFT + ESC) والتبديل إلى علامة التبويب علامة التبويب **الأداء**.
es: Docker requiere una función de la CPU llamada virtualización, la que permite ejecutar máquinas virtuales (VMs). Asegúrese de que la tiene activada! Ya que algunas veces está desactivada. En Windows 8 o versiones más actuales, esto se puede verificar abriendo el **Administrador de Tareas** (presionar CTRL+SHIFT+ESC) y cambiando a la ventana de **Rendimiento**.
fr: Docker nécessite une fonctionnalité de votre CPU appelée virtualisation, qui lui permet d'exécuter des machines virtuelles (VM). Assurez-vous que cette fonction est activée ! Parfois, cette fonction est désactivée. Pour vérifier, sous Windows 8 ou supérieur, vous pouvez ouvrir le **Gestionnaire de tâches** (appuyez sur CTRL+Maj+ESC) et passer à l'onglet **Performance**.

source: *Virtualization should be enabled*
ar: * يجب تمكين المحاكاة الافتراضية *
es: *Virtualización debería estar activada*
fr: *Virtualisation devrait être activé*

source: On Windows 7 to see if you have virtualization enabled you can use the `Microsoft® Hardware-Assisted Virtualization Detection Tool <http:// www.microsoft.com/en-us/download/details.aspx?id=592>`_ instead.
ar: في نظام التشغيل Windows 7 لمعرفة ما إذا تم تمكين المحاكاة الافتراضية ، يمكنك استخدام أداة الكشف عن المحاكاة الافتراضية المدعومة بالأجهزة من Microsoft® <http:// www.microsoft.com/en-us/download/details.aspx?id=592>`_ في حين أن.
es: En Windows 7 para ver si la opción de virtualización está activada, se puede usar la herramienta `Microsoft® Hardware-Assisted Virtualization Detection Tool <http:// www.microsoft.com/en-us/download/details.aspx?id=592>`.
fr: Sous Windows 7, pour savoir si la virtualisation est activée, vous pouvez utiliser l'outil de détection de la virtualisation assistée par le matériel de Microsoft® à la place <http:// www.microsoft.com/en-us/download/details.aspx?id=592>`_.

source: If virtualization is disabled, you’ll need to enable it. The procedure unfortunately is a bit different for each computer model, so the best way to do this is to look up on a search engine “how to enable vtx for <type your computer model here>”. Often times it’s a matter of restarting the computer, immediately pressing F2 or F12 during startup, navigating the boot menu and changing the settings to enable virtualization (often called “VT-X”).
ar: إذا تم تعطيل المحاكاة الافتراضية ، فستحتاج إلى تمكينها. للأسف ، يختلف الإجراء قليلاً بالنسبة لكل طراز كمبيوتر ، لذا فإن أفضل طريقة للقيام بذلك هي البحث في محرك بحث "كيفية تمكين vtx لـ <اكتب طراز الكمبيوتر الخاص بك هنا>". غالبًا ما يكون الأمر يتعلق بإعادة تشغيل الكمبيوتر ، والضغط على الفور على F2 أو F12 أثناء بدء التشغيل ، والتنقل في قائمة التمهيد وتغيير الإعدادات لتمكين التمثيل الافتراضي (غالبًا ما يسمى "VT-X")
es: Si Ia opción de virtualización está desactivada, necesitará activarla. El procedimiento desafortunamente es un poco diferente para cada modelo de computador, así que la mejor manera de hacerlo es averiguando en un motor de búsqueda “cómo activar vtx para <type your computer model here>". Muchas veces es una cuestión de reiniciar el computador, inmediatamente presionando F2 o F12 durante el arranque, navegando por el menú de arranque y cambiando las configuraciones para activar la opción de virtualización (frecuentemente llamada “VT-X”).
fr: Si la virtualisation est désactivée, vous devrez l'activer. La procédure est malheureusement un peu différente pour chaque modèle d'ordinateur, donc la meilleure façon de procéder est de chercher sur un moteur de recherche "comment activer la vtx pour<type your computer model here>". Souvent, il s'agit de redémarrer l'ordinateur, d'appuyer immédiatement sur F2 ou F12 au démarrage, de naviguer dans le menu de démarrage et de modifier les paramètres pour activer la virtualisation (souvent appelée "VT-X").

source: *Common keys to press at computer startup to access the boot menu for various PC vendors*
ar: * مفاتيح مشتركة للضغط عند بدء تشغيل الكمبيوتر للوصول إلى قائمة التمهيد لمختلف بائعي الكمبيوتر *
es: *Teclas comunes para presionar en el momento de arranque del computador, para acceder al menú de arranque para varios vendedores de PCs*
fr: *Touches spéciales à appuyer au démarrage de l'ordinateur pour accéder au menu de démarrage des différents fournisseurs de PC*

source: Step 2. Install Requirements
ar: الخطوة 2. تثبيت المتطلبات
es: Paso 2. Requisitos de instalación
fr: Étape 2. Exigences d'installation

source: First, you’ll need to install:
ar: أولاً ، ستحتاج إلى تثبيت:
es: Primero, deberá instalar:
fr: Tout d'abord, vous devrez installer:

source: Python (latest version 3): https://www.python.org/downloads/windows/
es: Python (la última versión 3): https://www.python.org/downloads/windows/
fr: Python (dernière version 3): https://www.python.org/downloads/windows/

source: For Python 3, make sure you check **Add Python 3.x to PATH** during the installation.
ar: بالنسبة إلى Python 3 ، تأكد من تحديد ** إضافة Python 3.x إلى PATH ** أثناء التثبيت.
es: Para Phyton 3, asegurese de marcar **Agregar Phyton 3 a la ruta** durante la instalación.
fr: Pour Python 3, assurez-vous de vérifier **Add Python 3.x to PATH** lors de l'installation.

source: *Don’t forget to add the Python executable to your PATH (so that you can run commands with it)*
ar: * لا تنس إضافة Python القابل للتنفيذ إلى PATH الخاص بك (بحيث يمكنك تشغيل الأوامر به) *
es: *No olvides agregar el ejecutable de Phyton 3 a la ruta (para que puedas correr los comandos con el)*
fr: *N'oubliez pas d'ajouter l'exécutable Python à votre PATH (pour que vous puissiez exécuter des commandes avec lui)*

source: Then, only if you are on Windows 10 Home, Windows 8 (any version) or Windows 7 (any version), install:
ar: بعد ذلك ، فقط إذا كنت تستخدم Windows 10 Home أو Windows 8 (أي إصدار) أو Windows 7 (أي إصدار) ، قم بتثبيت:
es: Luego, solo si estas en Windows 10 Home, Windows 8 (cualquier versión) o Windows 7 (cualquier versión), instalar:
fr: Si vous êtes sur Windows 10 Home, Windows 8 (n'importe quelle version) ou Windows 7 (n'importe quelle version), installez :

source: Docker Toolbox: https://github.com/docker/toolbox/releases/download/v18.09.3/DockerToolbox-18.09.3.exe
es: Caja de Herramientas Docker: https://github.com/docker/toolbox/releases/download/v18.09.3/DockerToolbox-18.09.3.exe
fr: Outils Docker: https://github.com/docker/toolbox/releases/download/v18.09.3/DockerToolbox-18.09.3.exe

source: If you are on Windows 10 Professional or a newer version, you should install instead:
ar: إذا كنت تستخدم Windows 10 Professional أو إصدارًا أحدث ، فيجب عليك التثبيت بدلاً من ذلك:
es: Si estas en Windows 10 Professional o una versión más reciente, deberias instalar en su lugar:
fr: Par contre si vous êtes sur Windows 10 Professional ou une version plus récente, vous devez installer à la placer :

source: Docker for Windows: https://download.docker.com/win/stable/Docker%20for%20Windows%20Installer.exe
es: Docker para Windows: https://download.docker.com/win/stable/Docker%20for%20Windows%20Installer.exe
fr: Docker pour Windows: https://download.docker.com/win/stable/Docker%20for%20Windows%20Installer.exe
