Repository: OpenDroneMap/odm-docs
Catalog: source/locale/*/LC_MESSAGES/installation.po
Languages: ar, es, fr

source: Please do **NOT** install both docker programs. They are different and will create a mess if they are both installed.
ar: أرجوك** لا** تثبيت كل من برامج عامل الميناء. إنهما مختلفان وسيحدثان فوضى إذا تم تثبيتهما
es: Por favor **NO** instalar ambos programas de Docker. Ellos son diferentes y crearán conflictos si están ambos instalados.
fr: Veuillez **NE PAS** installer les deux programmes dockers. Ils sont différents et créeront un conflit s'ils sont tous les deux installés.

source: After installing docker, launch it from the Desktop icon that is created from the installation (**Docker Quickstart** in the case of Docker Toolbox, **Docker for Windows** for Docker for Windows). This is important, do not skip this step. If there are errors, follow the prompts on screen to fix them.
ar: بعد تثبيت docker ، قم بتشغيله من أيقونة سطح المكتب التي تم إنشاؤها من التثبيت (** Docker Quickstart ** في حالة Docker Toolbox ، ** Docker for Windows ** for Docker for Windows). هذا مهم ، لا تتخطى هذه الخطوة. إذا كانت هناك أخطاء ، فاتبع المطالبات التي تظهر على الشاشة لإصلاحها.
es: Después de instalar Docker, ábrelo desde el ícono en el Escritorio que es creado desde la instalación (**Inicio Rápido de Docker** en el caso de la caja de herramientas Docker, **Docker para Windows** en el caso de Docker para Windows).
fr: Après avoir installé le docker, lancez-le à partir de l'icône du bureau qui est créée à partir de l'installation (**Docker Quickstart** dans le cas de Docker Toolbox, **Docker for Windows** pour Docker for Windows). Ceci est important, ne sautez pas cette étape. S'il y a des erreurs, suivez les invites à l'écran pour les corriger.

source: Step 3. Check Memory and CPU Allocation
ar: الخطوة 3. تحقق من تخصيص الذاكرة ووحدة المعالجة المركزية
es: Paso 3. Revisa la memoria y la asignación del procesador
fr: Étape 3. Vérifier l'allocation de la mémoire et du processeur

source: Docker on Windows works by running a VM in the background (think of a VM as a “computer emulator”). This VM has a certain amount of memory allocated and WebODM can only use as much memory as it’s allocated.
ar: يعمل Docker على Windows عن طريق تشغيل VM في الخلفية (فكر في VM كـ "محاكي كمبيوتر"). يحتوي هذا الجهاز الظاهري على مقدار معين من الذاكرة المخصصة ولا يمكن أن يستخدم WebODM سوى قدر الذاكرة المخصصة.
es: Docker en Windows funciona ejecutando una VM en segundo plano (piensa en una VM como un "emulador de computador"). Esta VM tiene una cierta cantidad de memoria asignada y WebODM sólo puede usar tanta memoria como esté asignada.
fr: Docker sous Windows fonctionne en faisant tourner une Machine virtuelle (VM) en arrière-plan (considérez une VM comme un "émulateur d'ordinateur"). Cette VM dispose d'une certaine quantité de mémoire assignée et WebODM ne peut utiliser que la quantité de mémoire qui lui est allouée.

source: If you installed Docker Toolbox (see below if you installed Docker for Windows instead):
ar: إذا قمت بتثبيت Docker Toolbox (انظر أدناه إذا قمت بتثبيت Docker لنظام Windows بدلاً من ذلك):
es: Si instalaste la Caja de Herramientas Docker (observa abajo si instalaste Docker para Windows):
fr: Si vous avez installé Docker Toolbox (voir ci-dessous si vous avez installé Docker pour Windows à la place) :

source: Open the **VirtualBox Manager** application
ar: افتح تطبيق ** VirtualBox Manager **
es: Abra la aplicación **Administrador de VirtualBox**
fr: Ouvrir l'application **VirtualBox Manager**

source: Right click the **default** VM and press **Close (ACPI Shutdown)** to stop the machine
ar: نقر بزر الماوس الأيمن على ** الافتراضي ** VM واضغط على ** إغلاق (إيقاف تشغيل ACPI) ** لإيقاف الجهاز
es: Haga clic con el botón derecho en la **VM predeterminada** y presione **Cerrar (Apagar ACPI)** para deterner la máquina.
fr: Faites un clic droit sur la VM **par défaut** et appuyez sur **Fermer (ACPI Shutdown)** pour arrêter la machine

source: Right click the **default** VM and press **Settings...**
ar: انقر بزر الماوس الأيمن على ** افتراضي ** VM واضغط على ** الإعدادات ... **
es: Haga clic con el botón derecho en la ** VM predeterminada ** y presione ** Configuración...**
fr: Faites un clic droit sur la VM **par défaut** et appuyez sur **Réglages...**

source: Move the **Base Memory** slider from the **System** panel and allocate 60-70% of all available memory, optionally adding 50% of the available processors from the **Processor** tab also
es: Mueva el control deslizante de **Base Memory** desde el panel **System** y asigne el 60-70% de toda la memoria disponible, agregando opcionalmente el 50% de los procesadores disponibles desde la pestaña **Processor** también

source: *VirtualBox default VM settings*
ar: *إعدادات VirtualBox الافتراضية VM*
es: *Configuración predeterminada de la VM de VirtualBox*
fr: *Paramètres VM par défaut de VirtualBox*

source: Then press **OK**, right click the **default** VM and press **Start**.
ar: ثم اضغط على **OK** ، انقر بزر الماوس الأيمن على **default **VM واضغط على **Start**.
es: Luego presione **OK**, haga clic derecho en la VM **predeterminada** y presione **Iniciar**.
fr: Ensuite, appuyez sur **OK**, faites un clic droit sur la VM par défaut et appuyez sur **Start**.

source: If you installed Docker for Windows instead:
ar: إذا قمت بتثبيت Docker لنظام Windows بدلاً من ذلك:
es: Si instalaste Docker para Windows en su lugar:
fr: Si vous avez installé Docker pour Windows à la place :

source: Look in the system tray and right click the “white whale” icon.
ar: ابحث في علبة النظام وانقر بزر الماوس الأيمن على أيقونة "الحوت الأبيض".
es: Busca el ícono de la "ballena blanca" en la bandeja del sistema.
fr: Regardez dans la barre d'état système et faites un clic droit sur l'icône "baleine blanche".

source: From the menu, press **Settings...**
ar: من القائمة ، اضغط **الإعدادات ...**
es: Desde el menú, presione **Configuraciones...**
fr: A partir du menu, appuyez **Paramètres...**

source: From the panel, click **Advanced** and use the sliders to allocate 60-70% of available memory and use half of all available CPUs.
ar: من اللوحة ، انقر فوق **متقدم** واستخدم أشرطة التمرير لتخصيص 60-70٪ من الذاكرة المتوفرة واستخدام نصف جميع وحدات المعالجة المركزية المتاحة.
es: Desde el panel, haga clic en **Avanzado** y use los controles deslizantes para asignar el 60-70% de la memoria disponible y utilice la mitad de los CPUs disponibles.
fr: Dans le panneau, cliquez sur **Avancé** et glissez les boutons pour allouer 60-70% de toute la mémoire disponible et utiliser la moitié de tous les processeurs disponibles.

source: Press **Apply**.
ar: اضغط **تطبيق**.
es: Clic en **Aplicar**
fr: Appuyez sur **Appliquer**.

source: *Step 1 Docker icon*
ar: * أيقونة الخطوة 1 عامل الميناء *
es: *Paso 1 Ícono de Docker*
fr: *Étape 1 Icône du Docker*

source: *Step 3 & 4 Docker settings*
ar: * الخطوة 3 و 4 إعدادات عامل الميناء *
es: *Paso 3 y 4 Configuración de Docker*
fr: *Étape 3 & 4 Paramètres du Docker*

source: Step 4. Download WebODM
ar: الخطوة 4. قم بتنزيل WebODM
es: Paso 4. Descarga WebODM
fr: Étape 4. Télécharger WebODM

source: Open the **Git Gui** program that comes installed with Git. From there:
ar: افتح برنامج ** Git Gui ** الذي يأتي مثبتًا مع Git. من هناك:
es: Abra el programa **Git GUI** que viene instalado con Git. Desde ahí:
fr: Ouvrez le programme **Git Gui** qui est installé avec Git. A partir de là :

source: When Git Gui opens, click 'Clone Existing Repository' option
ar: عندما يفتح Git Gui ، انقر فوق خيار "Clone Existing Repository"
es: Cuando Git Gui se abra, haga clic en la opción 'Clone Existing Repository'
fr: Lorsque Git Gui s'ouvre, cliquez sur l'option 'Cloner le référentiel existant'

source: In **Source Location** type: https://github.com/OpenDroneMap/WebODM
ar: ي ** موقع المصدر ** ، اكتب: https://github.com/OpenDroneMap/WebODM
es: En **Source Location** teclee: https://github.com/OpenDroneMap/WebODM
fr: Dans **Localisation de la source** entrez: https://github.com/OpenDroneMap/WebODM

source: In **Target Directory** click browse and navigate to a folder of your choosing (create one if necessary)
ar: في ** Target Directory ** انقر فوق تصفح وانتقل إلى مجلد من اختيارك (قم بإنشاء مجلد إذا لزم الأمر)
es: En **Target Directory** haga clic en Browse y navegue a la carpeta que elija (cree una si es necesario)
fr: Dans **Répertoire cible**, cliquez sur "Parcourir" et naviguez jusqu'à un dossier de votre choix (créez-en un si nécessaire)

source: Press **Clone**
ar: اضغط ** استنساخ **
es: Presione **Clone**
fr: Appuyez **Cloner**

source: If the download succeeded, you should now see this window:
ar: إذا نجح التنزيل ، فمن المفترض أن ترى هذه النافذة الآن:
es: Si la descarga se realizó correctamente, ahora debería ver esta ventana:
fr: Si le téléchargement a réussi, vous devriez voir cette fenêtre :

source: *Git Gui after successful download (clone)*
ar: * Git Gui بعد نجاح التنزيل (استنساخ) *
es: *Git Gui después de una descarga exitosa (clone)*
fr: *Git Gui après un téléchargement réussi (clone)*

source: Go to the **Repository** menu, then click **Create Desktop Icon**. This will allow you to come back to this application easily in the future.
ar: انتقل إلى قائمة **Repository** ، ثم انقر فوق **Create Desktop Icon**. هذا سيسمح لك بالعودة إلى هذا التطبيق بسهولة في المستقبل.
es: Vaya al menú **Repository**, luego haga clic en **Create Desktop Icon**. Esto le permitirá volver fácilmente a esta aplicación en el futuro.
fr: Allez dans le menu **Répertoire**, puis cliquez sur **Créer une icône de bureau**. Cela vous permettra de revenir plus facilement à cette application à l'avenir.

source: Step 4. Launch WebODM
ar: الخطوة 4. قم بتشغيل WebODM
es: Paso 4. Inicie WebODM
fr: Étape 4. Lancer WebODM

source: From Git Gui, go to the **Repository** menu, then click **Git Bash**. From the command line terminal type:
ar: من Git Gui ، انتقل إلى قائمة **Repository** ، ثم انقر فوق **Git Bash**. من نوع سطر الأوامر:
es: Desde Git Gui, vaya al menú **Repository**, luego haga clic en **Git Bash**. Desde la terminal de línea de comando teclee:
fr: Depuis l'interface GUI de Git, allez dans le menu **Répertoire**, puis cliquez sur **Git Bash**. Depuis le terminal en ligne de commande, tapez:

source: Several components will download to your machine at this point, including WebODM, NodeODM and ODM. After the download you should be greeted by the following screen:
ar: سيتم تنزيل العديد من المكونات على جهازك في هذه المرحلة ، بما في ذلك WebODM و NodeODM و ODM. بعد التنزيل ، يجب أن تستقبل الشاشة التالية:
es: En este punto, se descargarán varios componentes en su máquina, incluidos WebODM, NodeODM y ODM. Después de la descarga, debería aparecer la siguiente pantalla:
fr: Plusieurs composants seront téléchargés sur votre machine à ce stade, notamment WebODM, NodeODM et ODM. Après le téléchargement, vous devriez être accueilli par l'écran suivant :

source: *Console output after starting WebODM for the first time*
ar: *إخراج وحدة التحكم بعد بدء WebODM لأول مرة*
es: *Salida de consola después de iniciar WebODM por primera vez*
fr: *Résultats de la console après le premier démarrage de WebODM*.

source: If you are using Docker for Windows, open a web browser to http://localhost:8000
ar: إذا كنت تستخدم Docker لنظام التشغيل Windows ، فافتح متصفح الويب على http: // localhost: 8000
es: Si está utilizando Docker para Windows, abra un navegador web en http://localhost:8000
fr: Si vous utilisez Docker pour Windows, ouvrez http://localhost:8000 sur un navigateur web

source: If you are using Docker Toolbox, find the IP address to connect to by typing:
ar: إذا كنت تستخدم Docker Toolbox ، فابحث عن عنوان IP للاتصال به عن طريق كتابة:
es: Si está utilizando Docker Toolbox, busque la dirección IP a la que conectarse escribiendo:
fr: Si vous utilisez Docker Toolbox, trouvez l'adresse IP à laquelle vous connecter en tapant :

source: You should get a result like the following:
ar: يجب أن تحصل على نتيجة مثل ما يلي:
es: Debería obtener un resultado como el siguiente:
fr: Vous devriez obtenir un résultat du type suivant :

source: Then connect to http://192.168.1.100:8000 (replacing the IP address with the proper one).
ar: ثم اتصل بـ http://192.168.1.100:8000 (استبدال عنوان IP بالعنوان المناسب).
es: Luego conéctese a http://192.168.1.100:8000 (reemplazando la dirección IP por la correcta).
fr: Ensuite, connectez-vous à http://192.168.1.100:8000 (en remplaçant l'adresse IP par la bonne).

source: Most modern (post 2010) Mac computers running macOS Sierra 10.12 or higher can run OpenDroneMap using docker, as long as hardware virtualization is supported (see below).
ar: يمكن لمعظم أجهزة الكمبيوتر الحديثة Mac (التي تعمل بعد عام 2010) التي تعمل بنظام macOS Sierra 10.12 أو أعلى تشغيل OpenDroneMap باستخدام عامل الإرساء ، طالما أن دعم الأجهزة الافتراضية (انظر أدناه).
es: La mayoría de las computadoras Mac modernas (posteriores a 2010) que ejecutan macOS Sierra 10.12 o superior pueden ejecutar OpenDroneMap mediante la ventana acoplable, siempre que se admita la virtualización de hardware (ver más abajo).
fr: La plupart des ordinateurs Mac modernes (après 2010) fonctionnant sous MacOS Sierra 10.12 ou supérieur peuvent exécuter OpenDroneMap en utilisant le docker, à condition que la virtualisation matérielle soit prise en charge (voir ci-dessous).

source: Open a Terminal window and type:
ar: افتح نافذة طرفية واكتب:
es: Abre una ventana de Terminal y teclea:
fr: Ouvrez la fenêtre du Terminal et tapez :

source: You will get a response similar to the following:
ar: ستحصل على رد مشابه لما يلي:
es: Obtendrás una respuesta similar a la siguiente:
fr: Vous obtiendrez une réponse semblable à celle qui suit :

source: If the result is *kern.hv_support: 1*, then your Mac is supported! Continue with Step 2.
ar: إذا كانت النتيجة *kern.hv_support: 1* ، فهذا يعني أن جهاز Mac الخاص بك مدعوم! تابع مع الخطوة 2.
es: Si el resultado es *kern.hv_support: 1*, ¡tu Mac es compatible! Continúa con el paso 2.
fr: Si le résultat est *kern.hv_support : 1*, alors votre Mac est supporté ! Procédez à l'étape 2.

source: If the result is *kern.hv_support: 0*, unfortunately it means your Mac is too old to run OpenDroneMap. :(
ar: إذا كانت النتيجة هي *kern.hv_support: 0* ، فهذا يعني للأسف أن جهاز Mac قديم جدًا بحيث لا يمكنه تشغيل OpenDroneMap. :(
es: Si el resultado es *kern.hv_support: 0*, desafortunadamente significa que tu Mac es demasiado vieja para ejecutar OpenDroneMap. :(
fr: Si le résultat est *kern.hv_support : 0*, cela signifie malheureusement que votre Mac est trop vieux pour exécuter OpenDroneMap. :(

source: There are only two programs to install:
ar: يوجد برنامجان فقط للتثبيت:
es: Solo hay dos programas para instalar:
fr: Il n'y a que deux programmes à installer :

source: After installing docker you should find an icon that looks like a whale in the task bar.
ar: بعد تثبيت عامل الميناء ، يجب أن تجد رمزًا يشبه الحوت في شريط المهام.
es: Después de instalar Docker, deberías encontrar un icono que parece una ballena en la barra de tareas.
fr: Après avoir installé le docker, vous devriez trouver une icône qui ressemble à une baleine dans la barre des tâches.

source: *Docker app running*
ar: *تطبيق Docker قيد التشغيل*
es: *Aplicación Docker en ejecución*
fr: *Docker app en cours*

source: You can verify that docker is running properly by opening the **Terminal** app and typing:
ar: يمكنك التحقق من أن عامل الميناء يعمل بشكل صحيح من خلال فتح تطبيق **Terminal** وكتابة:
es: Puedes verificar que la ventana acoplable se esté ejecutando correctamente abriendo la aplicación **Terminal** y escribiendo:
fr: Vous pouvez vérifier que le docker fonctionne correctement en ouvrant l'application **Terminal** et en tapant :

source: Which should return
ar: الذي يجب أن يعود
es: Que debería devolver
fr: Qui devrait renvoyer

source: To verify that git is installed, simply type:
ar: للتحقق من تثبيت git ، اكتب ببساطة:
es: Para verificar que Git está instalado, solo teclee:
fr: Pour vérifier que Git est installé, tapez simplement:

source: Which should return something similar to the following:
ar: والتي يجب أن تُرجع شيئًا مشابهًا لما يلي:
es: Que debería devolver algo similar a lo siguiente:
fr: Ce qui devrait donner quelque chose similaire à ce qui suit :

source: If you get a “bash: git: command not found”, try to restart your **Terminal** app and double-check for any errors during the install process.
ar: إذا حصلت على "bash: git: command not found" ، فحاول إعادة تشغيل تطبيق **Terminal** وتحقق جيدًا من أي أخطاء أثناء عملية التثبيت.
es: Si obtiene un "bash: git: comando no encontrado", intente reiniciar su aplicación **Terminal** y verifique si hay errores durante el proceso de instalación.
fr: Si vous obtenez un "bash : git : command not found", essayez de redémarrer votre application **Terminal** et vérifiez les erreurs éventuelles pendant le processus d'installation.

source: Docker on macOS works by running a VM in the background (think of it as a “computer emulator”). This VM has a certain amount of memory allocated and WebODM can only use as much memory as it’s allocated.
ar: عمل Docker على macOS عن طريق تشغيل VM في الخلفية (فكر في الأمر على أنه "محاكي كمبيوتر"). يحتوي هذا الجهاز الظاهري على مقدار معين من الذاكرة المخصصة ولا يمكن أن يستخدم WebODM سوى قدر الذاكرة المخصصة.
es: Docker en macOS funciona ejecutando una VM en segundo plano (considérelo como un "emulador de computadora"). Esta VM tiene una cierta cantidad de memoria asignada y WebODM solo puede usar la cantidad de memoria asignada.
fr: Docker sur macOS fonctionne en faisant tourner une Machine Virtuelle (VM) en arrière-plan (voyez ça comme un "émulateur d'ordinateur"). Cette VM dispose d'une certaine quantité de mémoire allouée et WebODM ne peut utiliser que la quantité de mémoire qui lui est allouée.

source: Right click the whale icon from the task bar and click **Preferences**...
ar: انقر بزر الماوس الأيمن على رمز الحوت من شريط المهام وانقر على** التفضيلات** ...
es: Haga clic derecho en el icono de la ballena de la barra de tareas y haga clic en **Preferencias** ...
fr: Faites un clic droit sur l'icône de la baleine dans la barre des tâches et cliquez sur **Préférences**...

source: Select the **Advanced** tab
ar: حدد علامة التبويب** متقدم**
es: Seleccione la pestaña **Avanzado**
fr: Sélectionnez l'onglet **Avancé**.

source: Adjust the CPUs slider to use half of all available CPUs and the memory to use 60-70% of all available memory
ar: اضبط شريط تمرير وحدات المعالجة المركزية لاستخدام نصف جميع وحدات المعالجة المركزية المتاحة والذاكرة لاستخدام 60-70٪ من جميع الذاكرة المتاحة
es: Ajuste el control deslizante de las CPU para usar la mitad de todas las CPU disponibles y la memoria para usar el 60-70% de toda la memoria disponible
fr: Ajustez le curseur pour utiliser la moitié de tous les processeurs et 60-70% de toute la mémoire disponible

source: Press **Apply & Restart**
ar: اضغط **التقديم وإعادة التشغيل**
es: Presione **Aplicar y reiniciar**
fr: Appuyez **Appliquer et Redémarrer**

source: *Docker advanced settings*
ar: *إعدادات Docker المتقدمة*
es: *Configuración avanzada de Docker*
fr: *Paramètres avancés du Docker*

source: Step 4. Download and Launch WebODM
ar: الخطوة 4. قم بتحميل وتشغيل WebODM
es: Paso 4. Descargue y ejecute WebODM
fr: Étape 4. Téléchargez et lancez WebODM

source: From a **Terminal** type:
ar: من نوع **Terminal**:
es: Desde la **Terminal** teclee:
fr: A partir du **Terminal** tapez:

source: Then open a web browser to http://localhost:8000.
ar: ثم افتح متصفح الويب على http://localhost:8000.
es: Luego abra un navegador web en http://localhost:8000.
fr: Ouvrez ensuite http://localhost:8000 sur votre Navigateur web

source: OpenDroneMap can run on any Linux distribution that supports docker. According to `docker’s documentation website <https://docs.docker.com/install/>`_ the officially supported distributions are CentOS, Debian, Ubuntu and Fedora, with static binaries available for others. If you have to pick a distribution solely for running OpenDroneMap, Ubuntu is the recommended way to go.
ar: يمكن تشغيل OpenDroneMap على أي توزيع Linux يدعم عامل الإرساء. `وفقًا لموقع وثائق docker على الويب <https://docs.docker.com/install/>`_ التوزيعات المدعومة رسميًا هي CentOS و Debian و Ubuntu و Fedora ، مع ثنائيات ثابتة متاحة للآخرين. إذا كان عليك اختيار توزيع فقط لتشغيل OpenDroneMap ، فإن Ubuntu هو الطريقة الموصى بها للذهاب.
es: OpenDroneMap puede ejecutarse en cualquier distribución de Linux que admita Docker. Según el sitio web de documentación de `docker <https://docs.docker.com/install/>` _ las distribuciones oficialmente soportadas son CentOS, Debian, Ubuntu y Fedora, con binarios estáticos disponibles para otros. Si tiene que elegir una distribución únicamente para ejecutar OpenDroneMap, Ubuntu es la distribución recomendada.
fr: OpenDroneMap peut fonctionner sur toute distribution Linux qui supporte le docker. Selon `le site web de documentation de docker <https://docs.docker.com/install/>`_ les distributions officiellement supportées sont CentOS, Debian, Ubuntu et Fedora, avec des binaires statiques disponibles pour les autres. Si vous devez choisir une distribution uniquement pour exécuter OpenDroneMap, Ubuntu est la solution recommandée.

source: Step 1. Install Requirements
ar: الخطوة 1. تثبيت المتطلبات
es: Paso 1. Requerimientos de instalación
fr: Étape 1. Exigences d'installation

source: There are four programs that need to be installed:
ar: هناك أربعة برامج تحتاج للتثبيت:
es: Hay cuatro programas que deben instalarse:
fr: Il y a quatre programmes qui doivent être installés :

source: Python (2 or 3)
es: Python (2 o 3)
fr: Python (2 ou 3)

source: We cannot possibly cover the installation process for every Linux distribution out there, so we’ll limit the instructions to those that are distributions officially supported by docker. In all cases it’s just a matter of opening a terminal prompt and typing a few commands.
ar: لا يمكننا تغطية عملية التثبيت لكل توزيع Linux هناك ، لذلك سنقصر التعليمات على التوزيعات التي تدعمها شركة docker رسميًا. في جميع الحالات ، يكون الأمر مجرد فتح موجه طرفية وكتابة بعض الأوامر.
es: No podemos cubrir el proceso de instalación de todas las distribuciones de Linux que existen, por lo que limitaremos las instrucciones a aquellas que son distribuciones oficialmente compatibles con Docker. En todos los casos, solo es cuestión de abrir un indicador de terminal y escribir algunos comandos.
fr: Nous ne pouvons pas couvrir le processus d'installation pour toutes les distributions Linux existantes, nous limiterons donc les instructions aux seules distributions officiellement prises en charge par Docker. Dans tous les cas, il suffit d'ouvrir une invite de terminal et de taper quelques commandes.

source: Install on Ubuntu / Debian
ar: التثبيت على Ubuntu / Debian
es: Instalar en Ubuntu / Debian
fr: Installer sur Ubuntu / Debian

source: Commands to type:
ar: أوامر للكتابة:
es: Comandos para escribir:
fr: Commandes à taper:

source: Install on CentOS / RHEL
ar: التثبيت على CentOS / RHEL
es: Instalar en CentOS / RHEL
fr: Installer sur CentOS / RHEL

source: Install on Fedora
ar: التثبيت على Fedora
es: Instalar en Fedora
fr: Installer sur Fedora

source: Install on Arch
ar: التثبيت على Arch
es: Instalar en Arch
fr: Installer sur Arch

source: Step 2. Check Additional Requirements
ar: الخطوة 2. تحقق من المتطلبات الإضافية
es: Paso 2. Verifique los requisitos adicionales
fr: Étape 2. Vérifier les exigences supplémentaires
