Repository: OpenDroneMap/odm-docs
Catalog: source/locale/*/LC_MESSAGES/multispectral.po
Languages: te

source: Multispectral Support
te: మల్టీస్పెక్ట్రల్ సపోర్ట్

source: Since version 0.9.9 ODM has basic support for radiometric normalization, which is able to generate reflectance orthophotos from multispectral cameras. Multispectral cameras capture multiple shots of the scene using different band sensors.
te: వెర్షన్ 0.9.9 నుండి ODM కి రేడియోమెట్రిక్ సాధారణీకరణకు ప్రాథమిక మద్దతు ఉంది, ఇది మల్టీస్పెక్ట్రల్ కెమెరాల నుండి ప్రతిబింబ ఆర్థోఫోటోలను ఉత్పత్తి చేయగలదు. మల్టీస్పెక్ట్రల్ కెమెరాలు విభిన్న బ్యాండ్ సెన్సార్లను ఉపయోగించి సన్నివేశం యొక్క బహుళ షాట్లను సంగ్రహిస్తాయి.

source: Hardware
te: హార్డ్వేర్

source: While we aim to support as many cameras as possible, multispectral support has been developed using the following cameras, so they will work better:
te: మేము వీలైనన్ని కెమెరాలకు మద్దతు ఇవ్వాలని లక్ష్యంగా పెట్టుకున్నాము, కింది కెమెరాలను ఉపయోగించి మల్టీస్పెక్ట్రల్ సపోర్ట్ అభివృద్ధి చేయబడింది, కాబట్టి అవి బాగా పనిచేస్తాయి:

source: `MicaSense RedEdge-MX and Altum <https://www.micasense.com/>`_
te: `మైకాసెన్స్ రెడ్‌ఎడ్జ్ -1010 మరియు ఆల్టస్ <https://www.micasense.com/>` _

source: `Sentera 6X <https://sentera.com/6x/>`_
te: `సెంటెరా 6 ఎక్స్ <https://sentera.com/6x/>` _

source: Other cameras might also work. You can help us expand this list by `sharing datasets <https://community.opendronemap.org/c/datasets/10>`_ captured with other cameras.
te: ఇతర కెమెరాలు కూడా పనిచేయవచ్చు. `డేటాసెట్లను పంచుకోవడం <https://community.opendronemap.org/c/datasets/10>` _ ఇతర కెమెరాలతో సంగ్రహించడం ద్వారా ఈ జాబితాను విస్తరించడానికి మీరు మాకు సహాయపడగలరు.

source: Usage
te: వాడుక

source: Process all the images from all bands at once (do not separate the bands into multiple folders) and pass the `--radiometric-calibration` parameter to enable radiometric normalization. If the images are part of a multi-camera setup, the resulting orthophoto will have N bands, one for each camera (+ alpha).
te: రేడియోమెట్రిక్ సాధారణీకరణను ప్రారంభించడానికి అన్ని చిత్రాల నుండి అన్ని చిత్రాలను ఒకేసారి ప్రాసెస్ చేయండి (బ్యాండ్‌లను బహుళ ఫోల్డర్‌లుగా వేరు చేయవద్దు) మరియు `- రేడియోమెట్రిక్-కాలిబ్రేషన్` పరామితిని పాస్ చేయండి. చిత్రాలు బహుళ-కెమెరా సెటప్‌లో భాగమైతే, ఫలితంగా వచ్చే ఆర్థోఫోటోలో N బ్యాండ్‌లు ఉంటాయి, ప్రతి కెమెరాకు ఒకటి (+ ఆల్ఫా).

source: `Help edit these docs! <https://github.com/OpenDroneMap/docs/blob/publish/source/multispectral.rst>`_
te: `ఈ పత్రాలను సవరించడానికి సహాయం చెయ్యండి! <https://github.com/OpenDroneMap/docs/blob/publish/source/multispectral.rst>`_
