Repository: OpenDroneMap/odm-docs
Catalog: source/locale/*/LC_MESSAGES/outputs.po
Languages: te

source: OpenDroneMap Outputs
te: OpenDroneMap అవుట్‌పుట్‌లు

source: Listed below are some of the useful outputs ODM produces.
te: ODM ఉత్పత్తి చేసే కొన్ని ఉపయోగకరమైన ఉత్పాదనలు క్రింద ఇవ్వబడ్డాయి.

source: Point Cloud
te: పాయింట్ క్లౌడ్

source: ``odm_georeferencing/odm_georeferenced_model.ply/laz/csv`` -- The georeferenced point cloud in different file formats
te: `` odm_georeferencing / odm_georeferenced_model.ply / laz / csv`` - వేర్వేరు ఫైల్ ఫార్మాట్లలో భౌగోళిక సూచించిన పాయింట్ క్లౌడ్

source: *Point cloud over State University Zanzibar, courtesy of* `Khadija Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_
te: * స్టేట్ యూనివర్శిటీ జాంజిబార్ పై పాయింట్ క్లౌడ్, మర్యాద * `ఖాదీజా అబ్దుల్లా అలీ <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>` _

source: 3D Textured Model
te: 3D ఆకృతి మోడల్

source: ``odm_texturing/odm_textured_model.obj`` -- The textured surface mesh ``odm_texturing/odm_textured_model_geo.obj`` -- The georeferenced and textured surface mesh
te: `` odm_texturing / odm_textured_model.obj`` - ఆకృతి చేసిన ఉపరితల మెష్ `` odm_texturing / odm_textured_model_geo.obj`` - భౌగోళిక మరియు ఉపరితల ఉపరితల మెష్

source: You can access the point cloud and textured meshes using MeshLab. Open MeshLab, and choose File:Import Mesh and choose your textured mesh from a location similar to the following: ``odm_texturing\odm_textured_model.obj``
te: మీరు మెష్ లాబ్ ఉపయోగించి పాయింట్ క్లౌడ్ మరియు ఆకృతి మెష్లను యాక్సెస్ చేయవచ్చు. మెష్‌ల్యాబ్‌ను తెరిచి, ఫైల్‌ను ఎంచుకోండి: మెష్‌ను దిగుమతి చేయండి మరియు కింది వాటికి సమానమైన స్థానం నుండి మీ ఆకృతి మెష్‌ను ఎంచుకోండి: `` odm_texturing \ odm_textured_model.obj``

source: *Textured mesh courtesy of* `OpenDroneMap <https://twitter.com/opendronemap>`_
te: * టెక్స్‌చర్డ్ మెష్ మర్యాద * `ఓపెన్‌డ్రోన్‌మ్యాప్ <https://twitter.com/opendronemap>` _

source: Orthophoto
te: ఆర్థోఫోటో

source: ``odm_orthophoto/odm_orthphoto.png`` -- The orthophoto, but this is a simple png, which doesn't have any georeferencing information
te: `` odm_orthophoto / odm_orthphoto.png`` - ఆర్థోఫోటో, కానీ ఇది సరళమైన png, దీనికి భౌగోళిక సమాచారం లేదు

source: ``odm_orthophoto/odm_orthphoto.tif`` -- GeoTIFF Orthophoto. You can use it in QGIS as a raster layer.
te: `` odm_orthophoto / odm_orthphoto.tif`` - GeoTIFF ఆర్థోఫోటో. మీరు దీన్ని QGIS లో రాస్టర్ లేయర్‌గా ఉపయోగించవచ్చు.

source: *Orthophoto over State University Zanzibar, courtesy of* `Khadija Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_
te: * స్టేట్ యూనివర్శిటీ జాంజిబార్‌పై ఆర్థోఫోటో, సౌజన్యంతో * `ఖాదీజా అబ్దుల్లా అలీ <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>` _

source: DTM/DSM will only be created if the ``--dtm`` or ``--dsm`` options are used. See `tutorial on elevation models <https://docs.opendronemap.org/tutorials.html#creating-digital-elevation-models>`_ for more options in creating.
te: `` --Dtm`` లేదా `` --dsm`` ఎంపికలు ఉపయోగించినట్లయితే మాత్రమే DTM / DSM సృష్టించబడుతుంది. సృష్టించే మరిన్ని ఎంపికల కోసం ఎలివేషన్ మోడళ్లపై <ట్యుటోరియల్ <https://docs.opendronemap.org/tutorials.html#creating-digital-elevation-models>`_ చూడండి.

source: Data will be stored in:
te: డేటా వీటిలో నిల్వ చేయబడుతుంది:

source: *Digital surface model over State University Zanzibar, courtesy of* `Khadija Abdullah Ali <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>`_
te: * స్టేట్ యూనివర్శిటీ జాంజిబార్‌పై డిజిటల్ ఉపరితల నమూనా, * `ఖాదీజా అబ్దుల్లా అలీ <https://www.linkedin.com/in/khadija-abdulla-ali-56b4044a/>` _

source: List of all outputs
te: అన్ని ఉత్పాదనల జాబితా

source: `Help edit these docs! <https://github.com/OpenDroneMap/docs/blob/publish/source/outputs.rst>`_
te: `ఈ పత్రాలను సవరించడానికి సహాయం చెయ్యండి! <https://github.com/OpenDroneMap/docs/blob/publish/source/outputs.rst>`_
