Repository: OpenDroneMap/odm-docs
Catalog: source/locale/*/LC_MESSAGES/requesting-features.po
Languages: te

source: How To Request Features
te: ఫీచర్లను ఎలా అభ్యర్థించాలి

source: All software needs user feedback and feature requests, to grow and maintain alignment with the needs of its users.
te: అన్ని సాఫ్ట్‌వేర్‌లకు దాని వినియోగదారుల అవసరాలకు అనుగుణంగా అమరిక పెరగడానికి మరియు నిర్వహించడానికి వినియోగదారు అభిప్రాయం మరియు ఫీచర్ అభ్యర్థనలు అవసరం.

source: OpenDroneMap is FOSS software. Free and open source (FOSS) projects are interesting from the inside and outside: from the outside, successful ones feel like they should be able to do anything, and it’s hard to know what a reasonable request is. From the inside of a project, they can feel very resource constrained: largely by time, money, and opportunity overload.
te: OpenDroneMap అనేది FOSS సాఫ్ట్‌వేర్. ఉచిత మరియు ఓపెన్ సోర్స్ (FOSS) ప్రాజెక్టులు లోపలి మరియు వెలుపల నుండి ఆసక్తికరంగా ఉంటాయి: బయటి నుండి, విజయవంతమైన వారు ఏదైనా చేయగలరని భావిస్తారు మరియు సహేతుకమైన అభ్యర్థన ఏమిటో తెలుసుకోవడం కష్టం. ప్రాజెక్ట్ లోపలి నుండి, వారు చాలా వనరులను నిర్బంధించినట్లు భావిస్తారు: ఎక్కువగా సమయం, డబ్బు మరియు అవకాశాల ఓవర్లోడ్ ద్వారా.

source: A feature request can be submitted as issues on the applicable Github repository (e.g., `WebODM <https://github.com/OpenDroneMap/WebODM/issues>`_ or `ODM <https://github.com/OpenDroneMap/ODM/issues>`_ or similar) or more simply as a discussion topic on `the community forum <https://community.opendronemap.org/>`_. Try to start by searching these sources to see if someone else has already brought it up. Sometimes a feature is already in the works, or has at least been discussed.
te: ఫీచర్ అభ్యర్థన వర్తించే గితుబ్ రిపోజిటరీలో సమస్యలుగా సమర్పించవచ్చు (ఉదా., `WebODM <https://github.com/OpenDroneMap/WebODM/issues>` _ లేదా `ODM <https://github.com/OpenDroneMap/ODM/issues>`_ లేదా ఇలాంటివి) లేదా మరింత సరళంగా` కమ్యూనిటీ ఫోరమ్ <https://community.opendronemap.org/>`_ లో చర్చా అంశంగా. ఈ మూలాలను శోధించడం ద్వారా ప్రారంభించడానికి ప్రయత్నించండి, మరొకరు దీన్ని ఇప్పటికే తీసుకువచ్చారా అని చూడటానికి. కొన్నిసార్లు ఒక లక్షణం ఇప్పటికే పనిలో ఉంది లేదా కనీసం చర్చించబడింది.

source: And importantly, the trick is to listen: if someone within the project says: "This is a big lift, we need MONEY or TIME or SOMEONE TO HELP CODE IT" (or possibly a combination of the three) then there are two answers that work really well in response:
te: మరియు ముఖ్యంగా, ట్రిక్ వినడం: ప్రాజెక్ట్‌లోని ఎవరైనా ఇలా చెబితే: "ఇది పెద్ద లిఫ్ట్, మాకు డబ్బు లేదా సమయం కావాలి లేదా కోడ్ కోట్ చేయడానికి ఎవరైనా కావాలి" (లేదా బహుశా ఈ మూడింటి కలయిక) అప్పుడు రెండు సమాధానాలు ఉన్నాయి ప్రతిస్పందనగా బాగా పని చేయండి:

source: *Ok. I didn’t know it was a big feature request! I hope someone comes along with the necessary resources. As a community member, I would be happy to be an early user and tester!*
te: *అలాగే. ఇది పెద్ద ఫీచర్ అభ్యర్థన అని నాకు తెలియదు! అవసరమైన వనరులతో పాటు ఎవరైనా వస్తారని నేను ఆశిస్తున్నాను. సంఘం సభ్యునిగా, ప్రారంభ వినియోగదారు మరియు పరీక్షకుడిగా నేను సంతోషంగా ఉన్నాను!*

source: or
te: లేదా

source: *Let’s figure out if we can put together the resources to get this done! Here’s what I can contribute toward it: …*
te: * దీన్ని పూర్తి చేయడానికి వనరులను సమకూర్చగలమా అని తెలుసుకుందాం! నేను దీనికి దోహదపడేది ఇక్కడ ఉంది:… *

source: We are glad you are excited to see new features added to the project. Some new features need support, and some are easier to implement. We'll do our best to help you understand where your request falls, and we appreciate any support you can provide.
te: ప్రాజెక్ట్కు కొత్త ఫీచర్లు జోడించబడటం చూసి మీరు సంతోషిస్తున్నాము. కొన్ని క్రొత్త లక్షణాలకు మద్దతు అవసరం, మరికొన్ని అమలు చేయడం సులభం. మీ అభ్యర్థన ఎక్కడ పడిపోతుందో అర్థం చేసుకోవడానికి మేము మా వంతు కృషి చేస్తాము మరియు మీరు అందించగల మద్దతును మేము అభినందిస్తున్నాము.

source: `Help edit these docs! <https://github.com/OpenDroneMap/docs/blob/publish/source/requesting-features.rst>`_
te: `ఈ పత్రాలను సవరించడానికి సహాయం చెయ్యండి! <https://github.com/OpenDroneMap/docs/blob/publish/source/requesting-features.rst>`_
