Repository: OpenDroneMap/odm-docs
Catalog: source/locale/*/LC_MESSAGES/resources.po
Languages: es

source: Additional References
es: Referencias adicionales

source: For Users
es: Para usuarios

source: The following resources are a good place to start:
es: Los siguientes recursos son un buen lugar para comenzar:

source: `README page for ODM <https://github.com/OpenDroneMap/OpenDroneMap>`_
es: `página LEEME para ODM <https://github.com/OpenDroneMap/OpenDroneMap>`_

source: `README page for WebODM <https://github.com/OpenDroneMap/WebODM>`_
es: `página LEEME para WebODM <https://github.com/OpenDroneMap/WebODM>`_

source: `README page for NodeODM <https://github.com/OpenDroneMap/node-OpenDroneMap>`_
es: `página LEEME para NodeODM <https://github.com/OpenDroneMap/node-OpenDroneMap>`_

source: `Ground Control Points Format Specification <https://github.com/mapillary/OpenSfM/blob/master/doc/source/gcp.rst>`_
es: `Especificación del formato para Puntos de Control Terrestre <https://github.com/mapillary/OpenSfM/blob/master/doc/source/gcp.rst>`_

source: For Developers
es: Para desarrolladores

source: In addition to user resources, we recommend to also read the following:
es: Además de los recursos del usuario, recomendamos leer también lo siguiente:

source: WebODM documentation: https://docs.webodm.org
es: Documentación de WebODM: https://docs.webodm.org

source: NodeODM API specification: https://github.com/OpenDroneMap/NodeODM/blob/master/docs/index.adoc
es: Especificación API de NodeODM: https://github.com/OpenDroneMap/NodeODM/blob/master/docs/index.adoc

source: Overview of the ODM pipeline: http://community.opendronemap.org/t/where-can-i-find-background-information-on-the-concepts-of-odm/665/2
es: Descripción general de la canalización ODM: http://community.opendronemap.org/t/where-can-i-find-background-information-on-the-concepts-of-odm/665/2

source: We keep a `section in our forum dedicated to research papers <http://community.opendronemap.org/c/ideas-proposals/research-papers>`_. This is a valuable place where to read more about state of the art research related to structure from motion, multi-view stereo, meshing, texturing, etc. which can be used to improve the software.
es: Mantenemos una sección `en nuestro foro dedicada a artículos de investigación <http://community.opendronemap.org/c/ideas-proposals/research-papers>`_. Este es un lugar valioso donde leer más sobre la investigación de vanguardia relacionada con la estructura del movimiento, estéreo de múltiples vistas, mallado, texturizado, etc. que se puede utilizar para mejorar el software.

source: `Learn to edit <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ and help improve `this page <https://github.com/OpenDroneMap/docs/blob/publish/source/resources.rst>`_!
es: `Aprende a editar <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ y ayuda a mejorar `esta página <https://github.com/OpenDroneMap/docs/blob/publish/source/resources.rst>`_!
