Repository: OpenDroneMap/odm-docs
Catalog: source/locale/*/LC_MESSAGES/tutorials.po
Languages: ar, es

source: Docker has a lamentable use of space and by default does not clean up excess data and machines when processes are complete. This can be advantageous if we need to access a process that has since terminated, but carries the burden of using increasing amounts of storage over time. Maciej Łebkowski has an `excellent overview of how to manage excess disk usage in docker <https://lebkowski.name/docker-volumes/>`_.
ar: تمتع Docker باستخدام مؤسف للمساحة ولا يقوم افتراضيًا بتنظيف البيانات والآلات الزائدة عند اكتمال العمليات. يمكن أن يكون ذلك مفيدًا إذا احتجنا إلى الوصول إلى عملية تم إنهاؤها منذ ذلك الحين ، ولكنها تحمل عبء استخدام كميات متزايدة من التخزين بمرور الوقت. يقدم Maciej Łebkowski `نظرة عامة ممتازة على كيفية إدارة الاستخدام الزائد للقرص في عامل الميناء <https://lebkowski.name/docker-volumes/>` _.
es: Docker tiene un uso lamentable del espacio y, de forma predeterminada, no limpia el exceso de datos y máquinas cuando los procesos están completos. Esto puede ser ventajoso si necesitamos acceder a un proceso que ya ha terminado, pero que lleva la carga de usar cantidades crecientes de almacenamiento a lo largo del tiempo. Maciej Łebkowski tiene una ʻexcelente descripción general de cómo administrar el uso excesivo del disco en la ventana acoplable <https://lebkowski.name/docker-volumes/>`_.

source: Using ODM from low-bandwidth location
ar: استخدام ODM من موقع النطاق الترددي المنخفض
es: Usando ODM desde una ubicación de ancho de banda bajo

source: What is this and who is it for?
ar: ما هذا ومن هو؟
es: ¿Qué es esto y para quién es?

source: Via `Ivan Gayton's repo <https://github.com/ivangayton/GDAL_scripts/>`_.
ar: عبر `Ivan Gayton's repo <https://github.com/ivangayton/GDAL_scripts/>`_
es: A través del repositorio de ʻIvan Gayton <https://github.com/ivangayton/GDAL_scripts/>`_.

source: `OpenDroneMap <https://www.opendronemap.org/>`__ can’t always be effectively set up locally—it takes a fairly powerful machine to process large datasets—so a cloud machine can sometimes be the answer for people in the field. However, bandwidth is a problem in many low-income settings. This constraint can’t be solved completely, but the following method does a reasonable job of reducing the bandwidth needed to process drone imagery datasets on the cloud from African locations.
ar: <https://www.opendronemap.org/>" __ لا يمكن دائمًا إعدادها بشكل فعال محليًا - يتطلب الأمر جهازًا قويًا إلى حد ما لمعالجة مجموعات البيانات الكبيرة - لذا يمكن أن تكون الآلة السحابية أحيانًا هي الحل للأشخاص في حقل. ومع ذلك ، فإن عرض النطاق الترددي يمثل مشكلة في العديد من الإعدادات منخفضة الدخل. لا يمكن حل هذا القيد تمامًا ، ولكن الطريقة التالية تؤدي مهمة معقولة لتقليل النطاق الترددي اللازم لمعالجة مجموعات بيانات صور الطائرات بدون طيار على السحابة من المواقع الأفريقية.
es: ʻOpenDroneMap <https://www.opendronemap.org/>`__ no siempre se puede configurar localmente de forma efectiva; se necesita una máquina bastante poderosa para procesar conjuntos de datos grandes, por lo que una máquina en la nube a veces puede ser la respuesta para las personas en el campo. Sin embargo, el ancho de banda es un problema en muchos entornos de bajos ingresos. Esta restricción no se puede resolver por completo, pero el siguiente método hace un trabajo razonable al reducir el ancho de banda necesario para procesar conjuntos de datos de imágenes de drones en la nube desde ubicaciones africanas.

source: Here we present a tricky but workable process to create an OpenDroneMap cloud machine (*not* CloudODM, mind you, just a cloud-based instance of ODM that you run from the command line) and use it to remotely process large photo sets. It requires familiarity with Unix command line use, ssh, a Digital Ocean account (Amazon AWS would work as well, possibly with slight differences in the setup), and a moderate level of general computer literacy. If you aren’t fairly computer-savvy and willing to fuss with a slightly tricky setup, `CloudODM <https://www.opendronemap.org/cloudodm/>`__ is what you should be looking at.
ar: نقدم هنا عملية صعبة ولكنها عملية لإنشاء جهاز سحابة OpenDroneMap (* لا * CloudODM ، ضع في اعتبارك أنه مجرد نسخة مستندة إلى السحابة من ODM تقوم بتشغيلها من سطر الأوامر) واستخدامها لمعالجة مجموعات الصور الكبيرة عن بُعد. إنه يتطلب معرفة باستخدام سطر أوامر Unix و ssh وحساب Digital Ocean (قد يعمل Amazon AWS أيضًا ، ربما مع اختلافات طفيفة في الإعداد) ، ومستوى معتدل من معرفة الكمبيوتر العامة. إذا لم تكن على دراية بالكمبيوتر إلى حد ما وترغب في إثارة ضجة مع إعداد صعب قليلاً ، فإن "CloudODM <https://www.opendronemap.org/cloudodm/>" __ هو ما يجب أن تنظر إليه.
es: Aquí presentamos un proceso complicado pero factible para crear una máquina en la nube OpenDroneMap (* no * CloudODM, eso sí, solo una instancia de ODM basada en la nube que se ejecuta desde la línea de comandos) y usarla para procesar de forma remota conjuntos de fotos grandes. Requiere familiaridad con el uso de la línea de comandos de Unix, ssh, una cuenta de Digital Ocean (Amazon AWS también funcionaría, posiblemente con ligeras diferencias en la configuración) y un nivel moderado de conocimientos informáticos generales. Si no es un experto en informática y está dispuesto a preocuparse por una configuración un poco complicada, `CloudODM <https://www.opendronemap.org/cloudodm/>`__ is what you should be looking at.

source: The whole process is mostly targeted at someone flying substantial missions in an African or similar location looking to process data ASAP while still in a field setting. Therefore it emphasizes a workflow intended to reduce bandwidth/data transfer, rather than just the simplest way of running ODM.
ar: تستهدف العملية برمتها في الغالب شخصًا يقوم بمهام كبيرة في موقع أفريقي أو موقع مماثل يتطلع إلى معالجة البيانات في أسرع وقت ممكن بينما لا يزال في بيئة ميدانية. ولذلك ، فإنه يؤكد على سير العمل الذي يهدف إلى تقليل نقل البيانات / النطاق الترددي ، بدلاً من أبسط طريقة لتشغيل ODM.
es: Todo el proceso está dirigido principalmente a alguien que vuela misiones sustanciales en África o un lugar similar, y que busca procesar datos lo antes posible mientras aún se encuentra en un entorno de campo. Por lo tanto, enfatiza un flujo de trabajo destinado a reducir el ancho de banda/transferencia de datos, en lugar de solo la forma más simple de ejecutar ODM.

source: Steps
ar: خطوات
es: Pasos

source: Install
ar: تثبيت
es: Instalación

source: Create a Digital Ocean droplet with at least 4GB of RAM. That’ll cost about $20/month. Less than 4GB of RAM and the install will probably fail. When we actually run the ODM process we’ll resize it to a much larger—and more expensive—cloud machine, but between runs you can downsize it between runs to the second-cheapest droplet which costs only $10/month (the cheapest droplet, at $5/month, comes with such a small drive that you can’t downsize back to it).
ar: قم بإنشاء قطرة محيط رقمية مع ذاكرة وصول عشوائي بسعة 4 جيجابايت على الأقل. سيكلفك ذلك حوالي 20 دولارًا / شهريًا. من المحتمل أن يفشل التثبيت أقل من 4 غيغابايت من ذاكرة الوصول العشوائي. عندما نقوم بتشغيل عملية ODM فعليًا ، سنقوم بتغيير حجمها إلى جهاز سحابي أكبر بكثير وأكثر تكلفة ، ولكن بين الجري يمكنك تقليصها بين الجري إلى ثاني أرخص قطيرة والتي تكلف 10 دولارات فقط في الشهر (أرخص قطرة ، بسعر 5 دولارات شهريًا ، ويأتي مع محرك أقراص صغير لا يمكنك تقليصه).
es: Cree una Droplet de Digital Ocean con al menos 4 GB de RAM. Eso costará alrededor de $ 20 USD al mes. Menos de 4 GB de RAM y la instalación probablemente fallará. Cuando realmente ejecutemos el proceso ODM, lo redimensionaremos a una máquina en la nube mucho más grande y más cara, pero entre ejecuciones puede reducirlo al segundo Droplet más barato que cuesta solo $10 USD (el Droplet mas barato a $5 USD por mes, viene con una unidad tan pequeña que no puede volver a reducirla).

source: Should be an Ubuntu 18.04 instance to ensure dependency compatibility
ar: يجب أن يكون نسخة Ubuntu 18.04 لضمان توافق التبعية
es: Debe ser una instancia de Ubuntu 18.04 para asegurar la compatibilidad de las dependencias.

source: Create a user with sudo privileges. `Digital Ocean’s insanely good documentation <https://www.digitalocean.com/community/tutorials/initial-server-setup-with-ubuntu-18-04>`__ can help you figure this out. In our case we set up a user called ``odm``, so connecting to it is via the command ``ssh odm@xxx.xxx.xxx.xxx`` (where the x’s stand for the IPv4 address of your server). If you want to follow this example closely, *do* use the username ``odm``; then your install path will be ``/home/odm/ODM/`` and will match all of the examples in this document.
es: Cree un usuario con privilegios de sudo. `La documentación increíblemente buena de Digital Ocean <https://www.digitalocean.com/community/tutorials/initial-server-setup-with-ubuntu-18-04>`__ puede ayudarte a resolver esto. En nuestro caso, configuramos un usuario llamado ``odm``, por lo que conectarse a él es a través del comando``ssh odm@xxx.xxx.xxx.xxx`` (donde las x representan la dirección IPv4 de su servidor) . Si desea seguir este ejemplo de cerca, *utilice* el nombre de usuario ``odm``; entonces su ruta de instalación será ``/home/odm/ODM/`` y coincidirá con todos los ejemplos de este documento.

source: Go ahead and execute ``sudo apt update`` and ``sudo apt upgrade`` to ensure your server isn’t dangerously without updates. Make sure to stay with Ubuntu 18.04.
es: Continúe y ejecute ``sudo apt update`` y ``sudo apt upgrade`` para asegurarse de que su servidor no esté peligrosamente sin actualizaciones. Asegúrese de permanecer con Ubuntu 18.04.

source: Download and install ODM on it from the `ODM Github <https://github.com/OpenDroneMap/ODM>`__ (regular, not WebODM) with the following commands:
ar: قم بتنزيل وتثبيت ODM عليه من `ODM Github <https://github.com/OpenDroneMap/ODM>` __ (عادي ، وليس WebODM) باستخدام الأوامر التالية:
es: Descargue e instale ODM en él desde el ʻODM Github <https://github.com/OpenDroneMap/ODM>`__ (normal, no WebODM) con los siguientes comandos:

source: If you do this from the default home folder of your user (i.e. ``odm``) the path to the install will be ``/home/odm/ODM`` (abbreviated as ``~/ODM/``).
ar: إذا قمت بذلك من المجلد الرئيسي الافتراضي للمستخدم (أي `` odm '') ، فسيكون المسار إلى التثبيت هو '' home / odm / ODM '' (يُختصر باسم `` ~ / ODM / '').
es: Si hace esto desde la carpeta de inicio predeterminada de su usuario (es decir, ``odm``), la ruta a la instalación será ``/home/odm/ODM`` (abreviado como ``~/ODM/``).

source: There are some environmental variables that need to be set. Open the ~/.bashrc file on your machine and add the following 3 lines at the end (From `the ODM github <https://github.com/OpenDroneMap/ODM>`__). The file can be opened with ``nano ~/.bashrc`` (or whatever text editor you use in lieu of nano). Be sure to replace ``/home/odm/`` with the correct path to the location where you extracted OpenDroneMap if you didn’t do everything exactly as in our example (for example if you used a different username in your server setup):
ar: هناك بعض المتغيرات البيئية التي يجب تحديدها. افتح ملف ~/.bashrc على جهازك وأضف الأسطر الثلاثة 3 في النهاية (من `github ODM <https://github.com/OpenDroneMap/ODM>` __). يمكن فتح الملف باستخدام ``nano ~/.bashrc`` (أو أي محرر نصوص تستخدمه بدلاً من nano). تأكد من استبدال ``/home/odm/`` بالمسار الصحيح إلى الموقع الذي قمت باستخراج OpenDroneMap إذا لم تفعل كل شيء تمامًا كما في مثالنا (على سبيل المثال إذا كنت تستخدم اسم مستخدم مختلفًا في إعداد الخادم الخاص بك) :
es: Hay algunas variables ambientales que deben configurarse. Abra el archivo ~/.bashrc en su máquina y agregue las siguientes 3 líneas al final (De `the ODM github <https://github.com/OpenDroneMap/ODM>`__). El archivo se puede abrir con ``nano~/.bashrc`` (o cualquier editor de texto que use en lugar de nano). Asegúrese de reemplazar ``/home/odm/`` con la ruta correcta a la ubicación donde extrajo OpenDroneMap si no hizo todo exactamente como en nuestro ejemplo (por ejemplo, si usó un nombre de usuario diferente en la configuración de su servidor):

source: Note that the ODM github readme contains a slight error, the install directory name will be ODM, not OpenDroneMap (you’ll see this if you compare the above instructions to the ones on the ODM GitHub).
ar: لاحظ أن الملف التمهيدي لـ github الخاص بـ ODM يحتوي على خطأ بسيط ، سيكون اسم دليل التثبيت هو ODM ، وليس OpenDroneMap (سترى هذا إذا قارنت الإرشادات المذكورة أعلاه بالإرشادات الموجودة على ODM GitHub).
es: Tenga en cuenta que el archivo Léame de ODM github contiene un pequeño error, el nombre del directorio de instalación será ODM, no OpenDroneMap (lo verá si compara las instrucciones anteriores con las del ODM GitHub).

source: In order to prevent a crash wherein the split-merge process fails to locate its own executable, we add the following lines to ``~/.bashrc`` (adjust paths if you’ve set things up differently from our example):
ar: لمنع حدوث عطل حيث تفشل عملية الدمج المقسم في تحديد موقع الملف التنفيذي الخاص بها ، نضيف الأسطر التالية إلى ``~/.bashrc`` (اضبط المسارات إذا قمت بإعداد الأشياء بشكل مختلف عن مثالنا):
es: Para evitar un bloqueo en el que el proceso de split-merge no localice su propio ejecutable, agregamos las siguientes líneas a ``~/.bashrc`` (ajuste las rutas si ha configurado las cosas de manera diferente a nuestro ejemplo):

source: Now you’ll need a second cloud hard drive (a “Volume” in Digital Ocean jargon) big enough to manage your project. Rule of thumb seems to be 10 times the size of your raw image set; we’ve got a 100GB image set and set up a 1000GB volume (once the run is done you should be able to get rid of most of this expensive drive capacity, but it’s needed to complete the process). Set up the volume, attach it to your droplet, and `configure its mount point <https://www.digitalocean.com/docs/volumes/how-to/mount/>`__ (in this example we’re setting it to ``/mnt/odmdata/``).
ar: ستحتاج الآن إلى محرك أقراص ثابت سحابي ثانٍ ("حجم" في المصطلح الرقمي للمحيط) كبير بما يكفي لإدارة مشروعك. يبدو أن القاعدة الأساسية هي 10 أضعاف حجم مجموعة صورك الخام ؛ لدينا مجموعة من الصور بحجم 100 جيجابايت وقمنا بإعداد وحدة تخزين بحجم 1000 جيجابايت (بمجرد الانتهاء من التشغيل ، يجب أن تكون قادرًا على التخلص من معظم سعة محرك الأقراص الباهظة الثمن هذه ، ولكن يلزم إكمال العملية). قم بإعداد الصوت وإرفاقه بالقطرة الخاصة بك ، و `تكوين نقطة التحميل الخاصة به <https://www.digitalocean.com/docs/volumes/how-to/mount/>`__ (في هذا المثال ، نقوم بتعيينه إلى ``/mnt/odmdata/``).
es: Ahora necesitará un segundo disco duro en la nube (un "Volumen" en la jerga de Digital Ocean) lo suficientemente grande para administrar su proyecto. La regla de oro parece ser 10 veces el tamaño de su conjunto de imágenes sin procesar; tenemos un conjunto de imágenes de 100 GB y configuramos un volumen de 1000 GB (una vez que la ejecución haya terminado, debería poder deshacerse de la mayor parte de esta costosa capacidad de disco, pero es necesaria para completar el proceso). Configure el volumen, adjúntelo a su Droplet y `configure su punto de montaje <https://www.digitalocean.com/docs/volumes/how-to/mount/>`__ (en este ejemplo lo estamos configurando a ``/mnt/odmdata/``).

source: Prep data and project
ar: إعداد البيانات والمشروع
es: Datos de preparación y proyecto

source: Now push your images onto the server. You can use `Secure Copy (scp) <https://en.wikipedia.org/wiki/Secure_copy>`__ like so: ``scp -r /path/to/my/imagefolder odm@xxx.xxx.xxx.xxx:/mnt/odmdata/``.
ar: الآن ادفع صورك إلى الخادم. يمكنك استخدام `Secure Copy (scp) <https://en.wikipedia.org/wiki/Secure_copy>`__ مثل ذلك: ``scp -r /path/to/my/imagefolder odm@xxx.xxx.xxx.xxx:/mnt/odmdata/``.
es: Ahora envíe sus imágenes al servidor. Puede usar `Secure Copy (scp) <https://en.wikipedia.org/wiki/Secure_copy>`__ así: ``scp -r /path/to/my/imagefolder odm@xxx.xxx.xxx. xxx: /mnt/odmdata/``.

source: This pushes the entire folder full of images (that’s what the ``-r`` option does, “recursive”) into the remote location (in our example, into the volume we attached to the cloud machine at ``/mnt/odmdata/``.
ar: يؤدي هذا إلى دفع المجلد بالكامل المليء بالصور (هذا ما يفعله الخيار "-r" ، "العودية") في الموقع البعيد (في مثالنا ، في الحجم الذي نعلقه على الجهاز السحابي على ``/mnt/odmdata/``.
es: Esto copia toda la carpeta llena de imágenes (eso es lo que hace la opción ``-r'', ``recursiva``) en la ubicación remota (en nuestro ejemplo, en el volumen que adjuntamos a la máquina en la nube en ``/mnt/odmdata/``.

source: This will take some bandwidth. No way around the size of the files.\ `1 <#footnote1>`__, \ `2 <#footnote2>`__\
ar: سيستغرق هذا بعض عرض النطاق الترددي. لا توجد طريقة حول حجم الملفات.\ `1 <#footnote1>`__, \ `2 <#footnote2>`__\
es: Esto costará algo de ancho de banda. No hay forma de evitar el tamaño de los archivos\ `1 <#footnote1>`__, \ `2 <#footnote2>`__\

source: Directory structure
ar: بنية الدليل
es: Estructura del directorio

source: ODM requires the directories on the machine to be set up just so. The critical bits are the install folder (if you installed as above, it’s ``/home/odm/ODM/``) and the project folder (i.e. ``/mnt/odmdata/myproject/``)
ar: يتطلب ODM إعداد الدلائل الموجودة على الجهاز فقط. البتات الحرجة هي مجلد التثبيت (إذا قمت بتثبيته كما هو موضح أعلاه ، فهو ``/home/odm/ODM/`` ومجلد المشروع (i.e. ``/mnt/odmdata/myproject/``))
es: ODM requiere que los directorios de la máquina se configuren exactamente así. Los bits críticos son la carpeta de instalación (si instaló como antes, es ``/home/odm/ODM/``) y la carpeta del proyecto (es decir, ``/mnt/odmdata/myproject/``)

source: ODM’s settings.yaml file specifies a single parent directory containing all projects. This is what goes in the project path line of the settings.yaml file (slightly confusingly, this is actually the *parent* directory of the individual project directories, which are specified by the project name parameter when calling ODM). Edit settings.yaml and set the project_path parameter to (as per our example setup) ``/mnt/odmdata/``, which in this case points to the Volume we created. Individual project directories are created within that.
ar: يحدد ملف settings.yaml الخاص بـ ODM دليل أصل واحد يحتوي على كافة المشاريع. هذا هو ما يحدث في سطر مسار المشروع لملف settings.yaml (بشكل مثير للارتباك قليلاً ، هذا في الواقع هو الدليل * الأصل * لأدلة المشروع الفردية ، والتي يتم تحديدها بواسطة معلمة اسم المشروع عند استدعاء ODM). قم بتحرير الإعدادات. yaml وقم بتعيين معلمة project_path إلى (وفقًا لإعداد المثال الخاص بنا) ``/mnt/odmdata/`` ، والتي تشير في هذه الحالة إلى المجلد الذي أنشأناه. يتم إنشاء أدلة المشاريع الفردية في ذلك.
es: El archivo settings.yaml de ODM especifica un único directorio principal que contiene todos los proyectos. Esto es lo que va en la línea de ruta del proyecto del archivo settings.yaml (un poco confuso, este es en realidad el directorio *principal* de los directorios del proyecto individual, que se especifican mediante el parámetro de nombre del proyecto al llamar a ODM). Edite settings.yaml y establezca el parámetro project_path en (según nuestra configuración de ejemplo) ``/mnt/odmdata/``, que en este caso apunta al Volumen que creamos. Dentro de eso se crean directorios de proyectos individuales.

source: Individual project directories, i.e. ``/mnt/odmdata/myproject/`` contain the gcp_list.txt file, the image_groups.txt file, and the images folder for each project``\`
ar: دلائل المشروع الفردية ، أي``/mnt/odmdata/myproject/`` `تحتوي على ملف gcp_list.txt ، ملف image_groups.txt ، ومجلد الصور لكل مشروع``\`
es: Los directorios de proyectos individuales, es decir, ``/mnt/odmdata/myproject/`` contienen el archivo gcp_list.txt, el archivo image_groups.txt y la carpeta de imágenes para cada proyecto ``\``

source: The images folder, i.e. ``/mnt/odmdata/myproject/images/`` contains all of the images. If you set it up like this, the images don’t get re-copied because they’re already in the directory that ODM wants them in.
ar: يحتوي مجلد الصور ، أي ```/mnt/odmdata/myproject/images/`` على جميع الصور. إذا قمت بإعداده على هذا النحو ، فلن تتم إعادة نسخ الصور لأنها موجودة بالفعل في الدليل الذي يريدها ODM.
es: La carpeta de imágenes, es decir, ``/mnt/odmdata/myproject/images/`` contiene todas las imágenes. Si lo configura así, las imágenes no se vuelven a copiar porque ya están en el directorio en el que ODM las quiere.

source: Modify settings.yaml to specify the parent directory of the project folder (in this case the Volume we created, ``/mnt/odmdata/``). Make sure the images are in the correct spot, i.e. ``/mnt/odmdata/myproject/images`` and the other ancillary files (gcp_list.txt and image_groups.txt) are in the root folder ``/mnt/odmdata/myproject/``
ar: قم بتعديل settings.yaml لتحديد الدليل الأصلي لمجلد المشروع (في هذه الحالة المجلد الذي أنشأناه ، `` / mnt / odmdata / ``). تأكد من أن الصور في الموضع الصحيح ، مثل ``/mnt/odmdata/myproject/images`` والملفات المساعدة الأخرى (gcp_list.txt و image_groups.txt) في المجلد الجذر ``/mnt/odmdata/myproject/``
es: Modifique settings.yaml para especificar el directorio principal de la carpeta del proyecto (en este caso, el Volumen que creamos, ``/mnt/odmdata/``). Asegúrese de que las imágenes estén en el lugar correcto, es decir, ``/mnt/odmdata/myproject/images`` y los otros archivos auxiliares (gcp_list.txt e image_groups.txt) están en la carpeta raíz ``/mnt/odmdata/myproject/``

source: if you have the images in separate folders for individual AOI blocks or flights (which you will if your flight management was organized), you can create an image_groups.txt file with the incantations ``for i in *; do cd $i; for j in *; do echo "$j $i" >> ../$i.txt; done; cd ../; done;`` and ``cd ../``, ``for i in myproject/*.txt; do cat $i >> image_groups.txt; done;``. That should create a file with the correct structure: a list of all image files and a “group name” after each one (which in this case will simply be the name of the folder it came from). Then move all of the image files into a single directory called images in the project root dir (so ``/mnt/odmdata/myproject/images/``). The image_groups.txt file will allow ODM to keep track of which images belong to the same batch, even though they’re all in a single directory.
ar: إذا كانت لديك الصور في مجلدات منفصلة لكتل ​​أو رحلات طيران فردية (والتي ستفعلها إذا تم تنظيم إدارة رحلتك) ، فيمكنك إنشاء ملف image_groups.txt مع التعويذات ``لـ i in * ؛ هل cd $ i ؛ for j in *؛ do echo "$ j $ i" >> ../$i.txt؛ فعله؛ مؤتمر نزع السلاح ../ ؛ فعل ؛`` و ``cd ../`` ، ``لأني في myproject / *. txt ؛ do cat $ i >> image_groups.txt؛ فعل ؛``. من المفترض أن يؤدي ذلك إلى إنشاء ملف بهيكل صحيح: قائمة بجميع ملفات الصور و "اسم المجموعة" بعد كل ملف (والذي سيكون في هذه الحالة ببساطة اسم المجلد الذي جاء منه). ثم انقل جميع ملفات الصور إلى دليل واحد يسمى الصور في دليل جذر المشروع (لذا ``/mnt/odmdata/myproject/images/``). سيسمح ملف image_groups.txt لـ ODM بتتبع الصور التي تنتمي إلى نفس الدفعة ، على الرغم من أنها كلها في دليل واحد.
es: Si tiene las imágenes en carpetas separadas para bloques AOI o vuelos individuales (lo que hará si su gestión de vuelos fue organizada), puede crear un archivo image_groups.txt con los encantamientos ``for i in *; do cd $i; for j in *; do echo "$j $i" >> ../$i.txt; done; cd ../; done;`` y ``cd ../``, ``for i in myproject/*.txt; do cat $i >> image_groups.txt; done;``. Eso debería crear un archivo con la estructura correcta: una lista de todos los archivos de imagen y un "nombre de grupo" después de cada uno (que en este caso será simplemente el nombre de la carpeta de la que proviene). Luego mueva todos los archivos de imagen a un solo directorio llamado imágenes en el directorio raíz del proyecto (por lo tanto, ``/mnt/odmdata/myproject/images/``). El archivo image_groups.txt permitirá que ODM realice un seguimiento de las imágenes que pertenecen al mismo lote, aunque estén todas en un solo directorio.
