Repository: OpenDroneMap/odm-docs
Catalog: source/locale/*/LC_MESSAGES/tutorials.po
Languages: ar, es

source: Resize droplet, pull pin, run away
ar: تغيير حجم القطرة ، وسحب دبوس ، والهروب
es: Cambie el tamaño del Droplet, quite el seguro, huya

source: Shut down and resize your machine to an appropriately monstrous number of CPUs and amount of memory. I use the memory-optimized machine with 24 dedicated vCPUs and 192GB of RAM (which costs about $1.60/hr—which adds up fast, it’s over $1000/month). Restart, and get to work quickly so as not to waste expensive big-droplet time.
ar: قم بإيقاف تشغيل جهازك وتغيير حجمه إلى عدد هائل من وحدات المعالجة المركزية وكمية الذاكرة المناسبة. أستخدم الجهاز المُحسّن للذاكرة مع 24 وحدة vCPU مخصصة و 192 غيغابايت من ذاكرة الوصول العشوائي (والتي تكلف حوالي 1.60 دولارًا في الساعة - والتي تضيف بسرعة ، تزيد عن 1000 دولار / شهر). إعادة التشغيل ، والبدء في العمل بسرعة حتى لا تضيع وقتًا كبيرًا.
es: Apague y cambie el tamaño de su máquina a una cantidad monstruosa de CPU y memoria. Utilizo la máquina con memoria optimizada con 24 vCPU dedicadas y 192 GB de RAM (que cuesta alrededor de $ 1,60 / hora, lo que se suma rápido y supera los $ 1000/mes). Reinicie y comience a trabajar rápidamente para no perder el costoso tiempo de los Droplets grandes.

source: Launch the ODM process via ssh using nohup (so that if you’re cut off, processing will continue)
ar: ابدأ تشغيل عملية ODM عبر ssh باستخدام nohup (بحيث إذا تم قطع الاتصال ، فستستمر المعالجة)
es: Inicie el proceso ODM a través de ssh usando nohup (de modo que, si se corta, el procesamiento continuará)

source: Alternately you can use GNU screen to launch the process from a screen session which won’t stop if your connection is interrupted; launch ``screen``, and use ``<ctrl> a <ctrl> d`` to detach, ``screen -r`` to re-attach. But using screen won’t get you a log file of all of the console output unless you do something specific to capture that, while nohup gives you a file with all of the console output, including error messages, for free.
ar: بدلاً من ذلك ، يمكنك استخدام شاشة GNU لبدء العملية من جلسة الشاشة التي لن تتوقف إذا انقطع اتصالك ؛ قم بتشغيل `` الشاشة '' ، واستخدم `` <ctrl> a <ctrl> d '' لفصل "الشاشة - r" لإعادة توصيلها. لكن استخدام الشاشة لن ​​يمنحك ملف سجل لجميع مخرجات وحدة التحكم ما لم تفعل شيئًا محددًا لالتقاط ذلك ، بينما يمنحك nohup ملفًا يحتوي على جميع مخرجات وحدة التحكم ، بما في ذلك رسائل الخطأ ، مجانًا
es: Alternativamente, puede usar la pantalla GNU para iniciar el proceso desde una sesión de pantalla que no se detendrá si se interrumpe su conexión, inicie ``screen`` y use ``<ctrl> a <ctrl> d`` para separar, ``screen -r`` para volver a juntar. Pero al usar la pantalla no obtendrá un archivo de registro de toda la salida de la consola a menos que haga algo específico para capturar eso, mientras que nohup le brinda un archivo con toda la salida de la consola, incluidos los mensajes de error, de forma gratuita.

source: Note: as of 2020-03 the normal incantation ``python run.py -i /path/to/image/folder project_name`` seems *not* to work; the ``-i`` or ``--image`` parameter causes a weird error. So we drop the -i parameter, and rely on the project directory line in the settings.yaml file to direct ODM to the right place. Now using (including a split-merge):
ar: ملاحظة: اعتبارًا من 2020-03، يبدو أن التعطيل العادي `` python run.py -i /path/to/image/folder project_nam '' يبدو * غير * يعمل ؛ تؤدي المعلمة "-i" أو "--image" إلى حدوث خطأ غريب. لذا نسقط المعلمة -i ، ونعتمد على سطر دليل المشروع في ملف settings.yaml لتوجيه ODM إلى المكان الصحيح. الآن باستخدام (بما في ذلك الدمج المقسم):
es: Nota: a partir de 2020-03, el encantamiento normal ``python run.py -i /path/to/image/folder project_name`` parece *no* funcionar; el parámetro ``-i`` o ``--image`` causa un error extraño. Entonces introducimos el parámetro -i y y confiamos en la línea del directorio del proyecto en el archivo settings.yaml para dirigir ODM al lugar correcto. Ahora usando (incluyendo split-merge):

source: This points ODM at the folder (in this example) ``/mnt/odmdata/myproject/``. Provided the image_groups.txt and gcp_list.txt are in this folder, the images are in ``/mnt/odmdata/myproject/images/``, and the project path in settings.yaml is ``/mnt/odmdata/`` it will not waste time and space copying images.
ar: هذا يشير إلى ODM في المجلد (في هذا المثال) ```/mnt/odmdata/myproject/``. بشرط أن يكون ملف image_groups.txt و gcp_list.txt في هذا المجلد ، فإن الصور موجودة في ``/mnt/odmdata/myproject/images/`` ، ومسار المشروع في الإعدادات. yaml هو ``/mnt/odmdata/`` لن تضيع الوقت ونسخ الصور الفضائية.
es: Esto apunta a ODM a la carpeta (en este ejemplo) ``/mnt/odmdata/myproject/``. Siempre que image_groups.txt y gcp_list.txt estén en esta carpeta, las imágenes están en ``/mnt/odmdata/myproject/images/``, y la ruta del proyecto en settings.yaml es ``/mnt/odmdata/`` no perderá tiempo ni espacio copiando imágenes.

source: Note that this assumes you have an image_groups.txt file. If not, this ``-split-overlap 0`` will probably fuck things up, and the ``--split 1`` is literally a random number that will be ignored after the image_groups.txt file is loaded (I think it normally controls how many groups it splits a set of images into, but in our case we’re assuming the images are already grouped sensibly). If you don’t have a large dataset (>1000 images), omit the ``--split`` and ``--split-overlap`` options.
ar: لاحظ أن هذا يفترض أن لديك ملف image_groups.txt. إذا لم يكن الأمر كذلك ، فمن المحتمل أن يؤدي هذا "-split-interap 0" إلى تلاعب الأمور ، و "--plit 1" هو حرفيا رقم عشوائي سيتم تجاهله بعد تحميل ملف image_groups.txt (أعتقد ذلك تتحكم عادةً في عدد المجموعات التي تقوم بتقسيم مجموعة من الصور إليها ، ولكن في حالتنا نحن نفترض أن الصور مجمعة بالفعل بشكل معقول). إذا لم يكن لديك مجموعة بيانات كبيرة (> 1000 صورة) ، فاحذف خياري "- تقسيم" و "- تقسيم متداخل".
es: Tenga en cuenta que esto supone que tiene un archivo image_groups.txt. Si no es así, este ``-split-overlap 0`` probablemente arruinará las cosas, y el ``--split 1`` es literalmente un número aleatorio que se ignorará despues de que se cargue el archivo image_groups.txt (creo que normalmente controla en cuántos grupos divide un conjunto de imágenes, pero en nuestro caso asumimos que las imágenes ya están agrupadas de manera sensata). Si no tiene un conjunto de datos grande (> 1000 imágenes), omita las opciones ``--split`` y ``--split-overlap``.

source: Follow the progress using tail (so that you’ll know when it’s done)
ar: اتبع التقدم باستخدام الذيل (حتى تعرف متى يتم ذلك)
es: Siga el progreso usando tail (para que sepa cuando está hecho)

source: You may want to keep an eye on htop (to get a sense of the resource usage so that in future you can only spin up a machine as large as necessary)
ar: قد ترغب في مراقبة htop (للحصول على فكرة عن استخدام الموارد حتى تتمكن في المستقبل من تدوير آلة كبيرة بقدر الضرورة)
es: Es posible que desee estar atento a htop (para tener una idea del uso de recursos para que en el futuro solo pueda hacer girar una máquina tan grande como sea necesario)

source: After it finishes (assuming you survive that long)
ar: بعد الانتهاء (بافتراض أنك تعيش طويلاً)
es: Después de que termine (suponiendo que sobrevivas tanto tiempo)

source: As soon as processing is done, shut down the machine and resize it back down to the inexpensive minimum capacity.
ar: بمجرد الانتهاء من المعالجة ، أغلق الماكينة وقم بتغيير حجمها مرة أخرى إلى الحد الأدنى للسعة غير المكلفة.
es: Tan pronto como termine el procesamiento, apague la máquina y cambie su tamaño a la capacidad mínima económica.

source: Start the machine back up, and log in via ssh.
ar: قم بتشغيل الجهاز احتياطيًا ، وقم بتسجيل الدخول عبر ssh.
es: Inicie la copia de seguridad de la máquina e inicie sesión a través de ssh.

source: If you want to save download bandwidth, you can compress the orthophoto using GDAL. Don’t add overviews, do that on your local machine to avoid making the file bigger before downloading it.
ar: إذا كنت تريد حفظ النطاق الترددي للتنزيل ، يمكنك ضغط الصورة التقويمية باستخدام GDAL. لا تضيف نظرة عامة ، افعل ذلك على جهازك المحلي لتجنب تكبير الملف قبل تنزيله.
es: Si desea ahorrar ancho de banda de descarga, puede comprimir la ortofoto usando GDAL. No agregue descripciones generales, hágalo en su máquina local para evitar agrandar el archivo antes de descargarlo.

source: Download using scp: ``scp odm@xxx.xxx.xxx.xxx:/mnt/odmdata/myproject/odm_orthophoto/odm_orthophoto.tif`` (or grab the compressed version you created in the last step)
ar: التنزيل باستخدام scp: ``scp odm@xxx.xxx.xxx.xxx:/mnt/odmdata/myproject/odm_orthophoto/odm_orthophoto.tif`` (أو احصل على النسخة المضغوطة التي أنشأتها في الخطوة الأخيرة)
es: Descargue usando scp: ``scp odm@xxx.xxx.xxx.xxx:/mnt/odmdata/myproject/odm_orthophoto/odm_orthophoto.tif`` (o tome la versión comprimida que creó en el último paso)

source: Once you get the file on your local computer, you can use QGIS to add overviews (“pyramids”) or use the GDAL command ``gdaladdo -r average /path/to/image.tif 2 4 8 16 32 64 128 256 512 1024``.
ar: بمجرد الحصول على الملف على جهاز الكمبيوتر المحلي الخاص بك ، يمكنك استخدام QGIS لإضافة نظرة عامة ("الأهرامات") أو استخدام أمر GDAL ``gdaladdo -r average /path/to/image.tif 2 4 8 16 32 64 128 256 512 1024``.
es: Una vez que obtenga el archivo en su computadora local, puede usar QGIS para agregar descripciones generales (“pyramids”) o usar el comando GDAL ``gdaladdo -r average /path/to/image.tif 2 4 8 16 32 64 128 256 512 1024``.

source: You can archive the odm_texturing, odm_georeferencing, and odm-dem folders using tar to make them easier to download in one piece (and maybe smaller).
ar: يمكنك أرشفة مجلدات odm_texturing و odm_georeferencing و odm-dem باستخدام tar لتسهيل عملية التنزيل في قطعة واحدة (وربما أصغر).
es: Puede archivar las carpetas odm_texturing, odm_georeferencing y odm-dem usando tar para que sea más fácil descargarlas en una sola pieza (y tal vez más pequeñas).

source: `Learn to edit <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ and help improve `this page <https://github.com/OpenDroneMap/docs/blob/publish/source/tutorials.rst>`_!
es: `Aprende a editar <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ y ayuda a mejorar `esta página <https://github.com/OpenDroneMap/docs/blob/publish/source/tutorials.rst>`_!
