Repository: OpenDroneMap/odm-docs
Catalog: source/locale/*/LC_MESSAGES/tutorials.po
Languages: ar, es

source: Tutorials
ar: دروس
es: Tutoriales

source: Below you will find instructions for some common use cases.
ar: ستجد أدناه تعليمات لبعض حالات الاستخدام الشائعة.
es: A continuación, encontrará instrucciones para algunos casos de uso comunes.

source: Creating High Quality Orthophotos
ar: إنشاء Orthophotos عالية الجودة
es: Creación de Ortofotos de Alta Calidad

source: Without any parameter tweaks, ODM chooses a good compromise between quality, speed and memory usage. If you want to get higher quality results, you need to tweak some parameters:
ar: بدون أي تعديلات في المعلمات ، يختار ODM حل وسط جيد بين الجودة والسرعة واستخدام الذاكرة. إذا كنت ترغب في الحصول على نتائج عالية الجودة ، فأنت بحاجة إلى تعديل بعض المعلمات:
es: Sin ningún ajuste de parámetros, ODM elije un buen balance entre calidad, velocidad y uso de memoria. Si quiere obtener resultados de mayor calidad, debe modificar algunos parámetros:

source: ``--orthophoto-resolution`` is the resolution of the orthophoto in cm/pixel. Decrease this value for a higher resolution result.
ar: Resolution '' هي دقة صورة Orthophoto بالسنتيمتر / بكسل. إنقاص هذه القيمة للحصول على نتيجة دقة أعلى.
es: ``--orthophoto-resolution`` es la resolución de la ortofoto en cm/pixel. Disminuya este valor para obtener un resultado de mayor resolución.

source: ``--ignore-gsd`` is a flag that instructs ODM to skip certain memory and speed optimizations that directly affect the orthophoto. Using this flag will increase runtime and memory usage, but may produce sharper results.
ar: "--ignore-gsd" هي علامة توجه تعليمات ODM لتخطي بعض الذاكرة وتحسينات السرعة التي تؤثر بشكل مباشر على الصورة. سيؤدي استخدام هذه العلامة إلى زيادة وقت التشغيل واستخدام الذاكرة ، ولكن قد ينتج عنه نتائج أكثر وضوحًا.
es: ``--ignore-gsd`` es un indicador de instruye a ODM a omitir ciertas optimizaciones de memoria y velocidad que afectan la ortofoto. El uso de este indicador aumentará el tiempo de ejecución y el uso de la memoria, pero puede producir resultados mas nítidos.

source: ``--texturing-nadir-weight`` should be increased to ``29-32`` in urban areas to reconstruct better edges of roofs. It should be decreased to ``0-6`` in grassy / flat areas.
ar: يجب زيادة ``-texturing-nadir-weight`` إلى ``29-32`` في المناطق الحضرية لإعادة بناء حواف أفضل للأسقف. يجب تخفيضها إلى "0-6" في المناطق العشبية / المسطحة.
es: ``--texturing-nadir-weight`` debe aumentarse a ``29-32`` en áreas urbanas para reconstruir mejores bordes de techos. Debe reducirse a ``0-6`` en áreas con césped o planas.

source: ``--texturing-data-term`` should be set to `area` in forest areas.
ar: يجب تعيين ``--texturing-data-term`` على "المنطقة" في مناطق الغابات.
es: ``--texturing-data-term`` debe establecerse en `area` para áreas forestales.

source: ``--mesh-size`` should be increased to ``300000-600000`` and ``--mesh-octree-depth`` should be increased to ``10-11`` in urban areas to recreate better buildings / roofs.
ar: يجب زيادة ``mesh-size--`` إلى ``300000-600000`` و ``--mesh-octree-depth`` يجب زيادتها إلى ``10-11`` في المناطق الحضرية لإعادة إنشاء مباني / أسقف أفضل.
es: ``--mesh-size`` debe incrementarse a ``300000-600000`` y ``--mesh-octree-depth`` debe incrementarse a ``10-11`` en áreas urbanas para recrear mejor los edificios/techos.

source: Calibrating the Camera
ar: معايرة الكاميرا
es: Calibrar la cámara

source: Camera calibration is a special challenge with commodity cameras. Temperature changes, vibrations, focus, and other factors can affect the derived parameters with substantial effects on resulting data. Automatic or self calibration is possible and desirable with drone flights, but depending on the flight pattern, automatic calibration may not remove all distortion from the resulting products. James and Robson (2014) in their paper `Mitigating systematic error in topographic models derived from UAV and ground‐based image networks <https://onlinelibrary.wiley.com/doi/full/10.1002/esp.3609>`_ address how to minimize the distortion from self-calibration.
ar: تعد معايرة الأميرة تحديًا خاصًا مع كاميرات السلع. يمكن أن تؤثر التغيرات في درجات الحرارة والاهتزازات والتركيز والعوامل الأخرى على المعلمات المشتقة مع تأثيرات كبيرة على البيانات الناتجة. المعايرة التلقائية أو الذاتية ممكنة ومرغوب فيها مع رحلات الطائرات بدون طيار ، ولكن اعتمادًا على نمط الرحلة ، قد لا تؤدي المعايرة التلقائية إلى إزالة كل التشويه من المنتجات الناتجة. جيمس وروبسون (2014) في ورقتهما بعنوان `` التخفيف من الخطأ المنهجي في النماذج الطبوغرافية المشتقة من الطائرات بدون طيار وشبكات الصور الأرضية <https://onlinelibrary.wiley.com/doi/full/10.1002/esp.3609> "_ معالجة كيف لتقليل التشويه من المعايرة الذاتية.
es: La calibración de la cámara es un desafío especial con las cámaras básicas. Los cambios de temperatura, las vibraciones, el enfoque y otros factores pueden afectar los parámetros derivados con efectos sustanciales en los datos resultantes. La calibración automática o la autocalibración es posible y deseable para los vuelos de drones, pero dependiendo del patrón de vuelo, la calibración automática puede no eliminar toda la distorsión de los productos resultantes. James y Robson (2014) en su artículo `Mitigating systematic error in topographic models derived from UAV and ground‐based image networks <https://onlinelibrary.wiley.com/doi/full/10.1002/esp.3609>`_ abordan cómo para minimizar la distorsión de la autocalibración.

source: *Bowling effect on point cloud over 13,000+ image dataset collected by World Bank Tanzania over the flood prone Msimbasi Basin, Dar es Salaam, Tanzania.*
ar: * تأثير البولينج على السحابة النقطية أكثر من 13000 مجموعة بيانات للصور تم جمعها من قبل البنك الدولي في تنزانيا حول حوض الفيضانات المعرض للفيضانات ، دار السلام ، تنزانيا. *
es: *Efecto de tazón en la nube de puntos de un juego de datos de mas de 13,000 imágenes colectadas por el Banco mundial de Tanzania sobre la cuenca propensa a inundaciones de Msimbasi, Dar es Salaam, Tanzania.*

source: To mitigate this effect, there are a few options but the simplest are as follows: fly two patterns separated by 20°, and rather than having a nadir (straight down pointing) camera, use one that tilts forward by 5°.
ar: للتخفيف من هذا التأثير ، هناك عدد قليل من الخيارات ولكن أبسطها على النحو التالي: حلّق بنمطين مفصولين بـ 20 درجة ، وبدلاً من أن يكون لديك كاميرا (إشارة مستقيمة لأسفل) ، استخدم واحدًا يميل إلى الأمام بمقدار 5 درجات.
es: Para mitigar este efecto, hay algunas opciones, pero las más simples son las siguientes: vuele dos patrones separados por 20 °, y en lugar de tener una cámara nadir (apuntando hacia abajo), use una que se incline hacia adelante en 5 °.

source: As this approach to flying can be take longer than typical flights, a pilot or team can fly a small area using the above approach. OpenDroneMap will generate a calibration file called cameras.json that then can be imported to be used to calibrate another flight that is more efficiently flown.
ar: نظرًا لأن هذا النهج في الطيران يمكن أن يستغرق وقتًا أطول من الرحلات النموذجية ، يمكن للطيار أو الفريق أن يطير في منطقة صغيرة باستخدام النهج أعلاه. ستقوم OpenDroneMap بإنشاء ملف معايرة يسمى camera.json يمكن استيراده بعد ذلك لاستخدامه لمعايرة رحلة أخرى يتم نقلها بكفاءة أكبر.
es: Como este enfoque de vuelo puede llevar más tiempo que los vuelos típicos, un piloto o un equipo pueden volar en un área pequeña utilizando el enfoque anterior. OpenDroneMap generará un archivo de calibración llamado camera.json que luego se puede importar para usarlo para calibrar otro vuelo que se vuela de manera más eficiente.

source: Alternatively, the following experimental method can be applied: fly with much lower overlap, but two *crossgrid* flights (sometimes called crosshatch) separated by 20° with a 5° forward facing camera.
ar: بدلاً من ذلك ، يمكن تطبيق الطريقة التجريبية التالية: حلّق بتداخل أقل بكثير ، لكن رحلتين * متصالبتين * (تسمى أحيانًا التقاطع المائل) مفصولتين بزاوية 20 درجة مع كاميرا أمامية 5 درجات.
es: Alternativamente, se puede aplicar el siguiente método experimental: volar con una superposición mucho menor, pero dos vuelos de *rejilla cruzada* (a veces llamados rayados cruzados) separados por 20 ° con una cámara de 5 ° orientada hacia adelante.

source: Crossgrid overlap percentages can be lower than parallel flights. To get good 3D results, you will require 68% overlap and sidelap for an equivalent 83% overlap and sidelap.
ar: مكن أن تكون نسب التداخل بين خطوط الشبكة أقل من الرحلات المتوازية. للحصول على نتائج جيدة ثلاثية الأبعاد ، ستحتاج إلى تداخل 68٪ و sidelap لما يعادل 83٪ تداخل و sidelap.
es: Los porcentajes de superposición de rejillas cruzadas pueden ser más bajos que los vuelos paralelos. Para obtener buenos resultados en 3D, necesitará un 68% de superposición y superposición lateral para una superposición y superposición lateral equivalente del 83%.

source: To get good 2D and 2.5D (digital elevation model) results, you will require 42% overlap and sidelap for an equivalent 70% overlap and sidelap.
ar: للحصول على نتائج جيدة ثنائية الأبعاد و 2.5 D (نموذج الارتفاع الرقمي) ، ستحتاج إلى 42٪ تداخل و sidelap للحصول على 70٪ تراكب و sidelap مكافئ.
es: Para obtener buenos resultados en 2D y 2.5D (modelo de elevación digital), necesitará un 42% de superposición y superposición lateral para una superposición y superposición lateral equivalente del 70%.

source: Vertically separated flight lines also improve accuracy, but less so than a camera that is forward facing by 5°.
ar: كما تحسن خطوط الطيران المنفصلة عموديًا الدقة ، ولكنها أقل دقة من الكاميرا التي تواجه الأمام بمقدار 5 درجات.
es: Las líneas de vuelo separadas verticalmente también mejoran la precisión, pero menos que una cámara que mira hacia adelante en 5 °.

source: From James and Robson (2014), `CC BY 4.0 <https://creativecommons.org/licenses/by/4.0>`_
ar: من James and Robson (2014), `CC BY 4.0 <https://creativecommons.org/licenses/by/4.0>`_
es: De James and Robson (2014), `CC BY 4.0 <https://creativecommons.org/licenses/by/4.0>`_

source: Creating Digital Elevation Models
ar: إنشاء نماذج الارتفاعات الرقمية
es: Creación de modelos de elevación digitales

source: By default ODM does not create DEMs. To create a digital terrain model, make sure to pass the ``--dtm`` flag. To create a digital surface model, be sure to pass the ``--dsm`` flag.
ar: بشكل افتراضي لا يُنشئ ODM DEMs. لإنشاء نموذج تضاريس رقمي ، تأكد من تمرير علامة "--dtm". لإنشاء نموذج سطح رقمي ، تأكد من تمرير علامة "--dsm".
es: Por defecto, ODM no crea DEMs. Para crear un modelo digital de terreno, asegúrese de utilizar la marca ``--dtm``. Para crear un modelo digital de superficie, asegúrese de pasar la marca ``--dsm``.

source: For DTM generation, a Simple Morphological Filter (smrf) is used to classify points in ground vs. non-ground and only the ground points are used. The ``smrf`` filter can be controlled via several parameters:
ar: بالنسبة لتوليد DTM ، يتم استخدام مرشح مورفولوجي بسيط (smrf) لتصنيف النقاط في الأرض مقابل غير الأرض ويتم استخدام نقاط الأرض فقط. يمكن التحكم في مرشح `` smrf '' من خلال عدة معلمات:
es: Para la generación del DTM, se utiliza un filtro morfológico simple (smrf) para clasificar los puntos terrestres frente a los no terrestres y solo se utilizan los puntos terrestres. El filtro ``smrf`` se puede controlar mediante varios parámetros:

source: ``--smrf-scalar`` scaling value. Increase this parameter for terrains with lots of height variation.
ar: قيمة القياس `` - smrf-scalar ''. قم بزيادة هذه المعلمة للتضاريس مع الكثير من الاختلافات في الارتفاع.
es: Valor de escala ``--smrf-scalar``. Aumente este parámetro para terrenos con mucha variación de altura.

source: ``--smrf-slope`` slope parameter, which is a measure of "slope tolerance". Increase this parameter for terrains with lots of height variation. Should be set to something higher than 0.1 and not higher than 1.2.
ar: معلمة المنحدر `` - smrf-slope '' ، وهو مقياس لـ "تحمل المنحدر". قم بزيادة هذه المعلمة للتضاريس مع الكثير من الاختلافات في الارتفاع. يجب ضبطه على شيء أعلى من 0.1 وليس أعلى من 1.2.
es: Parámetro de pendiente ``--smrf-slope``, que es una medida de la "tolerancia de pendiente". Aumente este parámetro para terrenos con mucha variación de altura. Debe establecerse en un valor superior a 0,1 y menor a 1,2.

source: ``--smrf-threshold`` elevation threshold. Set this parameter to the minimum height (in meters) that you expect non-ground objects to be.
ar: عتبة ارتفاع "- smrf-threshold". اضبط هذه المعلمة على الحد الأدنى للارتفاع (بالأمتار) الذي تتوقعه من الكائنات غير الأرضية.
es: Umbral de elevación ``--smrf-threshold``. Establezca este parámetro en la altura mínima (en metros) que espera que tengan los objetos que no corresponden al suelo.

source: ``--smrf-window`` window radius parameter (in meters) that corresponds to the size of the largest feature (building, trees, etc.) to be removed. Should be set to a value higher than 10.
ar: `` --smrf-window '' معلمة نصف قطر النافذة (بالأمتار) التي تتوافق مع حجم أكبر ميزة (المبنى والأشجار وما إلى ذلك) المراد إزالتها. يجب ضبطه على قيمة أعلى من 10.
es: Parámetro de radio de ventana ``--smrf-window`` (en metros) que corresponde al tamaño de la característica más grande (edificio, árboles, etc.) que se eliminará. Debe establecerse en un valor superior a 10.

source: Changing these options can affect the result of DTMs significantly. The best source to read to understand how the parameters affect the output is to read the original paper `An improved simple morphological filter for the terrain classification of airborne LIDAR data <https://www.researchgate.net/publication/258333806_An_Improved_Simple_Morphological_Filter_for_the_Terrain_Classification_of_Airborne_LIDAR_Data>`_ (PDF freely available).
ar: يمكن أن يؤثر تغيير هذه الخيارات على نتيجة DTM بشكل كبير. أفضل مصدر للقراءة لفهم كيفية تأثير المعلمات على الإخراج هو قراءة الورقة الأصلية `مرشح مورفولوجي بسيط محسن لتصنيف التضاريس لبيانات LIDAR المحمولة جواً <https://www.researchgate.net/publication/258333806_An_Improved_Simple_Morphological_Filter_for_the_Terrain_Classification_of_AirDatae_LIDAR_DATA>`_ (PDF متاح مجانًا).
es: Cambiar estas opciones puede afectar significativamente el resultado de los DTM. La mejor fuente de lectura para comprender cómo los parámetros afectan la salida es leer el artículo original `An improved simple morphological filter for the terrain classification of airborne LIDAR data <https://www.researchgate.net/publication/258333806_An_Improved_Simple_Morphological_Filter_for_the_Terrain_Classification_of_Airborne_LIDAR_Data>`_ (PDF disponible gratuitamente).

source: Overall the ``--smrf-threshold`` option has the biggest impact on results.
ar: بشكل عام ، فإن خيار "- smrf-threshold" له أكبر الأثر على النتائج.
es: En general, la opción ``--smrf-threshold`` tiene el mayor impacto en los resultados.

source: SMRF is good at avoiding Type I errors (small number of ground points mistakenly classified as non-ground) but only "acceptable" at avoiding Type II errors (large number non-ground points mistakenly classified as ground). This needs to be taken in consideration when generating DTMs that are meant to be used visually, since objects mistaken for ground look like artifacts in the final DTM.
ar: SMRF جيد في تجنب أخطاء النوع الأول (عدد صغير من نقاط الأرض المصنفة خطأً على أنها غير أرضية) ولكنها "مقبولة" فقط في تجنب أخطاء النوع الثاني (عدد كبير من النقاط غير الأرضية مصنفة خطأً كأرضية). يجب أن يؤخذ هذا في الاعتبار عند إنشاء DTMs التي من المفترض أن يتم استخدامها بصريًا ، لأن الكائنات التي تم الخلط بينها وبين الأرض تبدو وكأنها قطع أثرية في DTM النهائية.
es: SMRF es bueno para evitar errores de Tipo I (un pequeño número de puntos de tierra clasificados erróneamente como no terrestres) pero solo es "aceptable" para evitar errores de Tipo II (gran número de puntos no terrestres clasificados erróneamente como terrestres). Esto debe tenerse en cuenta al generar DTM para ser usados visualmente, ya que los objetos que se confunden con el suelo parecen artefactos en el DTM final.

source: Two other important parameters affect DEM generation:
ar: هناك معلمتان مهمتان أخريان تؤثران على توليد DEM:
es: Otros dos parámetros importantes afectan la generación de DEM:

source: ``--dem-resolution`` which sets the output resolution of the DEM raster (cm/pixel)
ar: "--dem-Resolution '' الذي يضبط دقة خرج DEM النقطية (سم / بكسل)
es: ``--dem-resolution`` que establece la resolución de salida del ráster DEM (cm/píxel)

source: ``--dem-gapfill-steps`` which determines the number of progressive DEM layers to use. For urban scenes increasing this value to `4-5` can help produce better interpolation results in the areas that are left empty by the SMRF filter.
ar: "-dem-gapfill-steps '' الذي يحدد عدد طبقات DEM التقدمية التي سيتم استخدامها. بالنسبة للمشاهد الحضرية ، يمكن أن تساعد زيادة هذه القيمة إلى "4-5" في تحقيق نتائج أفضل في الاستيفاء في المناطق التي تُركت فارغة بواسطة مرشح SMRF.
es: ``--dem-gapfill-steps`` que determina el número de capas DEM progresivas que se utilizarán. Para escenas urbanas, aumentar este valor a "4-5" puede ayudar a producir mejores resultados de interpolación en las áreas que quedan vacías por el filtro SMRF.

source: Example of how to generate a DTM::
ar: مثال على كيفية إنشاء DTM ::
es: Ejemplo de cómo generar un DTM::

source: Using Docker
ar: باستخدام Docker
es: Usando Docker

source: Since many users employ docker to deploy OpenDroneMap, it can be useful to understand some basic commands in order to interrogate the docker instances when things go wrong, or we are curious about what is happening. Docker is a containerized environment intended, among other things, to make it easier to deploy software independent of the local environment. In this way, it is similar to virtual machines.
ar: نظرًا لأن العديد من المستخدمين يستخدمون عامل إرساء لنشر OpenDroneMap ، فقد يكون من المفيد فهم بعض الأوامر الأساسية من أجل استجواب حالات عامل الميناء عندما تسوء الأمور ، أو نشعر بالفضول حيال ما يحدث. Docker هي بيئة حاويات تهدف ، من بين أمور أخرى ، إلى تسهيل نشر البرامج بشكل مستقل عن البيئة المحلية. بهذه الطريقة ، فهي تشبه الأجهزة الافتراضية.
es: Dado que muchos usuarios emplean Docker para implementar OpenDroneMap, puede ser útil comprender algunos comandos básicos para consultar a las instancias de Docker cuando las cosas van mal o si tenemos curiosidad por ver lo que está sucediendo. Docker es un entorno en contenedores destinado, entre otras cosas, a facilitar la implementación de software independientemente del entorno local. De esta forma, es similar a las máquinas virtuales.

source: A few simple commands can make our docker experience much better.
ar: يمكن لبعض الأوامر البسيطة أن تجعل تجربة docker أفضل بكثير.
es: Unos pocos comandos de Docker pueden mejorar mucho nuestra experiencia.

source: Listing Docker Machines
ar: ادراج Docker ماكينات
es: Listado de máquinas Docker

source: We can start by listing available docker machines on the current machine we are running as follows:
ar: يمكننا البدء بإدراج آلات الرصيف المتوفرة على الجهاز الحالي الذي نقوم بتشغيله على النحو التالي:
es: Podemos comenzar enumerando las máquinas Docker disponibles en la máquina actual que estamos ejecutando de la siguiente manera:

source: If we want to see machines that may not be running but still exist, we can add the `-a` flag:
ar: إذا أردنا رؤية الأجهزة التي قد لا تعمل ولكنها لا تزال موجودة ، فيمكننا إضافة علامة "-a":
es: Si queremos ver máquinas que pueden no estar ejecutándose pero que aún existen, podemos agregar la bandera `-a`:

source: Accessing logs on the instance
ar: الوصول إلى السجلات على سبيل المثال
es: Accediendo a los registros en la instancia

source: Using either the `CONTAINER ID` or the name, we can access any logs available on the machine as follows:
ar: باستخدام " CONTAINER ID" أو الاسم ، يمكننا الوصول إلى أي سجلات متاحة على الجهاز على النحو التالي:
es: Usando el `CONTAINER ID` o el nombre, podemos acceder a cualquier registro disponible en la máquina de la siguiente manera:

source: This is likely to be unwieldy large, but we can use a pipe `|` character and other tools to extract just what we need from the logs. For example we can move through the log slowly using the `more` command:
ar: من المحتمل أن يكون هذا كبير الحجم غير عملي ، ولكن يمكننا استخدام حرف `|` للأنبوب وأدوات أخرى لاستخراج ما نحتاجه فقط من السجلات. على سبيل المثال ، يمكننا التنقل عبر السجل ببطء باستخدام الأمر `more`:
es: Es probable que sea difícil de manejar, pero podemos usar un carácter de barra vertical `|` y otras herramientas para extraer exactamente lo que necesitamos de los registros. Por ejemplo, podemos movernos lentamente por el registro usando el comando `more`:

source: Pressing `Enter` or `Space`, arrow keys or `Page Up` or `Page Down` keys will now help us navigate through the logs. The lower case letter `Q` will let us escape back to the command line.
ar: الضغط على `Enter` أو` Space` أو مفاتيح الأسهم أو `Page Up` أو` Page Down` سيساعدنا الآن في التنقل عبر السجلات. الحرف الصغير `Q` سيتيح لنا الهروب إلى سطر الأوامر.
es: Presionar "Enter" o "Espacio", las teclas de flecha o las teclas "Page Up" o "Page Down" ahora nos ayudará a navegar por los registros. La letra minúscula "Q" nos permitirá volver a la línea de comandos.

source: We can also extract just the end of the logs using the `tail` commmand as follows:
ar: يمكننا أيضًا استخراج نهاية السجلات فقط باستخدام أمر "الذيل" كما يلي:
es: También podemos extraer solo el final de los registros usando el comando `tail` de la siguiente manera:

source: The value `-5` tells the tail command to give us just the last 5 lines of the logs.
ar: تخبر القيمة `-5` الأمر tail بإعطائنا الأسطر الخمسة الأخيرة فقط من السجلات.
es: El valor `-5` le dice al comando tail que nos dé solo las últimas 5 líneas de los registros.

source: Command line access to instances
ar: وصول سطر الأوامر إلى المثيلات
es: Acceso de línea de comando a las instancias

source: Sometimes we need to go a little deeper in our exploration of the process for OpenDroneMap. For this, we can get direct command line access to the machines. For this, we can use `docker exec` to execute a `bash` command line shell in the machine of interest as follows:
ar: في بعض الأحيان نحتاج إلى التعمق أكثر في استكشافنا لعملية OpenDroneMap. لهذا ، يمكننا الحصول على وصول مباشر لسطر الأوامر إلى الأجهزة. لهذا ، يمكننا استخدام `docker exec` لتنفيذ قذيفة سطر الأوامر` bash` في الجهاز المعني على النحو التالي:
es: A veces necesitamos profundizar un poco más en nuestra exploración del proceso de OpenDroneMap. Para ello, podemos obtener acceso directo a la línea de comandos de las máquinas. Para esto, podemos usar `docker exec` para ejecutar un shell de línea de comando` bash` en la máquina de interés de la siguiente manera:

source: Now we are logged into our docker instance and can explore the machine.
ar: الآن تم تسجيل دخولنا إلى مثيل عامل الميناء لدينا ويمكننا استكشاف الجهاز.
es: Ahora estamos conectados a nuestra instancia de Docker y podemos explorar la máquina.

source: Cleaning up after Docker
ar: التنظيف بعد Docker
es: Limpieza de Docker
